[
  "(1) Factor out a from ax² + bx. (2) Take half of b: (b/2). (3) Square it: (b/2)². (4) Add and subtract inside the parentheses. (5) Factor the perfect square and simplify.",
  "(1) Multiply equation(s) to make coefficients opposites. (2) Add the equations. (3) Solve for the remaining variable. (4) Substitute back to find the other variable.",
  "(1) Solve one equation for one variable (choose the easiest). (2) Substitute the expression into the other equation. (3) Solve the resulting one-variable equation. (4) Back-substitute to find the other variable.",
  "(1) Write objective function. (2) Write constraints as inequalities. (3) Graph feasible region. (4) Find corner points. (5) Evaluate objective function at each corner. (6) Identify the maximum/minimum.",
  "(x + p)² = x² + 2px + p². The constant term is the square of half the coefficient of x. To complete: take b/2, square it, then add and subtract.",
  "(x - h)² + (y - k)² = r². Center (h, k), radius r. Equation of tangent line perpendicular to radius at point of tangency. Distance formula finds radius given center and point.",
  "(x-c) is a factor of p(x) if and only if p(c) = 0. This connects zeros and factors. To test if (x-c) is a factor, check if p(c) = 0 using synthetic division (if remainder is 0, it's a factor).",
  "(x-h)²/a² + (y-k)²/b² = 1 (horizontal) or swap a, b (vertical). Center (h, k). Major axis length 2a, minor axis 2b. Foci at distance c where c² = a² - b². Eccentricity e = c/a",
  ". Solution is a ray (half-line), shown with open circle for </> or closed for ≤/≥.",
  "0 opens downward.",
  "0! = 1 (definition), 1! = 1, 2! = 2, 3! = 6, 4! = 24, etc. Grows very fast. Used in permutation and combination calculations.",
  "0).",
  "0). Vertex moves from (h,k₁) to (h,k₁+k). The shape doesn't change, only the position.",
  "0). Vertex moves from (h₁,k) to (h₁+h,k). The axis of symmetry shifts accordingly.",
  "0, the parabola flips.",
  "0: two complex conjugate solutions.",
  "1 (r is strictly between -1 and 1). The sum S = a/(1-r) is a finite value. When |r| ≥ 1, partial sums increase without bound.",
  "1 converges to a/(1-r). If |r| ≥ 1, the series diverges (sum is infinite or undefined). Tests for convergence depend on common ratio.",
  "1 for convergence. If convergent, S = a/(1-r). Useful for repeating decimals: 0.333... = 3/10 + 3/100 + 3/1000 + ... = (3/10)/(1 - 1/10) = 1/3.",
  "1). The graph is always positive and approaches 0 as x → -∞ (for growth).",
  "1, f(x) = ab^x decays. The smaller b, the faster decay. Graph approaches 0 from above as x → ∞. Common form: f(x) = a(1/2)^{x/h} where h is half-life.",
  "1, it compresses (gets wider). If a",
  "1. Slow growth: logarithmic growth is much slower than exponential.",
  "180°. Angle measured counterclockwise from standard position (positive ray of x-axis).",
  "7 is acidic, pH > 7 is basic. Henderson-Hasselbalch equation uses logarithms.",
  "90°, obtuse angle 90°",
  "A = Pe^{rt} is the continuous version of interest compounding. As compounding frequency increases, (1+r/n)^{nt} → e^{rt}. This is the most efficient interest calculation.",
  "A degree n polynomial with complex coefficients has exactly n zeros (counting multiplicity), all lying in ℂ (complex numbers). Real polynomials may have real or complex zeros.",
  "A faster method for dividing polynomials by linear factors of the form (x - c). More efficient than long division when the divisor is linear. Reduces calculation and is less error-prone.",
  "A method to find the maximum or minimum value of an objective function subject to linear constraints. Used in business for optimization problems.",
  "A sum of terms with non-negative integer exponents. Degree is the highest exponent. Leading coefficient is the coefficient of the highest-degree term. Standard form arranges terms from highest to lowest degree.",
  "A system of equations consists of two or more equations with the same variables. A solution must satisfy all equations simultaneously.",
  "A technique to rewrite ax² + bx + c as a perfect square trinomial plus a constant. This converts to vertex form y = a(x-h)² + k.",
  "AP Connections:",
  "Acute angle between terminal side and x-axis. Used to find trig values for any angle. Reference angle always between 0° and 90°.",
  "Add/subtract real parts and imaginary parts separately. Multiply using FOIL, remembering i² = -1. Divide by multiplying by the conjugate of the denominator.",
  "Adding Polynomials:",
  "Adding and Subtracting:",
  "Addition: ⟨a₁, b₁⟩ + ⟨a₂, b₂⟩ = ⟨a₁+a₂, b₁+b₂⟩ (parallelogram law). Scalar multiplication: c⟨a, b⟩ = ⟨ca, cb⟩. Dot product: u·v = |u||v|cos θ where θ is angle between vectors. Also u·v = a₁a₂ + b₁b₂.",
  "Advantages:",
  "Algebraic Methods:",
  "Algebraic Techniques:",
  "Always check for a common factor in all terms first. Factor out the GCF; this is factoring by grouping applied to all terms.",
  "Analyzing Behavior:",
  "Angle Between Vectors:",
  "Angles that differ by multiple of 360° (or 2π radians). Example: 30°, 390°, -330° are coterminal. Coterminal angle formula: θ + 360n° or θ + 2πn.",
  "Application Extensions:",
  "Applications:",
  "Arithmetic Sequence:",
  "Arithmetic with Complex Numbers:",
  "Arrangement of objects where ORDER MATTERS. n! = n × (n-1) × ... × 1. Permutations of n objects taken r at a time: P(n,r) = n!/(n-r)!. Example: arranging 3 of 5 books: P(5,3) = 5!/2! = 60.",
  "Assumptions for Linear Regression:",
  "Average Cost:",
  "Axis of symmetry:",
  "Based on arc length. 1 radian = arc length equals radius. Full rotation = 2π radians = 360°. Conversion: radians = degrees × π/180°, degrees = radians × 180°/π.",
  "Basic Trig Equations:",
  "Bayes' Theorem:",
  "Bell curve, symmetric around mean μ. Characterized by mean and standard deviation σ. Z-score: (X - μ)/σ standardizes to N(0,1). Empirical rule: 68% within 1σ, 95% within 2σ, 99.7% within 3σ.",
  "Between roots, the parabola is either entirely above or below the x-axis. Outside the roots, it's on the opposite side. The sign doesn't change within an interval.",
  "Binomial Coefficient:",
  "Bivariate data pairs (x, y) from paired observations. Scatterplot shows relationship. Trendline captures general pattern. Must distinguish correlation (relationship exists) from causation (one causes other).",
  "Break-Even Problems:",
  "Bring down the first coefficient. Multiply by c, add to the next coefficient. Repeat until all coefficients are processed. The last number is the remainder; other numbers are quotient coefficients.",
  "C(n,r) is the coefficient in binomial expansion (a+b)^n. Pascal's triangle shows these coefficients. C(n,0) = 1, C(n,n) = 1, C(n,r) = C(n,n-r).",
  "Change of Base Formula:",
  "Checking Reasonableness:",
  "Checking Solutions:",
  "Choosing 3 from {A,B,C,D,E}: combinations give ABC, ABD, ABE, ACD, ACE, ADE, BCD, BCE, BDE, CDE (10 total). Same objects in different order → same combination but different permutations.",
  "Circle with radius 1, center at origin. Point on circle: (cos θ, sin θ). Angles measured counterclockwise from (1, 0). Complete circle = 2π radians. Special angles: 0, π/6, π/4, π/3, π/2, etc.",
  "Circle:",
  "Combinations vs Permutations:",
  "Combinations:",
  "Combine like terms (same variable and exponent). Arrange terms in descending order. Group coefficients of each power separately.",
  "Combined with the Rational Root Theorem, these help identify possible zeros quickly. Test candidates using synthetic division (factor theorem). List factors and corresponding zeros systematically.",
  "Combining Transformations:",
  "Common Application Types:",
  "Common angles have known exact values. sin(0) = 0, sin(π/6) = 1/2, sin(π/4) = √2/2, sin(π/3) = √3/2, sin(π/2) = 1. Cosine values reverse for complement.",
  "Comparing Functions:",
  "Complex Conjugates:",
  "Complex Fractions:",
  "Complex Numbers:",
  "Complex mixture problems with three or more substances. Optimization problems with multiple constraints and real-world parameters.",
  "Components:",
  "Compound interest A = P(1 + r/n)^{nt}. Continuous compounding: A = Pe^{rt}. Present value given future value. Investment problems using logarithms to solve for time.",
  "Concentration and Mixture:",
  "Conditional Probability:",
  "Confidence Intervals:",
  "Conic Sections Definition:",
  "Consistent and dependent:",
  "Consistent and independent:",
  "Constraints:",
  "Continuous Compound Interest:",
  "Continuous growth: A(t) = Pe^{rt}. Compound interest: A(t) = P(1 + r/n)^{nt}. Both are exponential models with slightly different forms.",
  "Convergence Condition:",
  "Cooling Law:",
  "Cosine Function:",
  "Coterminal Angles:",
  "Count sign changes in p(x) to estimate positive roots. Count sign changes in p(-x) to estimate negative roots. Number of real roots of each type is at most this count and differs by an even number.",
  "Cross-Multiplication:",
  "Curves formed by intersecting plane with a cone. Circle: plane perpendicular to axis. Ellipse: plane at angle. Parabola: plane parallel to side. Hyperbola: plane cuts both nappes.",
  "De Moivre's Theorem:",
  "Decibel Scale:",
  "Decision Rule:",
  "Degree Measure:",
  "Dependent Events:",
  "Derivatives Parametrically:",
  "Descartes' Rule of Signs:",
  "Describe curve using x = f(t), y = g(t) where t is parameter. Often t represents time. Example: x = 3cos(t), y = 3sin(t), t ∈ [0, 2π] traces circle x² + y² = 9. Eliminates parameter to get Cartesian equation.",
  "Determine by comparing degrees of numerator and denominator. If degree of numerator",
  "Determined by the degree and leading coefficient. For very large/small x, the polynomial behaves like its leading term ax^n. Odd degree with positive a: goes from bottom-left to top-right. Negative a: top-left to bottom-right.",
  "Difference of Squares:",
  "Discriminant tells us about roots without solving. Helps predict the graph: two x-intercepts, one x-intercept, or no x-intercepts.",
  "Distance problems:",
  "Distribute the negative sign to all terms of the polynomial being subtracted, then combine like terms. Be careful with signs!",
  "Dividing:",
  "Does the solution make sense in context? For quantities, expect positive values. For rates, check if they're realistic. Always verify by substituting into the original problem.",
  "Domain and Range:",
  "Domain is all real numbers. Range depends on the vertex and direction. If opens up: range is [k, ∞). If opens down: range is (-∞, k].",
  "Double Angle Formulas:",
  "Eliminating Parameter:",
  "Elimination is more efficient when coefficients are large or when substitution creates messy fractions. It avoids the need to isolate variables first.",
  "Ellipse:",
  "End Behavior:",
  "Equations with rational expressions. Find the LCD of all denominators. Multiply every term by the LCD to clear denominators. Solve the resulting polynomial equation. Always check solutions in the original equation.",
  "Equivalent Expressions:",
  "Euler's Formula & Applications:",
  "Events A and B are dependent if P(A then B) = P(A) · P(B|A) where P(B|A) is conditional probability of B given A occurred. Drawing without replacement creates dependency.",
  "Events A and B are independent if P(A and B) = P(A) · P(B). One event doesn't affect the other. Examples: coin flips, die rolls.",
  "Exact Values:",
  "Exponential Decay:",
  "Exponential Functions:",
  "Exponential Growth:",
  "Exponential equations: check by substituting. Logarithmic equations: verify that arguments are positive (domain restriction of logarithm). Extraneous solutions can appear when applying properties.",
  "Exponential growth/decay (bacteria, investments). Fractals and self-similar structures. Bouncing ball problems (heights form geometric sequence). Depreciation: asset value decreases by constant percentage.",
  "Extend elimination and substitution methods to three equations with three unknowns. Use matrix notation or repeated elimination to solve systematically.",
  "Extraneous Solutions:",
  "Factor all numerators and denominators. Cancel common factors. Multiply remaining numerators and denominators. Result is automatically simplified. Watch for restrictions from cancelled factors.",
  "Factor numerator and denominator completely. Cancel common factors. Be careful: you can only cancel factors, not terms. The cancelled term represents the restriction on the domain.",
  "Factor: sin x cos x - sin x = 0 → sin x (cos x - 1) = 0. Quadratic formula: 2 sin² x - sin x - 1 = 0 using substitution u = sin x. Use identities to simplify before solving.",
  "Factorial:",
  "Factoring Trinomials:",
  "Feasible region:",
  "Finance:",
  "Find a common denominator (usually the LCD). Rewrite each fraction. Add/subtract numerators; denominator stays the same. Simplify the result. Include domain restrictions from both original expressions.",
  "Find vertical asymptotes and holes. Find horizontal asymptotes. Find x-intercepts and y-intercept. Plot several test points. Sketch smoothly, respecting asymptotes and approaching them asymptotically.",
  "Find where revenue equals cost. Set profit function equal to zero or set revenue equal to expense. The intersection point is the break-even point.",
  "Find zeros and their multiplicities. Determine end behavior. Plot a few additional points. Connect smoothly, respecting behavior at zeros.",
  "Finding Key Points:",
  "Finding Probabilities:",
  "Finding Restrictions:",
  "Finding Sum:",
  "Finding Terms:",
  "Finding Zeros:",
  "Finding the Vertex:",
  "Finding the vertex of a parabola. Verifying solutions to quadratic equations. Converting to forms for specific uses like optimization problems.",
  "First, identify first term a and common ratio r. Check |r|",
  "For a + bi, the conjugate is a - bi. When a polynomial with real coefficients has a complex zero, its conjugate is also a zero. Complex zeros come in conjugate pairs.",
  "For ax² + bx + c, find two numbers that multiply to ac and add to b. Use these to split the middle term, then factor by grouping. Alternatively, use the AC method.",
  "For equations like A/B = C/D, cross-multiply: AD = BC. This shortcut is valid and often simpler than finding LCD, but still check for extraneous solutions.",
  "For n(x)/d(x) where deg(n) = deg(d) + 1, divide to get quotient q(x) + remainder. The asymptote is y = q(x). As x → ±∞, the function approaches this line.",
  "For polynomial p(x) with integer coefficients, any rational root p/q (in lowest terms) has p dividing the constant term and q dividing the leading coefficient. This narrows possible rational zeros significantly.",
  "Form a + bi where a and b are real and i² = -1. Real part is a, imaginary part is b. Complex numbers extend our number system to allow nth roots of any polynomial.",
  "Form f(x) = ab^x where a ≠ 0, b > 0, b ≠ 1. Base b determines growth (b > 1) or decay (0",
  "Fractions with fractions in numerator/denominator. Simplify by finding LCM of all denominators and multiplying numerator and denominator by it. Or treat numerator and denominator separately, simplify, then divide.",
  "Fractions with polynomials in numerator and denominator. Form P(x)/Q(x) where Q(x) ≠ 0. Domain excludes values making the denominator zero (restrictions).",
  "Full rotation = 360°. Right angle = 90°. Straight angle = 180°. Acute angle",
  "Function Notation:",
  "Functions",
  "Functions can be combined through addition, subtraction, multiplication, and division. Composition of functions (f ∘ g)(x) = f(g(x)) means apply g first, then apply f to the result.",
  "Functions of the form f(x) = ax² + bx + c where a ≠ 0. The graph is a parabola (U-shaped curve). The coefficient a determines the direction: a > 0 opens upward, a",
  "Fundamental Counting Principle:",
  "Fundamental Identities:",
  "Fundamental Theorem of Algebra:",
  "Geometric Sequence:",
  "Geometric series converges if and only if |r|",
  "Given a_1 and r, find any term using a_n = a_1 · r^{n-1}. Common ratio: r = a_{n+1}/a_n. Handle negative ratios (alternating sign sequences). To insert geometric means between two terms, compute appropriate r and generate intermediates.",
  "Given probability, find the value. Example: Find c such that P(X",
  "Graph Characteristics:",
  "Graph both inequalities on the same coordinate plane. The solution region is where both conditions overlap (shaded regions intersect). This creates a bounded or unbounded region.",
  "Graph each line and find intersection point(s). One intersection = unique solution. Parallel lines = no solution. Same line = infinitely many solutions.",
  "Graphical Solutions:",
  "Graphing Linear Equations:",
  "Graphing on Number Line:",
  "Greatest Common Factor (GCF):",
  "Half-Life:",
  "Height h(t) = -16t² + v₀t + h₀, where v₀ is initial velocity and h₀ is initial height. The maximum height occurs at the vertex. Set h(t) = 0 to find when the object hits the ground.",
  "Higher-degree polynomials appear in optimization in calculus. Taylor series approximate functions using polynomials. Interpolation fits n points with degree n-1 polynomial.",
  "Holes in the Graph:",
  "Horizontal Asymptotes:",
  "Horizontal Shifts:",
  "Horizontal:",
  "Hypothesis Testing:",
  "Identify the unknowns and assign variables. Translate each sentence into an equation. For mixture, distance, and investment problems, organize information in a table.",
  "Identify the variable (usually time or quantity). Write the quadratic equation based on given information. Use the vertex to find maximum/minimum, or solve equations for specific outcomes.",
  "If (x-c) appears k times in the factorization, c has multiplicity k. At an intercept with odd multiplicity, the graph crosses the x-axis. With even multiplicity, it touches but doesn't cross.",
  "If bases are equal, exponents are equal: b^m = b^n → m = n. If bases aren't equal, take logarithm of both sides. Use logarithm properties to simplify.",
  "If first event has m outcomes and second event has n outcomes, total outcomes is m × n. Extends to multiple events: multiply all possibilities. Example: 3 appetizers, 4 mains, 2 desserts → 3 × 4 × 2 = 24 meals.",
  "If fixed cost is F and variable cost per unit is v, total cost C(n) = F + vn for n units. Average cost A(n) = C(n)/n = (F + vn)/n. This is a rational function with a horizontal asymptote at y = v.",
  "If numerator and denominator share a factor (x-c), both have a zero at c. This cancels to a hole (removable discontinuity), not an asymptote. Find the y-coordinate by evaluating the simplified function at x = c.",
  "If one person completes a job in a hours and another in b hours, together they complete it in 1/(1/a + 1/b) hours. These lead to rational equations.",
  "If p-value",
  "If r is a zero of p(x), then (x-r) is a factor. Zeros are x-intercepts of the graph. By the Fundamental Theorem of Algebra, a polynomial of degree n has n zeros (counting multiplicity).",
  "If r ≠ 1: S_n = a_1(1 - r^n)/(1 - r) = a_1(r^n - 1)/(r - 1). If r = 1: S_n = na_1. The formula works even with negative r.",
  "If the same variable has coefficients like 2 and 3, multiply the first equation by 3 and the second by -2 to create coefficients 6 and -6. When added, they cancel.",
  "If x grams of substance are diluted in y milliliters of liquid, concentration = x/y g/mL. Adding more liquid increases denominator, decreasing concentration. These become rational function models.",
  "Inconsistent:",
  "Independent Events:",
  "Induction Examples:",
  "Inequalities like ax² + bx + c > 0. First solve the corresponding equation ax² + bx + c = 0 to find boundary points. These boundary points divide the number line into intervals.",
  "Infinite Geometric Series:",
  "Interpreting Results:",
  "Interpreting Solutions:",
  "Inverse Problem:",
  "Inverse Trigonometric Functions:",
  "Investment problems:",
  "Isolate the variable using inverse operations. Always perform the same operation on both sides to maintain equality. Check solutions by substituting back into the original equation.",
  "Jump:",
  "Key Concepts: Advanced Linear Applications (AP Prep)",
  "Key Concepts: Angles & Angle Measures",
  "Key Concepts: Applications & Mathematical Induction (AP Prep)",
  "Key Concepts: Applications of Exponentials & Logs",
  "Key Concepts: Applications of Linear Systems",
  "Key Concepts: Applications of Quadratics",
  "Key Concepts: Applications of Rational Functions (AP Prep)",
  "Key Concepts: Applications of Trigonometry (AP Prep)",
  "Key Concepts: Arithmetic Sequences",
  "Key Concepts: Asymptotes & Discontinuities",
  "Key Concepts: Completing the Square",
  "Key Concepts: Complex Numbers & Polynomial Roots",
  "Key Concepts: Complex Numbers in Polar Form",
  "Key Concepts: Conditional Probability",
  "Key Concepts: Conic Sections",
  "Key Concepts: Correlation & Linear Regression (AP Prep)",
  "Key Concepts: Counting Principles",
  "Key Concepts: Exponential & Logarithmic Equations",
  "Key Concepts: Exponential Decay & Applications",
  "Key Concepts: Exponential Functions & Growth",
  "Key Concepts: Factoring Polynomials",
  "Key Concepts: Geometric Sequences",
  "Key Concepts: Graphing Quadratic Functions",
  "Key Concepts: Graphing Rational Functions",
  "Key Concepts: Graphs of Trigonometric Functions",
  "Key Concepts: Higher-Degree Polynomials (AP Prep)",
  "Key Concepts: Hypothesis Testing & Confidence Intervals",
  "Key Concepts: Inequalities & System of Inequalities",
  "Key Concepts: Infinite Geometric Series",
  "Key Concepts: Linear Equations & Graphing",
  "Key Concepts: Linear Programming",
  "Key Concepts: Logarithmic Functions & Graphs",
  "Key Concepts: Logarithms & Properties",
  "Key Concepts: Natural Logarithms & e (AP Prep)",
  "Key Concepts: Normal Distributions",
  "Key Concepts: Operations on Rational Expressions",
  "Key Concepts: Parametric Equations",
  "Key Concepts: Permutations & Combinations",
  "Key Concepts: Polynomial Graphs & Zeros",
  "Key Concepts: Polynomial Operations",
  "Key Concepts: Probability Basics & Events",
  "Key Concepts: Quadratic Formula & Discriminant",
  "Key Concepts: Quadratic Functions & Parabolas",
  "Key Concepts: Quadratic Inequalities (AP Prep)",
  "Key Concepts: Rational Equations",
  "Key Concepts: Rational Expressions",
  "Key Concepts: Remainder & Factor Theorems",
  "Key Concepts: Review of Functions & Notation",
  "Key Concepts: Series & Summation Notation",
  "Key Concepts: Solving Systems by Elimination",
  "Key Concepts: Solving Systems by Substitution",
  "Key Concepts: Solving Trigonometric Equations",
  "Key Concepts: Synthetic Division",
  "Key Concepts: Systems of Linear Equations",
  "Key Concepts: Transformations of Quadratics",
  "Key Concepts: Trigonometric Identities",
  "Key Concepts: Unit Circle & Trigonometric Ratios",
  "Key Concepts: Vectors & Vector Operations",
  "Key Features:",
  "Key Properties:",
  "Law of Cosines:",
  "Law of Sines:",
  "Lesson 1.1: Review of Functions & Notation",
  "Lesson 1.1: Review of Functions & Notation - Summary",
  "Lesson 1.2: Linear Equations & Graphing",
  "Lesson 1.2: Linear Equations & Graphing - Summary",
  "Lesson 1.3: Systems of Linear Equations",
  "Lesson 1.3: Systems of Linear Equations - Summary",
  "Lesson 1.4: Solving Systems by Substitution",
  "Lesson 1.4: Solving Systems by Substitution - Summary",
  "Lesson 1.5: Solving Systems by Elimination",
  "Lesson 1.5: Solving Systems by Elimination - Summary",
  "Lesson 1.6: Applications of Linear Systems",
  "Lesson 1.6: Applications of Linear Systems - Summary",
  "Lesson 1.7: Inequalities & System of Inequalities",
  "Lesson 1.7: Inequalities & System of Inequalities - Summary",
  "Lesson 1.8: Linear Programming",
  "Lesson 1.8: Linear Programming - Summary",
  "Lesson 1.9: Advanced Linear Applications - Summary",
  "Lesson 1.9: Advanced Linear Applications ⭐",
  "Lesson 2.1: Quadratic Functions & Parabolas",
  "Lesson 2.1: Quadratic Functions & Parabolas - Summary",
  "Lesson 2.2: Transformations of Quadratics",
  "Lesson 2.2: Transformations of Quadratics - Summary",
  "Lesson 2.3: Completing the Square",
  "Lesson 2.3: Completing the Square - Summary",
  "Lesson 2.4: Quadratic Formula & Discriminant",
  "Lesson 2.4: Quadratic Formula & Discriminant - Summary",
  "Lesson 2.5: Graphing Quadratic Functions",
  "Lesson 2.5: Graphing Quadratic Functions - Summary",
  "Lesson 2.6: Applications of Quadratics",
  "Lesson 2.6: Applications of Quadratics - Summary",
  "Lesson 2.7: Quadratic Inequalities - Summary",
  "Lesson 2.7: Quadratic Inequalities ⭐",
  "Lesson 3.1: Polynomial Operations",
  "Lesson 3.1: Polynomial Operations - Summary",
  "Lesson 3.2: Factoring Polynomials",
  "Lesson 3.2: Factoring Polynomials - Summary",
  "Lesson 3.3: Synthetic Division",
  "Lesson 3.3: Synthetic Division - Summary",
  "Lesson 3.4: Polynomial Graphs & Zeros",
  "Lesson 3.4: Polynomial Graphs & Zeros - Summary",
  "Lesson 3.5: Remainder & Factor Theorems",
  "Lesson 3.5: Remainder & Factor Theorems - Summary",
  "Lesson 3.6: Complex Numbers & Polynomial Roots",
  "Lesson 3.6: Complex Numbers & Polynomial Roots - Summary",
  "Lesson 3.7: Higher-Degree Polynomials - Summary",
  "Lesson 3.7: Higher-Degree Polynomials ⭐",
  "Lesson 4.1: Rational Expressions",
  "Lesson 4.1: Rational Expressions - Summary",
  "Lesson 4.2: Operations on Rational Expressions",
  "Lesson 4.2: Operations on Rational Expressions - Summary",
  "Lesson 4.3: Rational Equations",
  "Lesson 4.3: Rational Equations - Summary",
  "Lesson 4.4: Graphing Rational Functions",
  "Lesson 4.4: Graphing Rational Functions - Summary",
  "Lesson 4.5: Asymptotes & Discontinuities",
  "Lesson 4.5: Asymptotes & Discontinuities - Summary",
  "Lesson 4.6: Applications of Rational Functions - Summary",
  "Lesson 4.6: Applications of Rational Functions ⭐",
  "Lesson 5.1: Exponential Functions & Growth",
  "Lesson 5.1: Exponential Functions & Growth - Summary",
  "Lesson 5.2: Exponential Decay & Applications",
  "Lesson 5.2: Exponential Decay & Applications - Summary",
  "Lesson 5.3: Logarithms & Properties",
  "Lesson 5.3: Logarithms & Properties - Summary",
  "Lesson 5.4: Logarithmic Functions & Graphs",
  "Lesson 5.4: Logarithmic Functions & Graphs - Summary",
  "Lesson 5.5: Exponential & Logarithmic Equations",
  "Lesson 5.5: Exponential & Logarithmic Equations - Summary",
  "Lesson 5.6: Applications of Exponentials & Logs",
  "Lesson 5.6: Applications of Exponentials & Logs - Summary",
  "Lesson 5.7: Natural Logarithms & e - Summary",
  "Lesson 5.7: Natural Logarithms & e ⭐",
  "Lesson 6.1: Arithmetic Sequences",
  "Lesson 6.1: Arithmetic Sequences - Summary",
  "Lesson 6.2: Geometric Sequences",
  "Lesson 6.2: Geometric Sequences - Summary",
  "Lesson 6.3: Series & Summation Notation",
  "Lesson 6.3: Series & Summation Notation - Summary",
  "Lesson 6.4: Infinite Geometric Series",
  "Lesson 6.4: Infinite Geometric Series - Summary",
  "Lesson 6.5: Applications & Mathematical Induction - Summary",
  "Lesson 6.5: Applications & Mathematical Induction ⭐",
  "Lesson 7.1: Counting Principles",
  "Lesson 7.1: Counting Principles - Summary",
  "Lesson 7.2: Permutations & Combinations",
  "Lesson 7.2: Permutations & Combinations - Summary",
  "Lesson 7.3: Probability Basics & Events",
  "Lesson 7.3: Probability Basics & Events - Summary",
  "Lesson 7.4: Conditional Probability",
  "Lesson 7.4: Conditional Probability - Summary",
  "Lesson 7.5: Normal Distributions",
  "Lesson 7.5: Normal Distributions - Summary",
  "Lesson 7.6: Hypothesis Testing & Confidence Intervals",
  "Lesson 7.6: Hypothesis Testing & Confidence Intervals - Summary",
  "Lesson 7.7: Correlation & Linear Regression - Summary",
  "Lesson 7.7: Correlation & Linear Regression ⭐",
  "Lesson 8.1: Angles & Angle Measures",
  "Lesson 8.1: Angles & Angle Measures - Summary",
  "Lesson 8.2: Unit Circle & Trigonometric Ratios",
  "Lesson 8.2: Unit Circle & Trigonometric Ratios - Summary",
  "Lesson 8.3: Graphs of Trigonometric Functions",
  "Lesson 8.3: Graphs of Trigonometric Functions - Summary",
  "Lesson 8.4: Trigonometric Identities",
  "Lesson 8.4: Trigonometric Identities - Summary",
  "Lesson 8.5: Solving Trigonometric Equations",
  "Lesson 8.5: Solving Trigonometric Equations - Summary",
  "Lesson 8.6: Applications of Trigonometry - Summary",
  "Lesson 8.6: Applications of Trigonometry ⭐",
  "Lesson 9.1: Conic Sections",
  "Lesson 9.1: Conic Sections - Summary",
  "Lesson 9.2: Parametric Equations",
  "Lesson 9.2: Parametric Equations - Summary",
  "Lesson 9.3: Vectors & Vector Operations",
  "Lesson 9.3: Vectors & Vector Operations - Summary",
  "Lesson 9.4: Complex Numbers in Polar Form",
  "Lesson 9.4: Complex Numbers in Polar Form - Summary",
  "Line: r(t) = r₀ + tv (parametric form). Projectile motion: r(t) = (vcos α)t i + ((vsin α)t - ½gt²) j. Work: W = F·d. Physics problems model forces and motion as vectors.",
  "Linear Inequalities:",
  "Linear functions grow fastest for small x, but exponential eventually dominates. Logarithmic functions grow slowest. For very large x: exponential > linear > logarithmic.",
  "Linear patterns in data. Counting: total items in stepped arrangement. Time intervals: events at regular intervals. Savings plans: deposit fixed amount each period.",
  "Linear programming and system optimization appear in AP Calculus as constrained optimization and Lagrange multipliers. Understanding these foundations is essential for advanced mathematics.",
  "Linearity (relationship is linear), independence (observations independent), normality (residuals approximately normal), equal variance (residuals have constant spread for all x).",
  "List all factors of the constant term and leading coefficient. Form possible rational roots. Test each using synthetic division (or p(c) = 0). This is efficient for polynomials degree 3 and higher.",
  "Loan amortization uses series formulas. Monthly payment computed using present value of annuity. Stock dividend accumulation. Pendulum oscillation amplitudes (geometric decay). Recursive sequences define many real systems.",
  "Logarithm Definition:",
  "Logarithmic Functions:",
  "Logarithmic Properties:",
  "Making Coefficients Opposite:",
  "Many problems use C(n,r) to count favorable outcomes. Example: probability of 2 heads in 3 coin flips: C(3,2)/2^3 = 3/8. Lottery odds: C(49,6) total combinations.",
  "Mark the boundary point. Shade left of the point if x < or x ≤, right if x > or x ≥. Use open circle for strict inequalities, closed for ≤/≥.",
  "Mark the roots on a number line. Test one x-value in each interval in the original inequality. If true, the entire interval is part of the solution. If false, the interval is excluded.",
  "Mathematical Induction:",
  "Mathematical induction foundation for many calculus proofs and theorem verification. Recursive functions and sequences central to analysis. The principle of induction connects to the completeness axiom in real number system, essential for rigorous calculus development.",
  "Mean = 0, standard deviation = 1. Denoted Z ~ N(0,1). Z-table gives cumulative probability P(Z ≤ z). Any normal random variable can be converted to standard form: Z = (X - μ)/σ.",
  "Medical diagnosis: likelihood of disease given test result. Quality control: probability defective given supplier. Database queries: probability matching criteria given constraints.",
  "Mixture problems:",
  "Models like P(x) = kx/(1 + ax) where productivity increases then levels off. The horizontal asymptote k/a represents maximum productivity as x → ∞.",
  "Multiplication & Division in Polar Form:",
  "Multiplicity:",
  "Multiply by the reciprocal: (P/Q) ÷ (R/S) = (P/Q) × (S/R). Simplify as with multiplication. Important: the reciprocal's denominator is S, which must be non-zero.",
  "Multiply one or both equations by constants so that one variable has opposite coefficients. Add the equations to eliminate that variable, leaving one equation with one unknown.",
  "Multiplying Polynomials:",
  "Multiplying:",
  "N(t) = N_0 e^{-μt} where λ is decay constant. Relates to half-life: half-life = ln(2)/λ. Used for carbon dating and nuclear material calculations.",
  "Natural Logarithm:",
  "Natural exponential and logarithm are the fundamental functions in calculus. d/dx(e^x) = e^x and d/dx(ln x) = 1/x. Integration of 1/x gives ln|x|. Taylor series for e^x, sin(x), cos(x) appear throughout calculus.",
  "Navigation and bearings: angle measured from north. Height problems: angle of elevation/depression. Projectile motion: initial velocity at angle θ. Harmonic motion: position = A cos(ωt + φ).",
  "Near vertical asymptote, function approaches +∞ or -∞ depending on sign of denominator from left/right. Test points on either side to determine which direction.",
  "Non-removable/infinite:",
  "Normal Distribution:",
  "Objective function:",
  "Oblique (slant):",
  "Oblique Asymptotes:",
  "Occur at x-values where denominator is zero (and not cancelled by numerator). These are \"forbidden\" x-values. Graph approaches these lines but never touches them. Plot as dashed vertical lines.",
  "Once a_1 and d known, any term can be found: a_n = a_1 + (n-1)d. To find d: d = (a_m - a_k)/(m - k). To insert arithmetic means between two terms, find common difference and generate intermediate terms.",
  "Operations with Functions:",
  "Optimization:",
  "Organize data for two categorical variables. Cell entries are counts. Marginal distributions shown in totals. Conditional probabilities calculated by dividing cell by row/column total.",
  "P(A|B) = P(A and B) / P(B). Probability of A given B has occurred. Denominator is not 100% but P(B). Example: P(roll 3 | die is even) = P(3 and even) / P(even) = 0 / (1/2) = 0.",
  "P(A|B) = P(B|A) · P(A) / P(B). Relates conditional probabilities in both directions. Used in medical testing: P(disease|positive test) involves test accuracy.",
  "P(X ≤ a) requires standardizing to Z, then using table. P(a",
  "P(event) = (favorable outcomes)/(total outcomes) for equally likely outcomes. Ranges from 0 (impossible) to 1 (certain). 0% to 100%. Complement rule: P(not A) = 1 - P(A).",
  "P(t) = P_0 e^{rt} (continuous) or P(t) = P_0(1+r)^t (discrete). r is growth rate. Doubling time: 0.693/r (continuous). Applications: bacteria, human population, viral spread.",
  "P(x)/Q(x) and [P(x) × R(x)]/[Q(x) × R(x)] are equivalent rational expressions (same domain restrictions). Use this to find common denominators or create equivalent forms.",
  "Parabola & Hyperbola:",
  "Parabola: (y-k)² = 4p(x-h) (horizontal) or (x-h)² = 4p(y-k) (vertical). Vertex (h, k), focus, directrix p units away. Hyperbola: (x-h)²/a² - (y-k)²/b² = 1 (horizontal) or reversed. Asymptotes: y - k = ±(b/a)(x - h). Eccentricity e = c/a > 1 where c² = a² + b².",
  "Parametric Representation:",
  "Passes through (1, 0) because log_b(1) = 0. Passes through (b, 1) because log_b(b) = 1. Increasing if b > 1, decreasing if 0",
  "Passwords: each position could be different letter/digit. Seating arrangements. Top finishers in race. Anagrams of words (with and without repeated letters).",
  "Perfect Square Trinomials:",
  "Perfect square trinomials: a² + 2ab + b² = (a+b)². Sum/difference of cubes: a³ + b³ = (a+b)(a²-ab+b²). Factoring by grouping for four-term polynomials.",
  "Perimeter problems that lead to area quadratics. Garden fence problems: find dimensions that maximize area with fixed perimeter. Area = length × width, then substitute using the constraint.",
  "Periodicity & Signs:",
  "Permutations:",
  "Pick a test point in the shaded region to verify it satisfies both inequalities. The entire shaded region represents the solution set.",
  "Plot the vertex and axis of symmetry first. Plot the y-intercept and its symmetric point. Find and plot x-intercepts if they exist. Use the shape (determined by a) to sketch a smooth U or inverted-U curve.",
  "Plot the y-intercept, then use slope to find another point. Slope indicates rise over run: positive slopes go ↗, negative slopes go ↘.",
  "Point-Slope Form:",
  "Polar Form of Complex Numbers:",
  "Polynomial Definition:",
  "Population Growth:",
  "Power Reduction:",
  "Practical Applications:",
  "Prepare to learn substitution and elimination methods in the next lessons. Both methods transform the system to isolate variables and find the solution.",
  "Probability Definition:",
  "Probability with Combinations:",
  "Product: z₁z₂ = r₁r₂ cis(θ₁ + θ₂). Quotient: z₁/z₂ = (r₁/r₂) cis(θ₁ - θ₂). Real and imaginary parts multiply in polar but angles add/subtract.",
  "Productivity and Diminishing Returns:",
  "Profit P(x) = Revenue - Cost = R(x) - C(x). Often quadratic. Find maximum profit at the vertex. Break-even points are where P(x) = 0 (setting revenue equal to cost).",
  "Profit and Revenue:",
  "Projectile Motion:",
  "Projectile motion: x(t) = v₀cos θ·t, y(t) = v₀sin θ·t - ½gt². Cycloid: x = r(t - sin t), y = r(1 - cos t). Parametric curves used extensively in physics and calculus for motion analysis.",
  "Proof technique for statements about all positive integers. Two steps: (1) Base case: prove statement true for n = 1. (2) Inductive step: assume true for n = k, prove it's true for n = k+1. Proves infinitely many cases with finite work.",
  "Properties of Exponents:",
  "Prove Σ_{i=1}^{n} i = n(n+1)/2. Prove geometric sequence formula a_n = a_1 · r^{n-1}. Prove statements about divisibility: 3^n - 1 is always divisible by 2.",
  "Quadratic Functions:",
  "Quotient has degree one less than the dividend. If remainder is 0, (x-c) is a factor. If remainder is non-zero, R(x) = R and result is Q(x) + R/(x-c).",
  "Radian Measure:",
  "Radioactive Decay:",
  "Radioactive decay: N(t) = N_0 e^{-μt}. Half-life calculation when N(t) = N_0/2. pH in chemistry: pH = -log[H⁺]. Earthquake magnitude: M = log(I/I_0).",
  "Range estimate for population parameter. 95% confidence interval means 95% of such intervals would contain true parameter. General formula: estimate ± (critical value) × (standard error). For mean: x̄ ± t* × s/√n.",
  "Rational Expressions:",
  "Rational Root Theorem:",
  "Rational functions appear in optimization problems (minimize cost, maximize profit). L'Hôpital's Rule in calculus uses these to evaluate limits. Partial fraction decomposition is used for integration.",
  "Reading the Result:",
  "Real-World Applications:",
  "Real-World Models:",
  "Reference Angles:",
  "Regression Line Equation:",
  "Regression inference (confidence intervals, hypothesis tests) are central to AP Statistics. Understanding sampling distributions of estimators connects to calculus-based probability and limits. LOWESS regression and smoothing lead to advanced statistical methods.",
  "Removable:",
  "Repeating decimals to fractions. Fractal areas and lengths (Koch snowflake). Loan and mortgage calculations using present value. Annuities and perpetuities in finance.",
  "S_n = (n/2)(a_1 + a_n) = (n/2)(2a_1 + (n-1)d). Gauss's formula: sum of first n positive integers is n(n+1)/2. Sum is always the average of first and last term, times the count.",
  "Sample Space & Events:",
  "Sample space is all possible outcomes. Event is subset of sample space. Experiment can produce random outcomes. Example: die roll has sample space {1,2,3,4,5,6}.",
  "Selection of objects where ORDER DOESN'T MATTER. C(n,r) = n!/(r!(n-r)!), also written \"n choose r\". Always C(n,r) ≤ P(n,r). Example: choosing 3 of 5 books: C(5,3) = 5!/(3!2!) = 10.",
  "Sequence with constant difference d between consecutive terms. a_n = a_1 + (n-1)d. Example: 2, 5, 8, 11, 14... has a_1 = 2, d = 3. The common difference can be negative or zero.",
  "Sequence with constant ratio r between consecutive terms. a_n = a_1 · r^{n-1}. Example: 2, 6, 18, 54... has a_1 = 2, r = 3. Each term is r times the previous term.",
  "Series where consecutive terms cancel: Σ (a_i - a_{i+1}) = a_1 - a_{n+1}. Useful for partial fractions decomposition.",
  "Series:",
  "Set denominator equal to zero: Q(x) = 0. Solve for x. These x-values are excluded from the domain. Write in domain restriction notation.",
  "Setting Up Real-World Models:",
  "Setting Up Synthetic Division:",
  "Setting Up Word Problems:",
  "Similar to equations, but with <, >, ≤, or ≥. When multiplying or dividing by a negative,",
  "Simplifying Rational Expressions:",
  "Sine Function:",
  "Sketching Polynomials:",
  "Sketching the Graph:",
  "Sketching the Parabola:",
  "Slope-Intercept Form:",
  "Solutions on Intervals:",
  "Solve one equation for a variable, then substitute that expression into the other equation. This reduces the system to one equation with one variable.",
  "Solve one equation for t, substitute into other. Example: x = 2t + 1, y = t² → t = (x-1)/2 → y = ((x-1)/2)². Check for domain/range restrictions preserved in conversion.",
  "Solve systems where coefficients may contain variables or parameters. Determine when solutions exist and predict how parameters affect the solution.",
  "Solving Exponential Equations:",
  "Solving Linear Equations:",
  "Solving Logarithmic Equations:",
  "Solving Quadratic Inequalities:",
  "Solving Rational Equations:",
  "Solving Steps:",
  "Special Patterns:",
  "Special Sums:",
  "Specify interval like [0, 2π] to list finite. For x ∈ [0, 2π], sin x = 1/2 has solutions x = π/6, 5π/6. Check domain restrictions (tan x undefined at π/2, etc.).",
  "Standard Normal Distribution:",
  "Standard and Vertex Forms:",
  "Standard form: f(x) = ax² + bx + c. Vertex form: f(x) = a(x-h)² + k, where (h,k) is the vertex. Vertex form makes the parabola's features immediately visible.",
  "Step-by-Step Process:",
  "Substitute a, b, c correctly (watch signs!). Simplify the discriminant first. The ± symbol means we find two values. Always check if the radicand is negative.",
  "Substitute the x and y values into both original equations. The solution is correct if both equations are satisfied.",
  "Subtracting Polynomials:",
  "Sum and Difference Formulas:",
  "Sum of Arithmetic Sequence:",
  "Sum of Geometric Sequence:",
  "Sum of terms in a sequence. Arithmetic series: a_1 + a_2 + ... + a_n. Geometric series: a_1 + a_1r + a_1r^2 + ... + a_1r^{n-1}. Infinite series: sum of infinitely many terms (may or may not converge).",
  "Summation Notation:",
  "Systems of Inequalities:",
  "Systems with Parameters:",
  "T(t) = T_s + (T_0 - T_s)e^{-kt} describes temperature decrease. T_s is surrounding temperature, T_0 is initial temperature, k is cooling rate. Temperature approaches T_s asymptotically.",
  "Tangent Function:",
  "Telescoping Series:",
  "Test H₀ (null hypothesis) vs Hₐ (alternative). Type I error: reject H₀ when true (α significance level). Type II error: fail to reject H₀ when false (β). p-value: probability of observing data as extreme given H₀ is true.",
  "Test Point Method:",
  "The Discriminant:",
  "The Elimination Method:",
  "The Factor Theorem:",
  "The Fundamental Theorem:",
  "The Number e:",
  "The Process:",
  "The Quadratic Formula:",
  "The Remainder Theorem:",
  "The Substitution Method:",
  "The domain is the set of all possible input values, while the range is the set of all possible output values. Restrictions occur when denominators are zero or when values are under even-root radicals.",
  "The maximum or minimum occurs at a corner point (vertex) of the feasible region. Find all vertices and test each in the objective function.",
  "The vertex is the turning point. The axis of symmetry is the vertical line x = -b/(2a) passing through the vertex. The parabola is symmetric about this line.",
  "These theorems avoid long division. Instead of dividing p(x) by (x-c), calculate p(c) directly. If p(c) = 0, we know (x-c) divides evenly.",
  "This method works best when one variable has a coefficient of 1 or -1, making it easy to isolate. If all coefficients are complex, elimination might be easier.",
  "Three-Variable Systems:",
  "Time required for quantity to reduce to half its value. After one half-life, 50% remains. After two half-lives, 25% remains (50% of 50%). n half-lives: (1/2)^n fraction remains.",
  "Transformations:",
  "Trigonometric Ratios:",
  "Trigonometric functions are periodic. Derivatives: d/dx(sin x) = cos x, d/dx(cos x) = -sin x. Integration of sin/cos appears throughout calculus. Exponential and trig connection via Euler's formula: e^{iθ} = cos θ + i sin θ.",
  "Trigonometric functions repeat every 2π radians. Signs vary by quadrant: Q1 all positive, Q2 sin positive, Q3 tan positive, Q4 cos positive.",
  "Two-Variable Data Analysis:",
  "Two-Way Tables (Contingency Tables):",
  "Types of Asymptotes:",
  "Types of Discontinuities:",
  "Types of Systems:",
  "Understanding Applications:",
  "Understanding the Sign:",
  "Unit Circle:",
  "Use FOIL for binomials or the distributive property for general cases. FOIL: First, Outer, Inner, Last. For longer polynomials, multiply each term in the first by every term in the second.",
  "Use exponential (inverse) form: if log_b(x) = k, then x = b^k. Properties of logarithms can condense or expand terms before converting to exponential form.",
  "Use inequality notation for intervals. Solution might be x",
  "Use x = -b/(2a) to find the x-coordinate of the vertex. Substitute into f(x) to find the y-coordinate. Vertex (h,k) is the extreme point of the parabola.",
  "Use z-test when σ known and n large. Use t-test when σ unknown (more common). t-distribution has fatter tails than normal, especially for small n.",
  "Using the Formula:",
  "Using the Theorem:",
  "Vector Basics:",
  "Vector Equations & Applications:",
  "Vector Operations:",
  "Vector has magnitude and direction: v = ⟨a, b⟩ = ai + bj. Magnitude |v| = √(a² + b²). Unit vector: u = v/|v|. Zero vector 0 = ⟨0, 0⟩. Position vector from origin to point (a, b).",
  "Vertex and Axis of Symmetry:",
  "Vertex:",
  "Vertical Asymptotes:",
  "Vertical Shifts:",
  "Vertical Stretches and Compressions:",
  "Vertical:",
  "What is Completing the Square?",
  "What is Linear Programming?",
  "What is Synthetic Division?",
  "What is a System?",
  "When 0",
  "When b > 1, f(x) = ab^x grows exponentially. The larger b, the faster the growth. Doubling time or tripling time describes how long for the function to double or triple in value.",
  "When clearing denominators, we might introduce solutions that make the original denominator zero. These are extraneous. Always verify: substitute back and check if any denominator becomes zero.",
  "When polynomial p(x) is divided by (x-c), the remainder equals p(c). This allows quick evaluation: instead of substituting into a complex polynomial, perform synthetic division and read the remainder.",
  "When to Use Substitution:",
  "Work and Rate Problems:",
  "Write coefficients of the dividend in descending order; include 0 for missing terms. The constant c (from x - c) goes as the divisor on the left. Use a special box/table format.",
  "Writing Solutions:",
  "Zeros and Factors:",
  "[r cis θ]ⁿ = rⁿ cis(nθ). Power simplification. Example: (1 + i)¹⁰. Finding nth roots: z^(1/n) = r^(1/n) cis((θ + 2πk)/n) for k = 0, 1, ..., n-1.",
  "\\hat{y} = b_0 + b_1 x. Slope b_1 = r × (s_y/s_x), y-intercept b_0 = \\bar{y} - b_1 \\bar{x}. Confidence intervals for slope: slope ± t* × SE(b_1). Hypothesis tests on correlation using t-statistic.",
  "a + ar + ar^2 + ar^3 + ... where |r|",
  "a or x > b (two rays), or a",
  "a). P(X > c) = 1 - P(X ≤ c).",
  "a/sin A = b/sin B = c/sin C. Use when you have ASA, AAS, or SSA (ambiguous). In triangle with angles A, B, C and opposite sides a, b, c respectively. Solves non-right triangles.",
  "all points satisfying all constraints.",
  "angle",
  "are relations that assign exactly one output to each input. A function f(x) can be evaluated by substituting a value for x and simplifying.",
  "at (0,c).",
  "a² - b² = (a+b)(a-b). Recognizable as two perfect squares with a minus sign between them. Can apply multiple times for higher powers.",
  "a·f(x) multiplies the y-values by a. If |a|>1, the parabola stretches (gets narrower). If 0",
  "b (one interval), or no solutions, or all real numbers. Express using interval notation or set notation.",
  "b) - P(X",
  "b) = P(X",
  "b^{x+y} = b^x · b^y, b^{xy} = (b^x)^y, b^{-x} = 1/b^x. These properties allow solving exponential equations algebraically when bases are equal.",
  "c) = 0.90. Use Z-table in reverse to find z, then solve X = μ + z·σ.",
  "combining different interest rates.",
  "combining items at different rates.",
  "cos θ = (u·v)/(|u||v|). Orthogonal (perpendicular) vectors: u·v = 0. Parallel vectors: one is scalar multiple of other. Component of u along v: (u·v)/|v|.",
  "c² = a² + b² - 2ab cos C. Use for SAS or SSS. Relates all three sides to an angle. Special case: when C = 90°, reduces to Pythagorean theorem.",
  "dB = 10 log(I/I_0) for intensity. Logarithmic scale compresses wide ranges. Small dB changes represent large intensity changes.",
  "degree of denominator: y = 0. If equal: y = ratio of leading coefficients. If numerator degree > denominator degree: no horizontal asymptote.",
  "determined by degree comparison.",
  "divides parabola in half.",
  "dy/dx = (dy/dt)/(dx/dt). Not dy/dx obtained by implicit differentiation. Acceleration vector: a(t) = (d²x/dt², d²y/dt²). Velocity vector: v(t) = (dx/dt, dy/dt), speed |v(t)| = √((dx/dt)² + (dy/dt)²).",
  "e ≈ 2.71828... defined as lim_{n→∞} (1+1/n)^n. The natural base appears in continuous growth and compound interest. Also appears as the base of natural logarithm.",
  "e^(iθ) = cos θ + i sin θ. Complex exponential connects trig functions. Applications in physics: wave equations, oscillations, quantum mechanics. Solving z^n = 1 gives nth roots of unity equally spaced on unit circle.",
  "exactly one solution.",
  "f(x) + k shifts the parabola k units up (k>0) or down (k",
  "f(x) = log_b(x). These are inverse functions of f(x) = b^x. Domain: x > 0. Range: all real numbers. Graph has vertical asymptote at x = 0.",
  "f(x) represents the output of function f when the input is x. This replaces the older y = notation and makes it clear which variable is the input.",
  "f(x-h) shifts the parabola h units right (h>0) or left (h",
  "flip the inequality sign",
  "hole from cancelled factors.",
  "infinitely many solutions.",
  "limitations on variables (system of inequalities).",
  "ln(x) = log_e(x). Its inverse is y = e^x. Properties identical to all logarithms with base e. ln(e) = 1, ln(1) = 0, e^{ln(x)} = x, ln(e^x) = x.",
  "log_b(bx) = 1, log_b(1) = 0, log_b(b) = 1. Inverse relationship: b^{log_b(x)} = x and log_b(b^x) = x. Domain: x > 0 only.",
  "log_b(x) = log(x)/log(b) = ln(x)/ln(b). Allows computing any logarithm using calculator (which typically has log base 10 and natural log).",
  "log_b(xy) = log_b(x) + log_b(y) (product rule). log_b(x/y) = log_b(x) - log_b(y) (quotient rule). log_b(x^n) = n·log_b(x) (power rule).",
  "minimum (a>0) or maximum (a",
  "no solution.",
  "pH = -log[H⁺] in chemistry. Logarithmic scale where pH 7 is neutral. pH",
  "pH and pKa:",
  "piecewise functions with different limits from left and right.",
  "sin 2x = 2 sin x cos x. cos 2x = cos² x - sin² x = 2 cos² x - 1 = 1 - 2 sin² x. tan 2x = 2 tan x / (1 - tan² x).",
  "sin x = a, cos x = a, tan x = a for |a| ≤ 1 (sine/cosine). Find reference angle, then use quadrant information to find all solutions. General solutions include ± 2πn or ± πn depending on function.",
  "sin θ = y, cos θ = x, tan θ = y/x (on unit circle). Also cot θ = x/y, sec θ = 1/x, csc θ = 1/y. SOHCAHTOA helps remember right triangle ratios.",
  "sin(A ± B) = sin A cos B ± cos A sin B. cos(A ± B) = cos A cos B ∓ sin A sin B. tan(A ± B) = (tan A ± tan B) / (1 ∓ tan A tan B).",
  "sin² x + cos² x = 1 (Pythagorean). tan x = sin x / cos x. cot x = cos x / sin x. sec x = 1 / cos x. csc x = 1 / sin x.",
  "sin² x = (1 - cos 2x)/2. cos² x = (1 + cos 2x)/2. Used to simplify expressions and solve equations.",
  "t-test vs z-test:",
  "using distance = rate × time.",
  "vertical asymptote.",
  "what we're maximizing/minimizing (P = ax + by).",
  "when numerator degree = denominator degree + 1. Find by polynomial long division.",
  "where denominator = 0.",
  "where parabola crosses x-axis (roots).",
  "x = [-b ± √(b²-4ac)] / (2a). This solves any quadratic equation ax² + bx + c = 0 directly without factoring or completing the square.",
  "x-intercepts:",
  "y - y₁ = m(x - x₁) is useful when you know a point on the line and the slope. This form can be rearranged to slope-intercept form.",
  "y = A sin(B(x - C)) + D. A is amplitude (vertical stretch). B affects period (new period = 2π/B). C is horizontal shift. D is vertical shift. Tangent has period π, not 2π.",
  "y = a(x-h)² + k applies all transformations. The order matters: horizontal/vertical shifts, then stretches/compressions. Reading transformations from vertex form is straightforward.",
  "y = arcsin x, arccos x, arctan x give principal values in restricted ranges. sin⁻¹(x) ∈ [-π/2, π/2], cos⁻¹(x) ∈ [0, π], tan⁻¹(x) ∈ (-π/2, π/2).",
  "y = cos(x) has amplitude 1, period 2π. Key points: (0, 1), (π/2, 0), (π, -1), (3π/2, 0), (2π, 1). Shifts sine left by π/2: cos(x) = sin(x + π/2).",
  "y = log_b(x - h) + k shifts the graph. h shifts right (h > 0) or left. k shifts up (k > 0) or down. Vertical asymptote shifts to x = h. The reflection over the line y = x gives y = b^x.",
  "y = log_b(x) means b^y = x. Logarithm is the inverse of exponential. Base b > 0, b ≠ 1. Common base: log_10(x) = log(x). Natural base: log_e(x) = ln(x).",
  "y = mx + b, where m is the slope and b is the y-intercept. Slope represents the rate of change: m = (y₂ - y₁)/(x₂ - x₁).",
  "y = sin(x) has amplitude 1, period 2π. Oscillates between -1 and 1. Passes through origin (0, 0). Key points: (π/2, 1), (π, 0), (3π/2, -1), (2π, 0).",
  "y = tan(x) = sin(x)/cos(x). Undefined at x = π/2, 3π/2, ... (where cos = 0). Vertical asymptotes at these points. Period = π.",
  "y-intercept by setting x=0. x-intercepts (zeros) by factoring or using the quadratic formula. Axis of symmetry is x = h. Use symmetry to find additional points on the parabola.",
  "y-intercept:",
  "z = a + bi = r(cos θ + i sin θ) = r cis θ where r = |z| = √(a² + b²) and θ = arg(z). Conversion: a = r cos θ, b = r sin θ. θ is angle from positive real axis, measured counterclockwise.",
  "|a|",
  "Δ = b² - 4ac. This value determines the nature and number of solutions. If Δ > 0: two distinct real solutions. If Δ = 0: one repeated real solution. If Δ",
  "Σ symbol denotes sum. Σ_{i=1}^{n} a_i means a_1 + a_2 + ... + a_n. Index i is the summation variable. Lower limit (below Σ) and upper limit (above Σ) define the range. Rules: Σ c·a_i = cΣ a_i, Σ(a_i + b_i) = Σ a_i + Σ b_i.",
  "Σ_{i=1}^{n} 1 = n, Σ_{i=1}^{n} i = n(n+1)/2, Σ_{i=1}^{n} i^2 = n(n+1)(2n+1)/6, Σ_{i=1}^{n} i^3 = [n(n+1)/2]^2. These formulas allow closed forms for many series.",
  "α, reject H₀ (statistically significant). If p-value ≥ α, fail to reject H₀ (insufficient evidence). Common α: 0.05 or 0.01."
]