{
  "(n−2)×180°": "(n−2)×180°",
  "180°": "180°",
  "360°": "360°",
  "540°": "540°",
  "720°": "720°",
  "Altitudes": "高线",
  "Angle Sum": "角度和",
  "Angle bisectors": "角平分线",
  "Compound Statements": "复合语句",
  "Congruent Triangles": "全等三角形",
  "Finding an Angle": "求角度",
  "For any Triangle:": "对于任何三角形：",
  "Formed By": "由…构成",
  "Heptagon: 7 sides": "七边形：7条边",
  "Hexagon: 6 sides": "六边形：6条边",
  "Hypotenuse = a√2": "斜边 = a√2",
  "Kite": "筝形",
  "Line": "线",
  "Medians": "中线",
  "Midsegment Theorem": "中位线定理",
  "Octagon: 8 sides": "八边形：8条边",
  "Paragraph Proof": "段落证明",
  "Pentagon: 5 sides": "五边形：5条边",
  "Polar Coordinates": "极坐标",
  "Polygons": "多边形",
  "Postulates (Axioms)": "公设（公理）",
  "Property": "性质",
  "Proportional Parts": "成比例部分",
  "Reflexive: AB ≅ AB": "自反性：AB ≅ AB",
  "Reflexive: ∠A ≅ ∠A": "自反性：∠A ≅ ∠A",
  "Self-Similarity": "自相似性",
  "Sides": "边",
  "Theorems": "定理",
  "Triangle: 3 sides": "三角形：3条边",
  "Vector Operations": "向量运算",
  "What Is a Vector?": "什么是向量？",
  "When to Use Which": "何时使用哪种方法",
  "n-gon": "n边形",
  "A Line is a straight path that extends infinitely in both directions. It has no thickness and contains infinitely many points. A Line is named by any two points on it (e.g., Line AB, written ←→ AB) or by a lowercase letter.": "线是一条向两个方向无限延伸的直路径。它没有粗细，包含无穷多个点。线用其上的任意两点命名（例如，线AB，写作 ←→ AB）或用小写字母命名。",
  "A Plane is a flat surface that extends infinitely in all directions. It has length and width but no thickness. A Plane is named by three Non-Collinear points (e.g., Plane ABC) or by a capital letter.": "平面是一个向所有方向无限延伸的平坦表面。它有长度和宽度，但没有厚度。平面用三个不共线的点命名（例如，平面ABC）或用大写字母命名。",
  "A Line segment is a part of a Line bounded by two endpoints. Unlike a Line, a segment has a definite length. The length of segment AB is written as AB (without the bar above).": "线段是由两个端点界定的线的一部分。与线不同，线段有确定的长度。线段AB的长度写作AB（上方不加横线）。",
  "Point B is between points A and C if A, B, and C are collinear and AB + BC = AC. This is called the Segment Addition Postulate.": "如果A、B和C共线，且AB + BC = AC，则点B在点A和点C之间。这被称为线段加法公设。",
  "This formula comes from the Pythagorean Theorem.": "这个公式来源于勾股定理。",
  "A segment bisector is any segment, Line, or ray that passes through the midpoint of a segment, dividing it into two congruent halves.": "线段的平分线是通过线段中点的任何线段、直线或射线，将其分成两个全等的部分。",
  "An Angle is formed by two rays with a common endpoint called the vertex. The rays are called the sides of the Angle. Angles are measured in degrees (°).": "角由两条有一个公共端点（称为顶点）的射线形成。这些射线被称为角的边。角用度（°）来度量。",
  "Acute Angle: An Angle measuring between 0° and 90°.": "鋐角：度数在0°到90°之间的角。",
  "Right Angle: An Angle measuring exactly 90°.": "直角：度数恰好为90°的角。",
  "Obtuse Angle: An Angle measuring between 90° and 180°.": "钝角：度数在90°到180°之间的角。",
  "Straight Angle: An Angle measuring exactly 180°.": "平角：度数恰好为180°的角。",
  "Congruent angles have the same measure. The symbol ≅ means 'is congruent to.'": "全等角有相同的度数。符号 ≅ 表示“全等于”。",
  "An Angle bisector is a ray that divides an Angle into two congruent angles.": "角平分线是将一个角分成两个全等角的射线。",
  "If Point D is in the interior of ∠ABC, then m∠ABD + m∠DBC = m∠ABC.": "如果点D在∠ABC的内部，则 m∠ABD + m∠DBC = m∠ABC。",
  "Two adjacent angles whose non-common sides form a straight Line (they add up to 180°).": "两个非公共边构成一条直线的相邻角（它们的和为180°）。",
  "Two non-adjacent angles formed by two intersecting Lines. Vertical angles are always congruent.": "由两条相交直线形成的两个不相邻的角。对顶角总是全等的。",
  "Complementary Angles: Two angles whose measures add up to 90°.": "互余角：度数之和为90°的两个角。",
  "Supplementary Angles: Two angles whose measures add up to 180°.": "互补角：度数之和为180°的两个角。",
  "A polygon is a closed plane figure formed by three or more Line segments that intersect only at their endpoints.": "多边形是由三条或更多仅在端点处相交的线段构成的封闭平面图形。",
  "Concave polygon: At least one interior Angle is greater than 180°.": "凹多边形：至少有一个内角大于180°。",
  "Convex polygon: All interior angles are less than 180°.": "凸多边形：所有内角都小于180°。",
  "Regular polygon: All sides and all angles are congruent.": "正多边形：所有边和所有角都全等。",
  "Perimeter: The sum of the lengths of all sides of a polygon.": "周长：多边形所有边长之和。",
  "Area: The number of square units enclosed by a figure.": "面积：图形所围的方形面积单位数。",
  "A polyhedron is a 3D solid bounded by flat polygonal surfaces.": "多面体是由平坦的多边形面围成的三维立体。",
  "A prism has two congruent, parallel polygon bases connected by rectangular faces.": "棱柱有两个全等的平行多边形底面，由矩形面连接。",
  "A cylinder has two congruent circular bases connected by a curved surface.": "圆柱有两个全等的圆形底面，由一个曲面连接。",
  "A pyramid has one polygon base and triangular faces meeting at a common vertex (apex).": "棱锥有一个多边形底面和在一个公共顶点（顶端）相交的三角形面。",
  "A cone has one circular base and a curved surface tapering to a point (apex).": "圆锥有一个圆形底面和一个锥形收缩到一个点（顶端）的曲面。",
  "A sphere is the set of all points in space that are equidistant from a central point.": "球是空间中与一个中心点等距的所有点的集合。",
  "Inductive reasoning uses patterns and observations to form a general conclusion called a conjecture. You look at specific cases and make an educated guess about what is always true.": "归纳推理利用模式和观察来形成一个称为猜想的一般结论。你观察特定的情况，对什么总是成立的做出有根据的推测。",
  "Example: 2, 4, 6, 8, ... → Conjecture: the next number is 10.": "例：2, 4, 6, 8, ... → 猜想：下一个数是10。",
  "Inductive reasoning does NOT prove something is true — it only suggests it might be.": "归纳推理并不能证明某事为真——它只是暗示它可能为真。",
  "A conjecture is an unproven statement based on observations. A conjecture remains unproven until it is shown to be either true (via a proof) or false (via a counterexample).": "猜想是基于观察的未经证明的陈述。猜想在被证明为真（通过证明）或为假（通过反例）之前一直是未经证明的。",
  "A counterexample is a single example that disproves a conjecture. You only need ONE counterexample to prove a conjecture is false.": "反例是一个推翻猜想的单一例子。你只需要一个反例就能证明猜想是假的。",
  "Deductive reasoning uses facts, definitions, postulates, and theorems to reach a logical conclusion. Unlike inductive reasoning, deductive reasoning can actually prove that something is true.": "演绎推理使用事实、定义、公设和定理来达到逻辑结论。与归纳推理不同，演绎推理实际上可以证明某事为真。",
  "Law of Detachment: If p → q is true, and p is true, then q must be true.": "分离律：如果 p → q 为真，且 p 为真，则 q 必为真。",
  "Law of Syllogism: If p → q and q → r, then p → r.": "三段论法则：如果 p → q 且 q → r，则 p → r。",
  "A conditional statement (or if-then statement) has two parts: the hypothesis (\"if\") and the conclusion (\"then\"). It is written in the form: If p, then q (p → q).": "条件语句（或假言命题）有两部分：假设（“如果”）和结论（“那么”）。它的形式为：如果 p，则 q（p → q）。",
  "Converse: q → p (Swap hypothesis and conclusion)": "逆命题：q → p（交换假设和结论）",
  "Inverse: ~p → ~q (Negate both parts)": "否命题：~p → ~q（否定两部分）",
  "Contrapositive: ~q → ~p (Swap AND negate both parts — always has the same truth value as the original)": "逆否命题：~q → ~p（交换并否定两部分——与原命题始终具有相同的真值）",
  "A biconditional statement combines a conditional and its converse. Written as p ↔ q (read \"p if and only if q\"), it is true only when both p → q and q → p are true.": "双条件语句结合了一个条件和它的逆。写作 p ↔ q（读作“p 当且仅当 q”），只有当 p → q 和 q → p 都为真时，它才为真。",
  "Negation: \"not p\" → changes the truth value. Written as ~p.": "否定：“非 p”→ 改变真值。写作 ~p。",
  "Conjunction (AND): p ∧ q → true only when both p and q are true.": "合取（且）：p ∧ q → 仅当 p 和 q 都为真时为真。",
  "Disjunction (OR): p ∨ q → true when at least one of p or q is true.": "析取（或）：p ∨ q → 当 p 或 q 中至少一个为真时为真。",
  "A postulate (axiom) is a statement accepted as true without proof. It is a foundational truth in geometry.": "公设（公理）是不需要证明就被接受为真的陈述。它是几何学中的基础真理。",
  "Through any two points, there is exactly one Line.": "过任意两点，恰好有一条直线。",
  "Through any three Non-Collinear points, there is exactly one Plane.": "过任意三个不共线的点，恰好有一个平面。",
  "If two points lie in a Plane, then the entire Line containing those points lies in that Plane.": "如果两个点在一个平面上，则包含这两个点的整条直线都在该平面上。",
  "If two planes intersect, then their intersection is a Line.": "如果两个平面相交，则它们的交线是一条直线。",
  "A theorem is a statement that has been proven to be true using definitions, postulates, and previously proven theorems.": "定理是使用定义、公设和之前证明的定理证明为真的陈述。",
  "Midpoint Theorem: If M is the midpoint of AB, then AM ≅ MB.": "中点定理：如果M是AB的中点，则 AM ≅ MB。",
  "When the conclusion involves uniqueness (\"there is exactly one...\").": "当结论涉及唯一性（“恰好有一个……”）时。",
  "A two-column proof lists statements in the left column and the corresponding reasons in the right column.": "两栏证明在左栏列出陈述，在右栏列出相应的理由。",
  "A paragraph proof writes the proof as a logical paragraph, connecting statements with reasons in flowing sentences.": "段落证明将证明写成一个逻辑段落，用流畅的句子将陈述与理由连接起来。",
  "A flowchart proof uses boxes connected by arrows. Each box contains a statement, and the reason is written below it.": "流程图证明使用由箭头连接的方框。每个方框包含一个陈述，理由写在其下方。",
  "Addition Property: If a = b, then a + c = b + c.": "加法性质：如果 a = b，则 a + c = b + c。",
  "Subtraction Property: If a = b, then a − c = b − c.": "减法性质：如果 a = b，则 a − c = b − c。",
  "Multiplication Property: If a = b, then a × c = b × c.": "乘法性质：如果 a = b，则 a × c = b × c。",
  "Division Property: If a = b and c ≠ 0, then a ÷ c = b ÷ c.": "除法性质：如果 a = b 且 c ≠ 0，则 a ÷ c = b ÷ c。",
  "Reflexive Property: a = a.": "自反性：a = a。",
  "Symmetric Property: If a = b, then b = a.": "对称性：如果 a = b，则 b = a。",
  "Transitive Property: If a = b and b = c, then a = c.": "传递性：如果 a = b 且 b = c，则 a = c。",
  "Substitution Property: If a = b, then a can replace b in any expression.": "代入性质：如果 a = b，则 a 可以在任何表达式中替换 b。",
  "Distributive Property: a(b + c) = ab + ac.": "分配律：a(b + c) = ab + ac。",
  "Symmetric: If AB ≅ CD, then CD ≅ AB": "对称性：如果 AB ≅ CD，则 CD ≅ AB",
  "Transitive: If AB ≅ CD and CD ≅ EF, then AB ≅ EF": "传递性：如果 AB ≅ CD 且 CD ≅ EF，则 AB ≅ EF",
  "Symmetric: If ∠A ≅ ∠B, then ∠B ≅ ∠A": "对称性：如果 ∠A ≅ ∠B，则 ∠B ≅ ∠A",
  "Transitive: If ∠A ≅ ∠B and ∠B ≅ ∠C, then ∠A ≅ ∠C": "传递性：如果 ∠A ≅ ∠B 且 ∠B ≅ ∠C，则 ∠A ≅ ∠C",
  "A transversal is a Line that intersects two or more coplanar Lines at different points. When a transversal crosses two lines, it creates 8 angles.": "截线是在不同点处与两条或更多共面直线相交的直线。当截线穿过两条直线时，它形成8个角。",
  "Corresponding Angles: Same position relative to the transversal (e.g., both upper-left). If the Lines are parallel, they are congruent.": "同位角：相对于截线处于相同位置（例如，都在左上方）。如果两条直线平行，则它们全等。",
  "Alternate Interior Angles: On opposite sides of the transversal, between the Lines. If the Lines are parallel, they are congruent.": "内错角：在截线的两侧，在两条直线之间。如果两条直线平行，则它们全等。",
  "Alternate Exterior Angles: On opposite sides of the transversal, outside the Lines. If the Lines are parallel, they are congruent.": "外错角：在截线的两侧，在两条直线的外侧。如果两条直线平行，则它们全等。",
  "Co-Interior (Same-Side Interior) Angles: Same side of the transversal, between the Lines. If the Lines are parallel, they are supplementary (add to 180°).": "同侧内角：在截线的同一侧，在两条直线之间。如果两条直线平行，则它们互补（和为180°）。",
  "If two parallel Lines are cut by a transversal, then corresponding angles are congruent.": "如果两条平行线被一条截线所截，则同位角全等。",
  "If two parallel Lines are cut by a transversal, then alternate interior angles are congruent.": "如果两条平行线被一条截线所截，则内错角全等。",
  "If two parallel Lines are cut by a transversal, then same-side interior angles are supplementary.": "如果两条平行线被一条截线所截，则同侧内角互补。",
  "If corresponding angles are congruent, then the Lines are parallel.": "如果同位角全等，则两条直线平行。",
  "If alternate interior angles are congruent, then the Lines are parallel.": "如果内错角全等，则两条直线平行。",
  "If same-side interior angles are supplementary, then the Lines are parallel.": "如果同侧内角互补，则两条直线平行。",
  "The slope of a Line measures its steepness and direction: m = (y₂ − y₁) / (x₂ − x₁).": "直线的斜率度量其倾斜程度和方向：m = (y₂ − y₁) / (x₂ − x₁)。",
  "Parallel Lines → same slope (m₁ = m₂).": "平行线 → 相同斜率（m₁ = m₂）。",
  "Perpendicular Lines → slopes are negative reciprocals (m₁ × m₂ = −1).": "垂直线 → 斜率互为负倒数（m₁ × m₂ = −1）。",
  "Slope-Intercept Form: y = mx + b": "斜截式：y = mx + b",
  "Point-Slope Form: y − y₁ = m(x − x₁)": "点斜式：y − y₁ = m(x − x₁)",
  "The distance from a point to a Line is the length of the perpendicular segment from the point to the Line. This is the shortest distance.": "点到直线的距离是从该点到直线的垂直线段的长度。这是最短距离。",
  "If two Lines are parallel, then all points on one Line are equidistant from the other Line.": "如果两条直线平行，则一条直线上的所有点到另一条直线的距离相等。",
  "Two lines that are equidistant from a third line are parallel to each other.": "与第三条直线等距的两条直线互相平行。",
  "Scalene Triangle: No sides are congruent.": "不等边三角形：没有全等的边。",
  "Isosceles Triangle: At least two sides are congruent.": "等腰三角形：至少两条边全等。",
  "Equilateral Triangle: All three sides are congruent.": "等边三角形：所有三条边全等。",
  "Acute Triangle: All angles are less than 90°.": "鋐角三角形：所有角都小于90°。",
  "Right Triangle: One Angle is exactly 90°.": "直角三角形：有一个角恰好为90°。",
  "Obtuse Triangle: One Angle is greater than 90°.": "钝角三角形：有一个角大于90°。",
  "Equiangular Triangle: All angles are congruent (each = 60°).": "等角三角形：所有角都全等（每个 = 60°）。",
  "Every Equilateral Triangle is also equiangular (and vice versa).": "每个等边三角形也是等角三角形（反之亦然）。",
  "An Isosceles Triangle has a vertex Angle (between the congruent sides) and two base angles (which are congruent).": "等腰三角形有一个顶角（在全等边之间）和两个底角（全等）。",
  "The sum of the measures of the interior angles of a Triangle is 180°.": "三角形内角之和为180°。",
  "An exterior Angle of a Triangle is equal to the sum of the two non-adjacent interior angles.": "三角形的外角等于两个不相邻内角之和。",
  "SSS (Side-Side-Side): All three sides of one Triangle are congruent to three sides of another.": "SSS（边边边）：一个三角形的三条边分别与另一个三角形的三条边全等。",
  "SAS (Side-Angle-Side): Two sides and the included Angle of one Triangle are congruent to two sides and the included Angle of another.": "SAS（边角边）：一个三角形的两条边和夹角分别与另一个三角形的两条边和夹角全等。",
  "ASA (Angle-Side-Angle): Two angles and the included side of one Triangle are congruent to two angles and the included side of another.": "ASA（角边角）：一个三角形的两个角和夹边分别与另一个三角形的两个角和夹边全等。",
  "AAS (Angle-Angle-Side): Two angles and a non-included side of one Triangle are congruent to two angles and a non-included side of another.": "AAS（角角边）：一个三角形的两个角和一条非夹边分别与另一个三角形的两个角和一条非夹边全等。",
  "HL (Hypotenuse-Leg): In right triangles, the hypotenuse and one leg of one Triangle are congruent to those of another.": "HL（斜边-直角边）：在直角三角形中，一个三角形的斜边和一条直角边分别与另一个三角形的全等。",
  "CPCTC: Corresponding Parts of Congruent Triangles are Congruent — used after proving two triangles congruent.": "CPCTC：全等三角形的对应部分全等——在证明两个三角形全等之后使用。",
  "Isosceles Triangle Theorem: If two sides of a Triangle are congruent, then the angles opposite those sides are congruent (base angles are equal).": "等腰三角形定理：如果三角形的两条边全等，则这两条边的对角全等（底角相等）。",
  "Converse: If two angles of a Triangle are congruent, then the sides opposite those angles are congruent.": "逆定理：如果三角形的两个角全等，则这两个角的对边全等。",
  "A coordinate proof uses the coordinate Plane to prove geometric properties using algebra. You place figures on a coordinate system and use distance, midpoint, and slope formulas.": "坐标证明利用坐标平面通过代数来证明几何性质。你将图形放在坐标系中，使用距离、中点和斜率公式。",
  "Place one vertex at the origin and one side along an axis to simplify calculations.": "将一个顶点放在原点，一条边沿坐标轴，以简化计算。",
  "Bisectors of Triangles": "三角形的平分线",
  "The three perpendicular bisectors of a Triangle are concurrent (meet at one Point). This Point is called the circumcenter.": "三角形的三条垂直平分线共点（交于一点）。这个点称为外心。",
  "In an acute Triangle, the circumcenter is inside the Triangle.": "在鋐角三角形中，外心在三角形内部。",
  "In a right Triangle, the circumcenter is on the hypotenuse.": "在直角三角形中，外心在斜边上。",
  "In an obtuse Triangle, the circumcenter is outside the Triangle.": "在钝角三角形中，外心在三角形外部。",
  "The three Angle bisectors of a Triangle are concurrent. This Point is called the incenter.": "三角形的三条角平分线共点。这个点称为内心。",
  "The incenter is always inside the Triangle.": "内心始终在三角形内部。",
  "The incenter is equidistant from all three sides of the Triangle.": "内心到三角形三条边的距离相等。",
  "A median of a Triangle is a segment from a vertex to the midpoint of the opposite side.": "三角形的中线是从顶点到对边中点的线段。",
  "The three medians of a Triangle are concurrent at the centroid.": "三角形的三条中线共点于重心。",
  "The centroid is always inside the Triangle.": "重心始终在三角形内部。",
  "The centroid divides each median in a 2:1 ratio from vertex to midpoint.": "重心将每条中线从顶点到中点抉2:1的比例分割。",
  "An altitude of a Triangle is the perpendicular segment from a vertex to the Line containing the opposite side.": "三角形的高是从顶点到包含对边的直线的垂直线段。",
  "The three altitudes of a Triangle are concurrent at the orthocenter.": "三角形的三条高共点于垂心。",
  "In an acute Triangle, the orthocenter is inside the Triangle.": "在鋐角三角形中，垂心在三角形内部。",
  "In a right Triangle, the orthocenter is at the vertex of the right Angle.": "在直角三角形中，垂心在直角的顶点处。",
  "In an obtuse Triangle, the orthocenter is outside the Triangle.": "在钝角三角形中，垂心在三角形外部。",
  "A midsegment of a Triangle is a segment connecting the midpoints of two sides.": "三角形的中位线是连接两条边中点的线段。",
  "The midsegment is parallel to the third side and half its length.": "中位线平行于第三条边，且等于其长度的一半。",
  "If one side of a Triangle is longer than another, the Angle opposite the longer side is larger.": "如果三角形的一条边比另一条边长，则较长边的对角较大。",
  "If one Angle of a Triangle is larger than another, the side opposite the larger Angle is longer.": "如果三角形的一个角比另一个角大，则较大角的对边较长。",
  "The sum of the lengths of any two sides of a Triangle must be greater than the length of the third side.": "三角形任意两条边的长度之和必须大于第三条边的长度。",
  "In an indirect proof (proof by contradiction), you assume the opposite of what you want to prove, then show that assumption leads to a contradiction.": "在间接证明（反证法）中，你假设与你要证明的相反，然后证明该假设导致矛盾。",
  "The Hinge Theorem (SAS Inequality): If two sides of one Triangle are congruent to two sides of another, then the Triangle with the larger included Angle has the longer third side.": "铰链定理（SAS不等式）：如果一个三角形的两条边分别与另一个三角形的两条边全等，则夹角较大的三角形的第三条边较长。",
  "The sum of the interior angles of a polygon with n sides is (n − 2) × 180°.": "n边多边形的内角和为 (n − 2) × 180°。",
  "Each interior Angle of a regular n-gon = (n − 2) × 180° / n.": "正n边形的每个内角 = (n − 2) × 180° / n。",
  "The sum of the exterior angles of any convex polygon is always 360°.": "任何凸多边形的外角和始终为360°。",
  "Each exterior Angle of a regular n-gon = 360° / n.": "正n边形的每个外角 = 360° / n。",
  "Quadrilateral: 4 sides": "四边形：4条边",
  "A parallelogram is a quadrilateral with two pairs of parallel sides.": "平行四边形是有两对平行边的四边形。",
  "Opposite sides are congruent.": "对边全等。",
  "Opposite angles are congruent.": "对角全等。",
  "Consecutive angles are supplementary (add to 180°).": "相邻角互补（和为180°）。",
  "Diagonals bisect each other.": "对角线互相平分。",
  "A rectangle is a parallelogram with four right angles.": "矩形是有四个直角的平行四边形。",
  "A rectangle's diagonals are congruent.": "矩形的对角线全等。",
  "A rhombus is a parallelogram with four congruent sides.": "菱形是有四条全等边的平行四边形。",
  "A rhombus's diagonals are perpendicular.": "菱形的对角线互相垂直。",
  "Each diagonal of a rhombus bisects a pair of opposite angles.": "菱形的每条对角线平分一对对角。",
  "A square is a parallelogram that is both a rectangle and a rhombus: it has four right angles and four congruent sides.": "正方形是既是矩形又是菱形的平行四边形：它有四个直角和四条全等边。",
  "A trapezoid is a quadrilateral with exactly one pair of parallel sides (called bases). The non-parallel sides are called legs.": "梯形是恰好有一对平行边（称为底边）的四边形。不平行的边称为腰。",
  "An isosceles trapezoid has congruent legs, congruent base angles, and congruent diagonals.": "等腰梯形有全等的腰、全等的底角和全等的对角线。",
  "The midsegment (median) of a trapezoid is parallel to the bases and its length is the average of the two bases.": "梯形的中位线平行于底边，其长度是两条底边的平均值。",
  "A kite is a quadrilateral with two pairs of consecutive sides that are congruent (but opposite sides are not congruent).": "筝形是有两对邻边全等（但对边不全等）的四边形。",
  "The diagonals of a kite are perpendicular.": "筝形的对角线互相垂直。",
  "Exactly one pair of opposite angles are congruent (the angles between the non-congruent sides).": "恰好有一对对角全等（不全等边之间的角）。",
  "A ratio compares two quantities. It can be written as a:b, a/b, or \"a to b\".": "比率比较两个量。它可以写作 a:b、a/b 或“a比b”。",
  "A proportion is an equation that states two ratios are equal: a/b = c/d.": "比例是一个声明两个比率相等的方程：a/b = c/d。",
  "Cross-multiplication: If a/b = c/d, then ad = bc.": "交叉相乘：如果 a/b = c/d，则 ad = bc。",
  "The geometric mean of two positive numbers a and b is x = √(ab). It is the positive number x such that a/x = x/b.": "两个正数a和b的几何平均数是 x = √(ab)。它是使得 a/x = x/b 的正数x。",
  "AA (Angle-Angle) Similarity: If two angles of one Triangle are congruent to two angles of another, the triangles are similar.": "AA（角角）相似：如果一个三角形的两个角分别与另一个三角形的两个角全等，则两个三角形相似。",
  "SSS (Side-Side-Side) Similarity: If corresponding sides of two triangles are proportional, the triangles are similar.": "SSS（边边边）相似：如果两个三角形的对应边成比例，则两个三角形相似。",
  "SAS (Side-Angle-Side) Similarity: If two sides are proportional and the included Angle is congruent, the triangles are similar.": "SAS（边角边）相似：如果两条边成比例且夹角全等，则两个三角形相似。",
  "If a Line is parallel to one side of a Triangle and intersects the other two sides, it divides those sides proportionally (Triangle Proportionality Theorem).": "如果一条直线平行于三角形的一条边并与其他两条边相交，则它按比例分割那些边（三角形比例定理）。",
  "If three or more parallel Lines are cut by two transversals, the transversals are divided proportionally.": "如果三条或更多平行线被两条截线所截，则截线被按比例分割。",
  "If a ray bisects an Angle of a Triangle, it divides the opposite side into segments proportional to the adjacent sides.": "如果一条射线平分三角形的一个角，它将对边分成与邻边成比例的线段。",
  "A dilation is a transformation that changes size but not shape. It has a center point and a scale factor k.": "位似变换是改变大小但不改变形状的变换。它有一个中心点和一个比例因子k。",
  "If k > 1: enlargement. If 0 < k < 1: reduction.": "如果 k > 1：放大。如果 0 < k < 1：缩小。",
  "Dilations preserve angle measures and produce similar figures.": "位似变换保持角度不变，并产生相似图形。",
  "The ratio of areas of two similar figures = k² (square of the scale factor).": "两个相似图形的面积比 = k²（比例因子的平方）。",
  "The ratio of perimeters of two similar figures = k (the scale factor).": "两个相似图形的周长比 = k（比例因子）。",
  "Iteration: Repeatedly applying a process to its own result.": "迭代：对自身结果反复应用一个过程。",
  "A fractal is a geometric figure that has self-similarity — each part looks like the whole.": "分形是一种具有自相似性的几何图形——每个部分看起来都像整体。",
  "The Sierpinski Triangle and Koch Snowflake are classic examples of fractals.": "谢尔宾斯基三角形和科赫雪花是分形的经典例子。",
  "Geometric Mean in Right Triangles": "直角三角形中的几何平均数",
  "When the altitude is drawn from the right Angle to the hypotenuse of a right Triangle, it creates two smaller triangles that are similar to each other and to the original Triangle.": "当从直角向直角三角形的斜边画高时，它创建两个较小的三角形，它们彼此相似且与原三角形相似。",
  "In right △ABC with altitude CD to hypotenuse AB (where D is the foot):": "在直角△ABC中，CD是到斜边AB的高（D是垂足）：",
  "Altitude rule: CD = √(AD × DB) — the altitude is the geometric mean of the two segments of the hypotenuse.": "高的法则：CD = √(AD × DB)——高是斜边两段的几何平均数。",
  "Leg rule: AC = √(AB × AD) — each leg is the geometric mean of the hypotenuse and the adjacent segment.": "直角边法则：AC = √(AB × AD)——每条直角边是斜边和邻段的几何平均数。",
  "In a right Triangle, the square of the hypotenuse equals the sum of the squares of the two legs: a² + b² = c².": "在直角三角形中，斜边的平方等于两条直角边的平方和：a² + b² = c²。",
  "If a² + b² = c², then the Triangle is a right Triangle.": "如果 a² + b² = c²，则该三角形是直角三角形。",
  "If c² < a² + b², the Triangle is acute. If c² > a² + b², the Triangle is obtuse.": "如果 c² < a² + b²，三角形是鋐角三角形。如果 c² > a² + b²，三角形是钝角三角形。",
  "A Pythagorean triple is a set of three positive integers (a, b, c) such that a² + b² = c². Example: (3, 4, 5).": "勾股数组是一组满足 a² + b² = c² 的三个正整数。例：(3, 4, 5)。",
  "Multiples of Pythagorean triples are also Pythagorean triples (e.g., (6, 8, 10)).": "勾股数组的倍数也是勾股数组（例如，(6, 8, 10)）。",
  "In a 45°-45°-90° Triangle: Legs are congruent. Hypotenuse = leg × √2.": "在45°-45°-90°三角形中：两条直角边全等。斜边 = 直角边 × √2。",
  "In a 30°-60°-90° Triangle: Short leg (opposite 30°), Long leg = short leg × √3, Hypotenuse = short leg × 2.": "在30°-60°-90°三角形中：短边（对30°），长边 = 短边 × √3，斜边 = 短边 × 2。",
  "sin(A) = opposite / hypotenuse": "sin(A) = 对边 / 斜边",
  "cos(A) = adjacent / hypotenuse": "cos(A) = 邻边 / 斜边",
  "tan(A) = opposite / adjacent": "tan(A) = 对边 / 邻边",
  "The mnemonic SOH-CAH-TOA helps remember these definitions.": "助记词 SOH-CAH-TOA 帮助记住这些定义。",
  "Angle of elevation: The Angle formed by a horizontal Line and the Line of sight upward to an object.": "仰角：由水平线和向上望向物体的视线形成的角。",
  "Angle of depression: The Angle formed by a horizontal Line and the Line of sight downward to an object.": "俯角：由水平线和向下望向物体的视线形成的角。",
  "The Law of Sines: a/sin(A) = b/sin(B) = c/sin(C). Used when you know AAS, ASA, or an ambiguous SSA case.": "正弦定律：a/sin(A) = b/sin(B) = c/sin(C)。用于已知AAS、ASA或不确定SSA情况时。",
  "The Law of Cosines: c² = a² + b² − 2ab cos(C). Used when you know SAS or SSS.": "余弦定律：c² = a² + b² − 2ab cos(C)。用于已知SAS或SSS时。",
  "A vector has both magnitude (size) and direction. It is represented by a directed arrow from its tail (initial point) to its head (terminal point).": "向量同时具有大小和方向。它用从尾部（起点）到头部（终点）的有向箭头表示。",
  "Component form: ⟨a, b⟩ where a = horizontal change and b = vertical change.": "分量形式：⟨a, b⟩，其中a = 水平变化，b = 垂直变化。",
  "Magnitude: |v| = √(a² + b²).": "大小：|v| = √(a² + b²)。",
  "Direction: θ = tan⁻¹(b/a).": "方向：θ = tan⁻¹(b/a)。",
  "Addition: ⟨a₁, b₁⟩ + ⟨a₂, b₂⟩ = ⟨a₁+a₂, b₁+b₂⟩.": "加法：⟨a₁, b₁⟩ + ⟨a₂, b₂⟩ = ⟨a₁+a₂, b₁+b₂⟩。",
  "Scalar multiplication: k⟨a, b⟩ = ⟨ka, kb⟩.": "标量乘法：k⟨a, b⟩ = ⟨ka, kb⟩。",
  "A point in polar coordinates is given as (r, θ), where r is the distance from the origin and θ is the Angle from the positive x-axis.": "极坐标中的一个点表示为 (r, θ)，其中r是到原点的距离，θ是与正x轴的夹角。",
  "Converting polar to rectangular: x = r cos(θ), y = r sin(θ).": "极坐标转直角坐标：x = r cos(θ), y = r sin(θ)。",
  "Converting rectangular to polar: r = √(x² + y²), θ = tan⁻¹(y/x).": "直角坐标转极坐标：r = √(x² + y²), θ = tan⁻¹(y/x)。",
  "This lesson covers the fundamental concepts of Reflections.": "本课涵盖了反射的基本概念。",
  "This lesson covers the fundamental concepts of Translations.": "本课涵盖了平移的基本概念。",
  "This lesson covers the fundamental concepts of Rotations.": "本课涵盖了旋转的基本概念。",
  "This lesson covers the fundamental concepts of Compositions of Transformations.": "本课涵盖了变换组合的基本概念。",
  "This lesson covers the fundamental concepts of Symmetry.": "本课涵盖了对称的基本概念。",
  "This lesson covers the fundamental concepts of Dilations.": "本课涵盖了位似变换的基本概念。",
  "This lesson covers the fundamental concepts of Similarity Transformations.": "本课涵盖了相似变换的基本概念。",
  "Applications in geometry.": "几何中的应用。",
  "This lesson covers the fundamental concepts of Circles and Circumference.": "本课涵盖了圆和周长的基本概念。",
  "This lesson covers the fundamental concepts of Measuring Angles and Arcs.": "本课涵盖了测量角和弧的基本概念。",
  "This lesson covers the fundamental concepts of Arcs and Chords.": "本课涵盖了弧和弦的基本概念。",
  "This lesson covers the fundamental concepts of Inscribed Angles.": "本课涵盖了圆内接角的基本概念。",
  "This lesson covers the fundamental concepts of Tangent Lines.": "本课涵盖了切线的基本概念。",
  "This lesson covers the fundamental concepts of Secants, Tangents, and Angle Measures.": "本课涵盖了割线、切线和角度度量的基本概念。",
  "This lesson covers the fundamental concepts of Equations of Circles.": "本课涵盖了圆的方程的基本概念。",
  "This lesson covers the fundamental concepts of Special Segments in a Circle.": "本课涵盖了圆中特殊线段的基本概念。",
  "This lesson covers the fundamental concepts of Equations of Parabolas.": "本课涵盖了抛物线方程的基本概念。",
  "This lesson covers the fundamental concepts of Areas of Parallelograms and Triangles.": "本课涵盖了平行四边形和三角形面积的基本概念。",
  "This lesson covers the fundamental concepts of Areas of Trapezoids, Rhombi, and Kites.": "本课涵盖了梯形、菱形和筝形面积的基本概念。",
  "This lesson covers the fundamental concepts of Areas of Circles and Sectors.": "本课涵盖了圆和扇形面积的基本概念。",
  "This lesson covers the fundamental concepts of Areas of Regular Polygons and Composite Figures.": "本课涵盖了正多边形和组合图形面积的基本概念。",
  "This lesson covers the fundamental concepts of Areas of Similar Figures.": "本课涵盖了相似图形面积的基本概念。",
  "This lesson covers the fundamental concepts of Geometric Probability.": "本课涵盖了几何概率的基本概念。",
  "This lesson covers the fundamental concepts of Representations of Three-Dimensional Figures.": "本课涵盖了三维图形表示的基本概念。",
  "This lesson covers the fundamental concepts of Surface Areas of Prisms and Cylinders.": "本课涵盖了棱柱和圆柱表面积的基本概念。",
  "This lesson covers the fundamental concepts of Surface Areas of Pyramids and Cones.": "本课涵盖了棱锥和圆锥表面积的基本概念。",
  "This lesson covers the fundamental concepts of Volumes of Prisms and Cylinders.": "本课涵盖了棱柱和圆柱体积的基本概念。",
  "This lesson covers the fundamental concepts of Volumes of Pyramids and Cones.": "本课涵盖了棱锥和圆锥体积的基本概念。",
  "This lesson covers the fundamental concepts of Surface Areas and Volumes of Spheres.": "本课涵盖了球的表面积和体积的基本概念。",
  "This lesson covers the fundamental concepts of Congruent and Similar Solids.": "本课涵盖了全等和相似立体的基本概念。",
  "This lesson covers the fundamental concepts of Coordinates in Three Dimensions.": "本课涵盖了三维坐标的基本概念。",
  "This lesson covers the fundamental concepts of Cross Sections.": "本课涵盖了截面的基本概念。",
  "This lesson covers the fundamental concepts of Representing Sample Spaces.": "本课涵盖了表示样本空间的基本概念。",
  "This lesson covers the fundamental concepts of Probability with Permutations and Combinations.": "本课涵盖了排列和组合概率的基本概念。",
  "This lesson covers the fundamental concepts of Probability with Compound Events.": "本课涵盖了复合事件概率的基本概念。",
  "This lesson covers the fundamental concepts of Probability and Counting.": "本课涵盖了概率和计数的基本概念。",
  "This lesson covers the fundamental concepts of Probabilities of Independent and Dependent Events.": "本课涵盖了独立事件和相关事件概率的基本概念。",
  "This lesson covers the fundamental concepts of Probabilities of Mutually Exclusive Events.": "本课涵盖了互斥事件概率的基本概念。"
}
