[
  "Key Concepts: Points, Lines, and Planes",
  "Point",
  "A Point is the most basic building block of geometry. It represents a location in space with no size, no width, no length, and no depth. Points are named with capital letters (e.g., Point A).",
  "Line",
  "A Line is a straight path that extends infinitely in both directions . It has no thickness and contains infinitely many points. A Line is named by any two points on it (e.g., Line AB, written ←→ AB) or by a lowercase letter.",
  "Collinear points : Points that lie on the same Line .",
  "Collinear points \">Non- Collinear points : Points that do NOT lie on the same Line .",
  "Plane",
  "A Plane is a flat surface that extends infinitely in all directions . It has length and width but no thickness. A Plane is named by three Collinear points \">Non- Collinear points (e.g., Plane ABC) or by a capital letter.",
  "Coplanar points : Points that lie in the same Plane .",
  "Coplanar points \">Non- Coplanar points : Points that do NOT all lie in the same Plane .",
  "Key Postulates",
  "Through any two points, there is exactly one Line .",
  "Through any three Collinear points \">Non- Collinear points , there is exactly one Plane .",
  "A Line contains at least two points .",
  "A Plane contains at least three Collinear points \">Non- Collinear points .",
  "If two points lie in a Plane , the entire Line containing them lies in the Plane .",
  "If two planes intersect, their intersection is a Line .",
  "Key Concepts: Linear Measure and Precision",
  "Line Segments",
  "A Line segment is a part of a Line bounded by two endpoints. Unlike a Line , a segment has a definite length . The length of segment AB is written as AB (without the bar above).",
  "Measuring Segments",
  "Use a ruler to find the distance between two points.",
  "The precision of a measurement depends on the smallest unit on the measuring tool.",
  "All measurements are approximations — the true value lies within a range determined by the precision.",
  "Betweenness of Points",
  "Point B is between points A and C if A, B, and C are collinear and AB + BC = AC. This is called the Segment Addition Postulate .",
  "Congruent Segments",
  "Two segments are congruent (≅) if they have the same length. Notation: AB ≅ CD means segment AB is congruent to segment CD.",
  "Key Concepts: Distance and Midpoints",
  "Distance Formula",
  "The distance between two points (x₁, y₁) and (x₂, y₂) in the coordinate Plane is:",
  "d = √[(x₂ − x₁)² + (y₂ − y₁)²]",
  "This formula comes from the Pythagorean Theorem .",
  "Midpoint",
  "The midpoint of a segment is the Point that divides the segment into two congruent parts.",
  "Midpoint Formula",
  "The midpoint M of a segment with endpoints (x₁, y₁) and (x₂, y₂) is:",
  "M = ((x₁ + x₂)/2, (y₁ + y₂)/2)",
  "Segment Bisector",
  "A segment bisector is any segment, Line , or ray that passes through the midpoint of a segment, dividing it into two congruent halves.",
  "Key Concepts: Angle Measure",
  "Angles",
  "An Angle is formed by two rays with a common endpoint called the vertex . The rays are called the sides of the Angle . Angles are measured in degrees (°) .",
  "Types of Angles",
  "Acute Angle : An Angle measuring between 0° and 90°.",
  "Right Angle : An Angle measuring exactly 90°.",
  "Obtuse Angle : An Angle measuring between 90° and 180°.",
  "Straight Angle : An Angle measuring exactly 180°.",
  "Angle Addition Postulate",
  "If Point D is in the interior of ∠ABC, then m∠ABD + m∠DBC = m∠ABC.",
  "Congruent Angles",
  "Two angles are congruent if they have the same measure. Notation: ∠A ≅ ∠B.",
  "Angle Bisector",
  "An Angle bisector is a ray that divides an Angle into two congruent angles.",
  "Key Concepts: Angle Relationships",
  "Adjacent Angles",
  "Adjacent angles are two angles that share a common vertex and a common side but have no interior points in common.",
  "Vertical Angles",
  "Vertical Angles are two non-adjacent angles formed by two intersecting lines. Vertical Angles are always congruent .",
  "Complementary Angles",
  "Two angles are complementary if the sum of their measures is 90° .",
  "Supplementary Angles",
  "Two angles are supplementary if the sum of their measures is 180° .",
  "Linear Pair",
  "A Linear Pair is a pair of adjacent angles whose non-common sides form a straight Line . Linear pairs are always supplementary (sum to 180°).",
  "Perpendicular Lines",
  "Two lines are perpendicular (⊥) if they intersect to form right angles (90°).",
  "Key Concepts: Two-Dimensional Figures",
  "Polygons",
  "A Polygon is a closed figure formed by three or more Line segments (sides) that meet at their endpoints (vertices). Key properties:",
  "Each side intersects exactly two other sides at their endpoints.",
  "No two sides with a common endpoint are collinear.",
  "Classifying Polygons by Sides",
  "Triangle : 3 sides",
  "Quadrilateral : 4 sides",
  "Pentagon : 5 sides",
  "Hexagon : 6 sides",
  "Heptagon : 7 sides",
  "Octagon : 8 sides",
  "Nonagon : 9 sides | Decagon : 10 sides | Dodecagon : 12 sides",
  "Convex vs. Concave",
  "Convex Polygon : All interior angles are less than 180°. Any Line segment connecting two interior points lies entirely inside.",
  "Concave Polygon : At least one interior Angle is greater than 180°.",
  "Regular Polygon",
  "A regular Polygon is both equilateral (all sides congruent) and equiangular (all angles congruent).",
  "Perimeter",
  "The perimeter of a Polygon is the sum of the lengths of its sides.",
  "Key Concepts: Three-Dimensional Figures",
  "Polyhedra",
  "A polyhedron (plural: polyhedra) is a solid bounded by polygons called faces . The segments where faces meet are edges , and the points where edges meet are vertices .",
  "Common 3D Figures",
  "Prism : Two congruent, parallel polygonal bases connected by rectangular faces. Named by the shape of the base (triangular Prism , rectangular Prism , etc.).",
  "Pyramid : One polygonal base with triangular faces meeting at a single Point (apex).",
  "Cylinder : Two congruent, parallel circular bases connected by a curved surface.",
  "Cone : One circular base tapering to a Point (apex).",
  "Sphere : The set of all points equidistant from a center Point .",
  "Euler's Formula",
  "For any convex polyhedron: V − E + F = 2 , where V = vertices, E = edges, F = faces.",
  "Cross Sections",
  "A cross section is the shape formed when a Plane intersects a solid figure.",
  "Key Concepts",
  "This lesson covers the fundamental concepts of Circles and Circumference.",
  "Definition and properties.",
  "Applications in geometry.",
  "Problem-solving strategies.",
  "This lesson covers the fundamental concepts of Measuring Angles and Arcs.",
  "This lesson covers the fundamental concepts of Arcs and Chords.",
  "This lesson covers the fundamental concepts of Inscribed Angles.",
  "This lesson covers the fundamental concepts of Tangents.",
  "This lesson covers the fundamental concepts of Secants, Tangents, and Angle Measures.",
  "This lesson covers the fundamental concepts of Special Segments in a Circle .",
  "This lesson covers the fundamental concepts of Equations of Circles ⭐.",
  "This lesson covers the fundamental concepts of Conic Sections (intro) ⭐.",
  "This lesson covers the fundamental concepts of Areas of Parallelograms and Triangles.",
  "This lesson covers the fundamental concepts of Areas of Trapezoids, Rhombi, and Kites.",
  "This lesson covers the fundamental concepts of Areas of Circles and Sectors.",
  "This lesson covers the fundamental concepts of Areas of Regular Polygons and Composite Figures.",
  "This lesson covers the fundamental concepts of Areas of Similar Figures.",
  "This lesson covers the fundamental concepts of Integration in Area Calculations ⭐.",
  "This lesson covers the fundamental concepts of Representations of Three-Dimensional Figures.",
  "This lesson covers the fundamental concepts of Surface Areas of Prisms and Cylinders.",
  "This lesson covers the fundamental concepts of Surface Areas of Pyramids and Cones.",
  "This lesson covers the fundamental concepts of Volumes of Prisms and Cylinders.",
  "This lesson covers the fundamental concepts of Volumes of Pyramids and Cones.",
  "This lesson covers the fundamental concepts of Surface Areas and Volumes of Spheres.",
  "This lesson covers the fundamental concepts of Spherical Geometry ⭐.",
  "This lesson covers the fundamental concepts of Congruent and Similar Solids.",
  "This lesson covers the fundamental concepts of Cavalieri’s Principle and Applications ⭐.",
  "This lesson covers the fundamental concepts of Representing Sample Spaces.",
  "This lesson covers the fundamental concepts of Permutations and Combinations.",
  "This lesson covers the fundamental concepts of Geometric Probability.",
  "This lesson covers the fundamental concepts of Simulations.",
  "This lesson covers the fundamental concepts of Probabilities of Independent and Dependent Events.",
  "This lesson covers the fundamental concepts of Probabilities of Mutually Exclusive Events.",
  "This lesson covers the fundamental concepts of Monte Carlo Methods in Geometry ⭐.",
  "Key Concepts: Inductive Reasoning and Conjecture",
  "Inductive Reasoning",
  "Inductive reasoning uses patterns and observations to form a general conclusion called a conjecture . You look at specific cases and make an educated guess about what is always true.",
  "Example: 2, 4, 6, 8, ... → Conjecture: the next number is 10.",
  "Inductive reasoning does NOT prove something is true — it only suggests it might be.",
  "Conjecture",
  "A conjecture is an unproven statement based on observations. A conjecture remains unproven until it is shown to be either true (via a proof) or false (via a counterexample).",
  "Counterexample",
  "A counterexample is a single example that disproves a conjecture. You only need ONE counterexample to prove a conjecture is false.",
  "Conjecture: \"All prime numbers are odd.\" Counterexample: 2 is prime and even.",
  "Key Concepts: Logic ⭐",
  "Statements and Truth Values",
  "A statement (or proposition) is a sentence that is either true (T) or false (F) , but not both.",
  "Negation",
  "The negation of a statement p (written ~p or ¬p) has the opposite truth value. If p is true, then ~p is false, and vice versa.",
  "Compound Statements",
  "Conjunction (p ∧ q) : \"p AND q\" — true only when BOTH p and q are true.",
  "Disjunction (p ∨ q) : \"p OR q\" — true when AT LEAST ONE of p or q is true.",
  "Truth Tables",
  "A truth table shows all possible combinations of truth values for a compound statement. For two statements p and q, there are 4 possible combinations (TT, TF, FT, FF).",
  "Key Concepts: Conditional Statements",
  "Conditional Statement",
  "A conditional statement has the form \"If p, then q\" (written p → q). The hypothesis is p and the conclusion is q.",
  "A conditional is false ONLY when the hypothesis is true and the conclusion is false.",
  "Related Conditionals",
  "Converse : If q, then p (q → p) — swap hypothesis and conclusion.",
  "Inverse : If not p, then not q (~p → ~q) — negate both.",
  "Contrapositive : If not q, then not p (~q → ~p) — swap AND negate.",
  "Key Fact",
  "A conditional and its contrapositive always have the same truth value . The converse and inverse also share the same truth value (but may differ from the original).",
  "Biconditional",
  "A biconditional statement (p ↔ q) means \"p if and only if q.\" It is true when both p and q have the same truth value .",
  "Key Concepts: Deductive Reasoning ⭐",
  "Deductive Reasoning",
  "Deductive reasoning uses facts, rules, definitions, or properties to reach a logical conclusion. Unlike inductive reasoning, valid deductive reasoning guarantees a true conclusion if the premises are true.",
  "Law of Detachment",
  "If p → q is true and p is true, then q must be true.",
  "Example: If a figure is a square, then it is a rectangle. Figure ABCD is a square. Therefore, ABCD is a rectangle.",
  "Law of Syllogism",
  "If p → q is true and q → r is true, then p → r is true.",
  "Example: If it rains, the ground gets wet. If the ground gets wet, the flowers grow. Therefore, if it rains, the flowers grow.",
  "Key Concepts: Postulates and Paragraph Proofs",
  "Postulates (Axioms)",
  "A postulate is a statement accepted as true without proof . Postulates serve as the foundation for building theorems through logical reasoning.",
  "Theorems",
  "A theorem is a statement that has been proven true using postulates, definitions, and previously proven theorems.",
  "Paragraph Proof",
  "A paragraph proof (informal proof) presents a logical argument in paragraph form, where each statement is backed by a reason (definition, postulate, or theorem).",
  "State what is given and what you need to prove.",
  "Write a series of statements, each justified by a reason.",
  "Conclude with what you set out to prove.",
  "Key Concepts: Algebraic Proof",
  "Properties of Equality",
  "These algebraic properties are used to justify steps in proofs:",
  "Reflexive Property : a = a",
  "Symmetric Property : If a = b, then b = a",
  "Transitive Property : If a = b and b = c, then a = c",
  "Addition Property : If a = b, then a + c = b + c",
  "Subtraction Property : If a = b, then a − c = b − c",
  "Multiplication Property : If a = b, then ac = bc",
  "Division Property : If a = b and c ≠ 0, then a/c = b/c",
  "Substitution Property : If a = b, then a may replace b in any expression",
  "Distributive Property : a(b + c) = ab + ac",
  "Key Concepts: Proving Segment Relationships",
  "Properties of Segment Congruence",
  "Reflexive : AB ≅ AB",
  "Symmetric : If AB ≅ CD, then CD ≅ AB",
  "Transitive : If AB ≅ CD and CD ≅ EF, then AB ≅ EF",
  "Two-Column Proof",
  "A two-column proof organizes statements and reasons side by side:",
  "Left column : Statements (what is true)",
  "Right column : Reasons (why it is true — definitions, postulates, theorems, properties)",
  "Segment Addition Postulate in Proofs",
  "The Segment Addition Postulate (If B is between A and C, then AB + BC = AC) is frequently used to prove segment relationships.",
  "Key Concepts: Proving Angle Relationships",
  "Properties of Angle Congruence",
  "Reflexive : ∠A ≅ ∠A",
  "Symmetric : If ∠A ≅ ∠B, then ∠B ≅ ∠A",
  "Transitive : If ∠A ≅ ∠B and ∠B ≅ ∠C, then ∠A ≅ ∠C",
  "Key Theorems",
  "Supplement Theorem : If two angles form a Linear Pair , they are supplementary.",
  "Complement Theorem : If the non-common sides of two adjacent angles form a right Angle , the angles are complementary.",
  "Vertical Angles Theorem : Vertical Angles are congruent.",
  "Congruent Supplements Theorem : If two angles are supplementary to the same Angle (or congruent angles), they are congruent.",
  "Congruent Complements Theorem : If two angles are complementary to the same Angle (or congruent angles), they are congruent.",
  "Right Angle Theorems : All right angles are congruent. Perpendicular lines form congruent adjacent angles.",
  "Key Concepts: Proofs in Coordinate Geometry ⭐",
  "Coordinate Proofs",
  "A coordinate proof uses the coordinate Plane and algebraic methods (distance formula, midpoint formula, slope) to prove geometric theorems.",
  "Steps for Coordinate Proofs",
  "Place the figure in the coordinate Plane (choose convenient coordinates).",
  "Use the Distance Formula to find lengths.",
  "Use the Midpoint Formula to find midpoints.",
  "Use the Slope Formula (rise/run) to determine parallelism or perpendicularity.",
  "Draw conclusions based on the calculations.",
  "Slope",
  "slope = (y₂ − y₁) / (x₂ − x₁)",
  "Parallel lines have equal slopes .",
  "Perpendicular lines have slopes that are negative reciprocals (product = −1).",
  "Key Concepts: Parallel Lines and Transversals",
  "Parallel Lines",
  "Parallel lines are coplanar lines that never intersect. Symbol: ∥ (e.g., Line l ∥ Line m).",
  "Transversal",
  "A transversal is a Line that intersects two or more coplanar lines at different points. When a transversal crosses two lines, it creates 8 angles.",
  "Angle Pairs Formed by a Transversal",
  "Corresponding angles : Same position at each intersection (e.g., both upper-left). ∠1 and ∠5.",
  "Alternate interior angles : On opposite sides of the transversal, between the lines. ∠3 and ∠6.",
  "Alternate exterior angles : On opposite sides of the transversal, outside the lines. ∠1 and ∠8.",
  "Consecutive interior angles (co-interior / same-side interior): Same side of transversal, between the lines. ∠3 and ∠5.",
  "Key Concepts: Angles and Parallel Lines",
  "Postulate and Theorems (when lines ARE parallel)",
  "Corresponding Angles Postulate : If two parallel lines are cut by a transversal, then corresponding angles are congruent .",
  "Alternate Interior Angles Theorem : If two parallel lines are cut by a transversal, then alternate interior angles are congruent .",
  "Alternate Exterior Angles Theorem : If two parallel lines are cut by a transversal, then alternate exterior angles are congruent .",
  "Consecutive Interior Angles Theorem : If two parallel lines are cut by a transversal, then consecutive interior angles are supplementary (sum to 180°).",
  "Key Idea",
  "When lines are parallel, the Angle relationships become predictable. These theorems are used extensively in proofs involving parallel lines.",
  "Key Concepts: Slopes of Lines",
  "The slope of a Line measures its steepness and direction. Given two points (x₁, y₁) and (x₂, y₂):",
  "m = (y₂ − y₁) / (x₂ − x₁)",
  "Types of Slope",
  "Positive slope : Line rises from left to right.",
  "Negative slope : Line falls from left to right.",
  "Zero slope : Horizontal Line (y values constant).",
  "Undefined slope : Vertical Line (x values constant, division by zero).",
  "Parallel and Perpendicular Slopes",
  "Parallel lines : Same slope (m₁ = m₂).",
  "Perpendicular lines : Slopes are negative reciprocals (m₁ × m₂ = −1).",
  "Key Concepts: Equations of Lines",
  "Slope-Intercept Form",
  "y = mx + b",
  "where m is the slope and b is the y-intercept.",
  "Point -Slope Form",
  "y − y₁ = m(x − x₁)",
  "where m is the slope and (x₁, y₁) is a known Point on the Line .",
  "Standard Form",
  "Ax + By = C",
  "where A, B, and C are integers and A ≥ 0.",
  "Writing Equations",
  "Given slope and y-intercept → use slope-intercept form.",
  "Given slope and a Point → use Point -slope form.",
  "Given two points → find slope first, then use Point -slope form.",
  "Parallel to a given Line → same slope, different intercept.",
  "Perpendicular to a given Line → use negative reciprocal slope.",
  "Key Concepts: Proving Lines Parallel",
  "Converses of Parallel Line Theorems",
  "To prove lines are parallel, we use the converses of our earlier theorems:",
  "Converse of Corresponding Angles Postulate : If corresponding angles are congruent, then the lines are parallel.",
  "Converse of Alternate Interior Angles Theorem : If alternate interior angles are congruent, then the lines are parallel.",
  "Converse of Alternate Exterior Angles Theorem : If alternate exterior angles are congruent, then the lines are parallel.",
  "Converse of Consecutive Interior Angles Theorem : If consecutive interior angles are supplementary, then the lines are parallel.",
  "Other Ways to Prove Lines Parallel",
  "If two lines are perpendicular to the same Line , they are parallel.",
  "If two lines have the same slope (in coordinate geometry), they are parallel.",
  "Key Concepts: Perpendiculars and Distance",
  "Two lines are perpendicular if they intersect at right angles (90°). The shortest distance from a Point to a Line is always along the perpendicular segment.",
  "Distance from a Point to a Line",
  "The distance from a Point to a Line is measured along the perpendicular segment from the Point to the Line . This is the shortest distance.",
  "Distance Between Parallel Lines",
  "The distance between two parallel lines is the length of the perpendicular segment between them. This distance is constant everywhere.",
  "Perpendicular Bisector",
  "A perpendicular bisector of a segment is a Line perpendicular to the segment at its midpoint. Any Point on the perpendicular bisector is equidistant from the endpoints.",
  "Key Concepts: Analytic Geometry Applications ⭐",
  "Analytic (Coordinate) Geometry",
  "Analytic geometry uses coordinates and algebra to study geometric figures. Key formulas:",
  "Distance Formula : d = √[(x₂−x₁)² + (y₂−y₁)²]",
  "Midpoint Formula : M = ((x₁+x₂)/2, (y₁+y₂)/2)",
  "Slope Formula : m = (y₂−y₁)/(x₂−x₁)",
  "Applications",
  "Classify shapes : Use distance to verify side lengths, slope to check parallel/perpendicular sides.",
  "Prove properties : Show a Quadrilateral is a parallelogram by proving opposite sides have equal slopes.",
  "Find areas : Use coordinates to calculate areas of triangles and polygons.",
  "Verify geometric theorems : Place figures on a coordinate Plane and use algebra to confirm relationships.",
  "Key Concepts: Classifying Triangles",
  "Classifying by Sides",
  "Triangle \">Scalene Triangle : No sides are congruent.",
  "Triangle \">Isosceles Triangle : At least two sides are congruent.",
  "Triangle \">Equilateral Triangle : All three sides are congruent.",
  "Classifying by Angles",
  "Acute Triangle : All angles are less than 90°.",
  "Right Triangle : One Angle is exactly 90°.",
  "Obtuse Triangle : One Angle is greater than 90°.",
  "Equiangular Triangle : All angles are equal (each is 60°).",
  "Key Facts",
  "Every Triangle \">Equilateral Triangle is also equiangular (and vice versa).",
  "An Triangle \">Isosceles Triangle has a vertex Angle (between the congruent sides) and two base angles (which are congruent).",
  "Key Concepts: Angles of Triangles",
  "Triangle Angle Sum Theorem",
  "The sum of the measures of the interior angles of a Triangle is 180° .",
  "m∠A + m∠B + m∠C = 180°",
  "Exterior Angle Theorem",
  "The measure of an exterior Angle of a Triangle equals the sum of the two non-adjacent interior angles (remote interior angles).",
  "Corollaries",
  "The acute angles of a right Triangle are complementary (sum to 90°).",
  "A Triangle can have at most one right Angle or obtuse Angle .",
  "Key Concepts: Congruent Triangles",
  "Congruent Triangles",
  "Two triangles are congruent if all their corresponding sides and corresponding angles are congruent. When listing congruent triangles, the order of vertices matters — it shows which parts correspond.",
  "CPCTC",
  "Corresponding Parts of Congruent Triangles are Congruent (CPCTC). Once two triangles are proven congruent, ALL corresponding parts are congruent.",
  "Third Angles Theorem",
  "If two angles of one Triangle are congruent to two angles of another Triangle , then the third angles are also congruent.",
  "Key Concepts: Proving Congruence — SSS, SAS",
  "SSS (Side-Side-Side) Postulate",
  "If three sides of one Triangle are congruent to three sides of another Triangle , the triangles are congruent .",
  "SAS (Side- Angle -Side) Postulate",
  "If two sides and the included Angle of one Triangle are congruent to two sides and the included Angle of another Triangle , the triangles are congruent .",
  "The included Angle is the Angle formed between the two given sides.",
  "Using SSS and SAS in Proofs",
  "Identify corresponding sides and angles from the given information.",
  "Look for shared sides (Reflexive Property) or Vertical Angles .",
  "Match three pairs: SSS or SAS.",
  "State the congruence, then use CPCTC for further conclusions.",
  "Key Concepts: Proving Congruence — ASA, AAS",
  "ASA ( Angle -Side- Angle ) Postulate",
  "If two angles and the included side of one Triangle are congruent to two angles and the included side of another Triangle , the triangles are congruent .",
  "AAS ( Angle - Angle -Side) Theorem",
  "If two angles and a non-included side of one Triangle are congruent to the corresponding parts of another Triangle , the triangles are congruent .",
  "Summary of Congruence Methods",
  "✅ SSS — 3 sides",
  "✅ SAS — 2 sides + included Angle",
  "✅ ASA — 2 angles + included side",
  "✅ AAS — 2 angles + non-included side",
  "❌ SSA — NOT valid",
  "❌ AAA — NOT valid (proves similarity only)",
  "Key Concepts: Isosceles and Equilateral Triangles",
  "Triangle \">Isosceles Triangle Theorem",
  "If two sides of a Triangle are congruent, then the angles opposite those sides (base angles) are congruent.",
  "Converse of Triangle \">Isosceles Triangle Theorem",
  "If two angles of a Triangle are congruent, then the sides opposite those angles are congruent.",
  "Triangle \">Equilateral Triangle Corollaries",
  "A Triangle is equilateral if and only if it is equiangular.",
  "Each Angle of an Triangle \">Equilateral Triangle measures 60° .",
  "Parts of an Triangle \">Isosceles Triangle",
  "Legs : The two congruent sides.",
  "Base : The non-congruent side.",
  "Vertex Angle : The Angle between the two legs.",
  "Base angles : The angles opposite the legs (always congruent).",
  "Key Concepts: Congruence Transformations",
  "Rigid Motions (Isometries)",
  "A transformation that preserves distance and Angle measure is called a rigid motion or isometry . Rigid motions produce congruent figures.",
  "Three Types of Rigid Motions",
  "Translation : Slides a figure in a given direction by a given distance. Every Point moves the same distance.",
  "Reflection : Flips a figure over a Line ( Line of reflection). Each Point is the same distance from the Line on the opposite side.",
  "Rotation : Turns a figure around a fixed Point (center of rotation) by a given Angle .",
  "Key Properties",
  "All three rigid motions preserve side lengths, Angle measures, and parallelism.",
  "The pre-image and image are always congruent .",
  "Compositions of rigid motions (doing two or more in sequence) also produce congruent figures.",
  "Key Concepts: Triangles and Coordinate Proof ⭐",
  "Coordinate Proofs with Triangles",
  "In a coordinate proof involving triangles, you place the Triangle on the coordinate Plane and use formulas to prove properties.",
  "Strategies for Placing Triangles",
  "Place one vertex at the origin (0, 0) .",
  "Align one side along the x-axis or y-axis .",
  "Use variables (a, b, c) for coordinates to prove general results.",
  "For isosceles triangles, use the y-axis as the Line of symmetry.",
  "Common Proofs",
  "Prove a Triangle is isosceles : Show two sides have equal length using the Distance Formula.",
  "Prove a Triangle is right : Show two sides have perpendicular slopes (product = −1).",
  "Find the centroid : Average the coordinates: ((x₁+x₂+x₃)/3, (y₁+y₂+y₃)/3).",
  "Bisectors of Triangles",
  "A perpendicular bisector of a side of a Triangle is a Line , segment, or ray that is perpendicular to that side at its midpoint.",
  "Perpendicular Bisector Theorem : Any Point on the perpendicular bisector of a segment is equidistant from the endpoints of the segment.",
  "Converse : If a Point is equidistant from the endpoints of a segment, then it lies on the perpendicular bisector.",
  "Circumcenter",
  "The three perpendicular bisectors of a Triangle are concurrent (meet at one Point ). This Point is called the circumcenter .",
  "The circumcenter is equidistant from all three vertices.",
  "It is the center of the circumscribed Circle (the Circle passing through all three vertices).",
  "In an acute Triangle , the circumcenter is inside the Triangle .",
  "In a right Triangle , the circumcenter is on the hypotenuse (its midpoint).",
  "In an obtuse Triangle , the circumcenter is outside the Triangle .",
  "An Angle bisector of a Triangle divides an Angle into two congruent angles.",
  "Angle Bisector Theorem : Any Point on the Angle bisector is equidistant from the two sides of the Angle .",
  "Incenter",
  "The three Angle bisectors of a Triangle are concurrent. This Point is called the incenter .",
  "The incenter is equidistant from all three sides.",
  "It is the center of the inscribed Circle (the Circle that fits inside the Triangle and touches all three sides).",
  "The incenter is always inside the Triangle .",
  "Medians and Altitudes of Triangles",
  "Median of a Triangle",
  "A median is a segment from a vertex to the midpoint of the opposite side. Every Triangle has three medians.",
  "Centroid",
  "The three medians are concurrent at the centroid .",
  "The centroid divides each median in a 2:1 ratio from the vertex.",
  "The centroid is the center of gravity (balance Point ) of the Triangle .",
  "The centroid is always inside the Triangle .",
  "Centroid formula: ((x₁+x₂+x₃)/3, (y₁+y₂+y₃)/3)",
  "Altitude of a Triangle",
  "An altitude is a perpendicular segment from a vertex to the Line containing the opposite side (the base). Every Triangle has three altitudes.",
  "Orthocenter",
  "The three altitudes are concurrent at the orthocenter .",
  "In an acute Triangle , the orthocenter is inside .",
  "In a right Triangle , the orthocenter is at the right- Angle vertex .",
  "In an obtuse Triangle , the orthocenter is outside .",
  "Summary of Triangle Centers",
  "Inequalities in One Triangle",
  "Comparing Sides and Angles",
  "If one side of a Triangle is longer than another side, then the Angle opposite the longer side is larger than the Angle opposite the shorter side.",
  "If one Angle of a Triangle is larger than another Angle , then the side opposite the larger Angle is longer than the side opposite the smaller Angle .",
  "Exterior Angle Inequality Theorem",
  "The measure of an exterior Angle of a Triangle is greater than the measure of either of the two non-adjacent (remote) interior angles.",
  "Ordering Sides and Angles",
  "In any Triangle , you can order the sides from shortest to longest and the angles from smallest to largest — these orderings match:",
  "Shortest side ↔ Smallest Angle",
  "Medium side ↔ Medium Angle",
  "Longest side ↔ Largest Angle",
  "Example : In △ABC with AB = 5, BC = 8, AC = 6, the angles from smallest to largest are: ∠C < ∠B < ∠A ( Angle opposite the shortest side is smallest).",
  "Indirect Proof (Proof by Contradiction)",
  "What Is Indirect Proof?",
  "An indirect proof (also called proof by contradiction ) is a method where you assume the opposite of what you want to prove, then show that this assumption leads to a contradiction.",
  "Steps for Writing an Indirect Proof",
  "Assume the opposite : Assume that the conclusion you want to prove is false (negate the conclusion).",
  "Use logical reasoning : Use definitions, theorems, and given information to reason from the assumption.",
  "Reach a contradiction : Show that the assumption leads to a statement that contradicts a known fact, a given, or a theorem.",
  "Conclude : Since the assumption leads to a contradiction, the original statement must be true.",
  "Example",
  "Prove: A Triangle cannot have two obtuse angles.",
  "Assume a Triangle has two obtuse angles, say ∠A > 90° and ∠B > 90°.",
  "Then ∠A + ∠B > 180°.",
  "But the sum of all angles in a Triangle is 180°. So ∠A + ∠B + ∠C = 180°.",
  "This means ∠C < 0°, which is impossible.",
  "Contradiction! Therefore, a Triangle cannot have two obtuse angles.",
  "When to Use Indirect Proof",
  "When the statement says something cannot happen or something must be true.",
  "When a direct approach seems difficult or impossible.",
  "When the conclusion involves uniqueness (\"there is exactly one...\").",
  "The Triangle Inequality",
  "Triangle Inequality Theorem",
  "The sum of the lengths of any two sides of a Triangle must be greater than the length of the third side.",
  "For a Triangle with sides a, b, c:",
  "a + b > c",
  "a + c > b",
  "b + c > a",
  "Using the Triangle Inequality",
  "To check if three lengths can form a Triangle , verify all three inequalities. In practice, you only need to check that the sum of the two shortest sides is greater than the longest side.",
  "Example 1 : Can sides 3, 4, 8 form a Triangle ?",
  "Check: 3 + 4 = 7 < 8. No , these cannot form a Triangle .",
  "Example 2 : Can sides 5, 7, 10 form a Triangle ?",
  "Check: 5 + 7 = 12 > 10. ✓ Also 5 + 10 > 7 ✓ and 7 + 10 > 5 ✓. Yes .",
  "Finding the Range of the Third Side",
  "If two sides have lengths a and b (where a < b), the third side c must satisfy:",
  "b − a < c < a + b",
  "Example : If two sides are 5 and 11, then the third side must be between 11 − 5 = 6 and 5 + 11 = 16: 6 < c < 16 .",
  "Inequalities in Two Triangles",
  "Hinge Theorem (SAS Inequality Theorem)",
  "If two sides of one Triangle are congruent to two sides of another Triangle and the included Angle of the first is larger than the included Angle of the second, then the third side of the first Triangle is longer than the third side of the second Triangle .",
  "Converse of the Hinge Theorem (SSS Inequality)",
  "If two sides of one Triangle are congruent to two sides of another Triangle and the third side of the first is longer than the third side of the second, then the included Angle of the first Triangle is larger than the included Angle of the second.",
  "Analogy",
  "Think of a door hinge: two sides of the Triangle are like the door and the frame, and the included Angle is how wide the door is open. A wider opening Angle means the gap (third side) is larger.",
  "In △ABC and △DEF: AB = DE = 8, BC = EF = 6, and ∠B = 70° while ∠E = 50°.",
  "Since ∠B > ∠E and the two pairs of sides are equal, the Hinge Theorem tells us AC > DF.",
  "Angles of Polygons",
  "Interior Angle Sum",
  "The sum of the interior angles of a convex Polygon with n sides is:",
  "S = (n − 2) × 180°",
  "Polygon Sides Angle Sum Triangle 3 180° Quadrilateral 4 360° Pentagon 5 540° Hexagon 6 720° n-gon n (n−2)×180° Each Interior Angle of a Regular Polygon",
  "Each Angle = (n − 2) × 180° / n",
  "Exterior Angle Sum",
  "The sum of the exterior angles of any convex Polygon (one at each vertex) is always 360° , regardless of the number of sides.",
  "Each exterior Angle of a regular Polygon = 360° / n .",
  "Properties of Parallelograms",
  "A parallelogram is a Quadrilateral with both pairs of opposite sides parallel.",
  "Properties",
  "Opposite sides are congruent .",
  "Opposite angles are congruent .",
  "Consecutive angles are supplementary (sum to 180°).",
  "Diagonals bisect each other .",
  "Using Properties",
  "If ABCD is a parallelogram:",
  "AB ∥ CD and AD ∥ BC (definition)",
  "AB = CD and AD = BC (opposite sides congruent)",
  "∠A = ∠C and ∠B = ∠D (opposite angles congruent)",
  "∠A + ∠B = 180° (consecutive angles supplementary)",
  "Diagonals AC and BD bisect each other at Point M (AM = MC, BM = MD)",
  "Tests for Parallelograms",
  "To prove a Quadrilateral is a parallelogram, you can use any one of the following tests:",
  "Both pairs of opposite sides are parallel (definition).",
  "Both pairs of opposite sides are congruent .",
  "Both pairs of opposite angles are congruent .",
  "One pair of opposite sides is both parallel and congruent .",
  "The diagonals bisect each other .",
  "Common Mistakes",
  "Having only one pair of parallel sides is NOT enough (that's a trapezoid).",
  "Having only one pair of congruent sides is NOT enough.",
  "Having congruent diagonals alone does NOT prove a parallelogram (it could be an isosceles trapezoid).",
  "Rectangles",
  "A rectangle is a parallelogram with four right angles .",
  "Properties (inherits all parallelogram properties, plus)",
  "All four angles are 90° .",
  "Diagonals are congruent .",
  "Diagonals bisect each other (parallelogram property).",
  "Proving a Rectangle",
  "Show it is a parallelogram with one right Angle (then all are right angles).",
  "Show it is a parallelogram with congruent diagonals .",
  "Show all four angles are right angles.",
  "Rectangle vs Parallelogram",
  "Every rectangle is a parallelogram, but not every parallelogram is a rectangle. The special property is the right angles (or equivalently, congruent diagonals).",
  "Rhombi and Squares",
  "Rhombus",
  "A rhombus is a parallelogram with four congruent sides .",
  "Special Properties:",
  "All sides are congruent .",
  "Diagonals are perpendicular .",
  "Each diagonal bisects a pair of opposite angles .",
  "Square",
  "A square is a parallelogram that is both a rectangle and a rhombus . It has all the properties of both:",
  "Four congruent sides (rhombus).",
  "Four right angles (rectangle).",
  "Diagonals are congruent (rectangle), perpendicular (rhombus), and bisect each other and the angles.",
  "Quadrilateral Hierarchy",
  "Parallelogram → Rectangle (right angles), Rhombus (equal sides) → Square (both)",
  "Kites and Trapezoids",
  "Trapezoid",
  "A trapezoid has exactly one pair of parallel sides (called bases ). The non-parallel sides are called legs .",
  "Isosceles trapezoid : Legs are congruent. Base angles are congruent. Diagonals are congruent.",
  "Midsegment of a trapezoid: The segment connecting the midpoints of the legs. Its length = (b₁ + b₂) / 2 .",
  "Kite",
  "A kite has two pairs of consecutive congruent sides (but opposite sides are NOT congruent).",
  "The diagonals are perpendicular .",
  "Exactly one diagonal bisects the other.",
  "Exactly one pair of opposite angles is congruent.",
  "Regular Polygons and Symmetry",
  "Line Symmetry",
  "A regular Polygon with n sides has n lines of symmetry .",
  "Triangle \">Equilateral Triangle : 3 lines of symmetry",
  "Square: 4 lines of symmetry",
  "Regular hexagon: 6 lines of symmetry",
  "Rotational Symmetry",
  "A regular n-gon has rotational symmetry of order n . The smallest rotation Angle that maps it onto itself is 360°/n .",
  "Center and Apothem",
  "The center of a regular Polygon is equidistant from all vertices (circumradius) and from all sides (apothem).",
  "The apothem is the perpendicular distance from the center to a side.",
  "Area = (1/2) × apothem × perimeter",
  "Ratios and Proportions",
  "Ratio",
  "A ratio compares two quantities. It can be written as a:b, a/b, or \"a to b\".",
  "Proportion",
  "A proportion is an equation stating that two ratios are equal: a/b = c/d.",
  "Cross Products Property",
  "If a/b = c/d, then ad = bc . This is the fundamental tool for solving proportions.",
  "Properties of Proportions",
  "Reciprocal : If a/b = c/d, then b/a = d/c.",
  "Cross-multiply : ad = bc.",
  "Alternation : If a/b = c/d, then a/c = b/d.",
  "Solving Proportions",
  "Example: Solve x/6 = 10/15",
  "Cross-multiply: 15x = 60 → x = 4",
  "Similar Polygons",
  "Two polygons are similar (~) if:",
  "All corresponding angles are congruent .",
  "All corresponding sides are proportional .",
  "Scale Factor",
  "The scale factor is the ratio of corresponding side lengths. If △ABC ~ △DEF with scale factor k, then AB/DE = BC/EF = AC/DF = k.",
  "Properties of Similar Polygons",
  "Corresponding angles are congruent.",
  "Corresponding sides are proportional.",
  "Ratio of perimeters = scale factor k.",
  "Ratio of areas = k².",
  "Example : If two similar rectangles have a scale factor of 3:5, and the smaller has perimeter 24, the larger has perimeter 24 × (5/3) = 40.",
  "Similar Triangles",
  "AA ( Angle - Angle ) Similarity",
  "If two angles of one Triangle are congruent to two angles of another Triangle , the triangles are similar .",
  "SSS (Side-Side-Side) Similarity",
  "If all three pairs of corresponding sides are proportional, the triangles are similar.",
  "SAS (Side- Angle -Side) Similarity",
  "If two pairs of corresponding sides are proportional and the included angles are congruent, the triangles are similar.",
  "Why AA Works",
  "If two angles are congruent, the third must also be congruent (since angles sum to 180°). Once all angles match, the sides are automatically proportional.",
  "Given two triangles with angles 40°, 60°, 80° and 40°, 60°, 80°: the triangles are similar by AA (two pairs of angles match).",
  "Parallel Lines and Proportional Parts",
  "Triangle Proportionality Theorem",
  "If a Line is parallel to one side of a Triangle and intersects the other two sides, then it divides those sides proportionally .",
  "If DE ∥ BC in △ABC, where D is on AB and E is on AC, then: AD/DB = AE/EC .",
  "Converse",
  "If a Line divides two sides of a Triangle proportionally, then it is parallel to the third side.",
  "Midsegment Theorem",
  "The segment connecting the midpoints of two sides of a Triangle is:",
  "Parallel to the third side.",
  "Half the length of the third side.",
  "Corollary: Three Parallel Lines",
  "If three or more parallel lines cut two transversals, they divide the transversals proportionally.",
  "Parts of Similar Triangles",
  "When two triangles are similar, ALL corresponding linear measurements are in the same ratio (the scale factor).",
  "Proportional Parts",
  "Corresponding altitudes are proportional.",
  "Corresponding medians are proportional.",
  "Corresponding Angle bisectors are proportional.",
  "Corresponding perimeters are proportional.",
  "Angle Bisector / Side Proportion",
  "An Angle bisector of a Triangle divides the opposite side in the ratio of the two adjacent sides:",
  "If BD bisects ∠B in △ABC, then AD/DC = AB/BC .",
  "All these linear ratios equal the scale factor k. Areas are in the ratio k².",
  "Similarity Transformations",
  "A similarity transformation maps a figure to a similar figure. It combines:",
  "A dilation (scaling by a factor k)",
  "Optionally: rigid motions (reflections, rotations, translations)",
  "Dilation",
  "A dilation centered at Point O with scale factor k maps every Point P to a Point P' such that OP' = k × OP.",
  "If k > 1: the image is an enlargement .",
  "If 0 < k < 1: the image is a reduction .",
  "If k = 1: the image is congruent to the original.",
  "Coordinate Rule for Dilation",
  "Dilation centered at the origin with scale factor k: (x, y) → (kx, ky)",
  "Dilations preserve Angle measures.",
  "Dilations preserve parallelism.",
  "Dilations multiply all lengths by k.",
  "Two figures are similar if and only if one can be mapped to the other by a similarity transformation.",
  "Scale Drawings and Models",
  "Scale Drawing",
  "A scale drawing is a proportional representation of an object. The scale is the ratio of the drawing size to the actual size.",
  "If a map has a scale of 1 cm : 50 km, then 1 cm on the map represents 50 km in reality. The scale factor is 1/5,000,000.",
  "Finding Actual Dimensions",
  "Set up a proportion using the scale:",
  "drawing measurement / actual measurement = scale",
  "Example : A blueprint has scale 1 in : 4 ft. A room measures 3.5 in on the blueprint. Actual length = 3.5 × 4 = 14 ft.",
  "Scale Models",
  "Three-dimensional versions of scale drawings. Same principles apply — all linear dimensions are scaled by the same factor.",
  "Fractals and Self-Similarity",
  "Self-Similarity",
  "A figure is self-similar if it can be divided into parts that are similar to the whole figure. Each part is a smaller copy of the entire shape.",
  "Fractals",
  "A fractal is a geometric figure that exhibits self-similarity at different scales. Fractals are created by repeating a process (iteration) infinitely.",
  "Famous Fractals",
  "Sierpinski Triangle : Start with a Triangle . Remove the middle Triangle formed by connecting midpoints. Repeat for each remaining Triangle .",
  "Koch Snowflake : Start with an Triangle \">Equilateral Triangle . Add a smaller Triangle \">Equilateral Triangle to the middle third of each side. Repeat.",
  "Mandelbrot Set : A complex fractal defined by iterating z → z² + c in the complex Plane .",
  "Fractal Dimension",
  "Fractals often have a non-integer dimension . The Sierpinski Triangle has dimension ≈ 1.585, meaning it is more than a Line (1D) but less than a filled region (2D).",
  "Fractals in Nature",
  "Coastlines, fern leaves, snowflakes, blood vessels, and mountain ranges all exhibit fractal-like self-similarity.",
  "Geometric Mean",
  "Definition",
  "The geometric mean of two positive numbers a and b is x = √(ab) . It is the positive number x such that a/x = x/b.",
  "Geometric Mean in Right Triangles",
  "When the altitude is drawn from the right Angle to the hypotenuse of a right Triangle , it creates two smaller triangles that are similar to each other and to the original Triangle .",
  "Three Key Relationships",
  "In right △ABC with altitude CD to hypotenuse AB (where D is the foot):",
  "Altitude rule : CD = √(AD × DB) — the altitude is the geometric mean of the two segments of the hypotenuse.",
  "Leg rule : AC = √(AB × AD) — each leg is the geometric mean of the hypotenuse and the adjacent segment.",
  "Leg rule : BC = √(AB × DB)",
  "The Pythagorean Theorem and Its Converse",
  "Pythagorean Theorem",
  "In a right Triangle with legs a and b and hypotenuse c:",
  "a² + b² = c²",
  "Finding a Missing Side",
  "Find hypotenuse: c = √(a² + b²)",
  "Find a leg: a = √(c² − b²)",
  "Pythagorean Triples",
  "Sets of three positive integers that satisfy a² + b² = c²:",
  "3, 4, 5 (and multiples: 6, 8, 10; 9, 12, 15...)",
  "5, 12, 13",
  "8, 15, 17",
  "7, 24, 25",
  "Converse of the Pythagorean Theorem",
  "If a² + b² = c²: the Triangle is right .",
  "If a² + b² > c²: the Triangle is acute .",
  "If a² + b² < c²: the Triangle is obtuse .",
  "Special Right Triangles",
  "45°-45°-90° Triangle",
  "An isosceles right Triangle . If each leg = a, then:",
  "Hypotenuse = a√2",
  "Leg = hypotenuse / √2 = hypotenuse × √2 / 2",
  "Ratio of sides: 1 : 1 : √2",
  "30°-60°-90° Triangle",
  "Half of an Triangle \">Equilateral Triangle . If the short leg (opposite 30°) = a, then:",
  "Long leg (opposite 60°) = a√3",
  "Hypotenuse (opposite 90°) = 2a",
  "Ratio of sides: 1 : √3 : 2",
  "Memory Tip",
  "45-45-90: Two equal legs, hypotenuse is leg × √2.",
  "30-60-90: Short leg × 2 = hypotenuse, short leg × √3 = long leg.",
  "Trigonometry",
  "Trigonometric Ratios",
  "For a right Triangle with an acute Angle θ:",
  "sin θ = opposite / hypotenuse",
  "cos θ = adjacent / hypotenuse",
  "tan θ = opposite / adjacent",
  "Memory aid: SOH-CAH-TOA",
  "Finding a Side",
  "If you know an Angle and one side, use the appropriate trig ratio to find unknown sides.",
  "Example: In a right Triangle with Angle 35° and hypotenuse 10:",
  "Opposite = 10 × sin 35° ≈ 5.74",
  "Adjacent = 10 × cos 35° ≈ 8.19",
  "Finding an Angle",
  "Use inverse trig functions: θ = sin⁻¹(opp/hyp), θ = cos⁻¹(adj/hyp), θ = tan⁻¹(opp/adj).",
  "Angles of Elevation and Depression",
  "Angle of Elevation",
  "The Angle formed from the horizontal upward to a Line of sight. You look UP from your position to an object above.",
  "Angle of Depression",
  "The Angle formed from the horizontal downward to a Line of sight. You look DOWN from your position to an object below.",
  "Key Relationship",
  "The Angle of elevation from Point A to Point B equals the Angle of depression from Point B to Point A (alternate interior angles).",
  "Solving Problems",
  "Draw a diagram with a right Triangle .",
  "Identify the Angle (elevation or depression).",
  "Label the known and unknown sides.",
  "Choose the trig ratio (sin, cos, or tan) that connects the known and unknown.",
  "Solve.",
  "Example : A person standing 50 m from a building looks up at the top with an Angle of elevation of 60°. Height = 50 × tan 60° = 50√3 ≈ 86.6 m.",
  "The Law of Sines and Cosines",
  "Law of Sines",
  "For any Triangle with sides a, b, c opposite angles A, B, C:",
  "a/sin A = b/sin B = c/sin C",
  "Use when you know: AAS, ASA, or SSA (two angles and a side, or two sides and an Angle opposite one of them).",
  "Law of Cosines",
  "For any Triangle :",
  "c² = a² + b² − 2ab cos C",
  "Use when you know: SAS or SSS (two sides and included Angle , or all three sides).",
  "When to Use Which",
  "Law of Sines : When you have Angle -side pairs (AAS, ASA, SSA).",
  "Law of Cosines : When you have SAS or SSS.",
  "Note: The Pythagorean Theorem is a special case of the Law of Cosines when C = 90°.",
  "Vectors",
  "What Is a Vector?",
  "A vector is a quantity that has both magnitude (size) and direction . Represented as an arrow or in component form <a, b>.",
  "Vector Notation",
  "Component form : <a, b> where a is the horizontal and b is the vertical component.",
  "Magnitude : |v| = √(a² + b²)",
  "Direction Angle : θ = tan⁻¹(b/a)",
  "Vector Operations",
  "Addition : <a₁, b₁> + <a₂, b₂> = <a₁+a₂, b₁+b₂>",
  "Scalar multiplication : k<a, b> = <ka, kb>",
  "Subtraction : <a₁, b₁> − <a₂, b₂> = <a₁−a₂, b₁−b₂>",
  "Resultant Vector",
  "The sum of two or more vectors is called the resultant . Geometrically, vectors are added tip-to-tail.",
  "Polar Coordinates and Complex Numbers",
  "Polar Coordinates",
  "A Point can be located by (r, θ) where r is the distance from the origin and θ is the Angle from the positive x-axis.",
  "Converting Between Systems",
  "Polar to Rectangular: x = r cos θ, y = r sin θ",
  "Rectangular to Polar: r = √(x² + y²), θ = tan⁻¹(y/x)",
  "Complex Numbers and the Complex Plane",
  "A complex number z = a + bi can be plotted on the complex Plane (a on the real axis, b on the imaginary axis).",
  "Modulus : |z| = √(a² + b²) (distance from origin)",
  "Argument : θ = tan⁻¹(b/a) ( Angle from positive real axis)",
  "Polar form : z = r(cos θ + i sin θ)",
  "Connection to Geometry",
  "Complex numbers provide an algebraic framework for transformations (rotation = multiplication by e^(iθ), dilation = multiplication by a scalar).",
  "This lesson covers the fundamental concepts of Reflections.",
  "This lesson covers the fundamental concepts of Translations.",
  "This lesson covers the fundamental concepts of Rotations.",
  "This lesson covers the fundamental concepts of Compositions of Transformations.",
  "This lesson covers the fundamental concepts of Symmetry.",
  "This lesson covers the fundamental concepts of Dilations.",
  "This lesson covers the fundamental concepts of Transformations in the Coordinate Plane ⭐."
]