{
  "total_unique_strings": 590,
  "strings": [
    "(n−2)×180°",
    "180°",
    "30-60-90: Short leg × 2 = hypotenuse, short leg × √3 = long leg.",
    "30°-60°-90° Triangle",
    "360°",
    "45-45-90: Two equal legs, hypotenuse is leg × √2.",
    "45°-45°-90° Triangle",
    "540°",
    "720°",
    "A Line is a straight path that extends infinitely in both directions. It has no thickness and contains infinitely many points. A Line is named by any two points on it (e.g., Line AB, written ←→ AB) or by a lowercase letter.",
    "A Line segment is a part of a Line bounded by two endpoints. Unlike a Line, a segment has a definite length. The length of segment AB is written as AB (without the bar above).",
    "A Linear Pair is a pair of adjacent angles whose non-common sides form a straight Line. Linear pairs are always supplementary (sum to 180°).",
    "A Plane is a flat surface that extends infinitely in all directions. It has length and width but no thickness. A Plane is named by three Non-Collinear points (e.g., Plane ABC) or by a capital letter.",
    "A Point can be located by (r, θ) where r is the distance from the origin and θ is the Angle from the positive x-axis.",
    "A Polygon is a closed figure formed by three or more Line segments (sides) that meet at their endpoints (vertices). Key properties:",
    "A Pythagorean triple is a set of three positive integers (a, b, c) such that a² + b² = c². Example: (3, 4, 5).",
    "A Triangle can have at most one right Angle or obtuse Angle.",
    "A biconditional statement (p ↔ q) means \"p if and only if q.\" It is true when both p and q have the same truth value.",
    "A biconditional statement combines a conditional and its converse. Written as p ↔ q (read \"p if and only if q\"), it is true only when both p → q and q → p are true.",
    "A complex number z = a + bi can be plotted on the complex Plane (a on the real axis, b on the imaginary axis).",
    "A conditional and its contrapositive always have the same truth value. The converse and inverse also share the same truth value (but may differ from the original).",
    "A conditional is false ONLY when the hypothesis is true and the conclusion is false.",
    "A conditional statement (or if-then statement) has two parts: the hypothesis (\"if\") and the conclusion (\"then\"). It is written in the form: If p, then q (p → q).",
    "A conditional statement has the form \"If p, then q\" (written p → q). The hypothesis is p and the conclusion is q.",
    "A cone has one circular base and a curved surface tapering to a point (apex).",
    "A conjecture is an unproven statement based on observations. A conjecture remains unproven until it is shown to be either true (via a proof) or false (via a counterexample).",
    "A coordinate proof uses the coordinate Plane to prove geometric properties using algebra. You place figures on a coordinate system and use distance, midpoint, and slope formulas.",
    "A counterexample is a single example that disproves a conjecture. You only need ONE counterexample to prove a conjecture is false.",
    "A cross section is the shape formed when a Plane intersects a solid figure.",
    "A cylinder has two congruent circular bases connected by a curved surface.",
    "A dilation (scaling by a factor k)",
    "A dilation centered at Point O with scale factor k maps every Point P to a Point P' such that OP' = k × OP.",
    "A dilation is a transformation that changes size but not shape. It has a center point and a scale factor k.",
    "A figure is self-similar if it can be divided into parts that are similar to the whole figure. Each part is a smaller copy of the entire shape.",
    "A flowchart proof uses boxes connected by arrows. Each box contains a statement, and the reason is written below it.",
    "A fractal is a geometric figure that exhibits self-similarity at different scales. Fractals are created by repeating a process (iteration) infinitely.",
    "A fractal is a geometric figure that has self-similarity — each part looks like the whole.",
    "A kite is a quadrilateral with two pairs of consecutive sides that are congruent (but opposite sides are not congruent).",
    "A median of a Triangle is a segment from a vertex to the midpoint of the opposite side.",
    "A midsegment of a Triangle is a segment connecting the midpoints of two sides.",
    "A paragraph proof (informal proof) presents a logical argument in paragraph form, where each statement is backed by a reason (definition, postulate, or theorem).",
    "A paragraph proof writes the proof as a logical paragraph, connecting statements with reasons in flowing sentences.",
    "A parallelogram is a quadrilateral with two pairs of parallel sides.",
    "A perpendicular bisector of a side of a Triangle is a Line, segment, or ray that is perpendicular to that side at its midpoint.",
    "A point in polar coordinates is given as (r, θ), where r is the distance from the origin and θ is the Angle from the positive x-axis.",
    "A polygon is a closed plane figure formed by three or more Line segments that intersect only at their endpoints.",
    "A polyhedron (plural: polyhedra) is a solid bounded by polygons called faces. The segments where faces meet are edges, and the points where edges meet are vertices.",
    "A polyhedron is a 3D solid bounded by flat polygonal surfaces.",
    "A postulate (axiom) is a statement accepted as true without proof. It is a foundational truth in geometry.",
    "A postulate is a statement accepted as true without proof. Postulates serve as the foundation for building theorems through logical reasoning.",
    "A prism has two congruent, parallel polygon bases connected by rectangular faces.",
    "A proportion is an equation that states two ratios are equal: a/b = c/d.",
    "A pyramid has one polygon base and triangular faces meeting at a common vertex (apex).",
    "A ratio compares two quantities. It can be written as a:b, a/b, or \"a to b\".",
    "A rectangle is a parallelogram with four right angles.",
    "A rectangle's diagonals are congruent.",
    "A regular Polygon is both equilateral (all sides congruent) and equiangular (all angles congruent).",
    "A regular Polygon with n sides has n lines of symmetry.",
    "A regular n-gon has rotational symmetry of order n. The smallest rotation Angle that maps it onto itself is 360°/n.",
    "A rhombus is a parallelogram with four congruent sides.",
    "A rhombus's diagonals are perpendicular.",
    "A scale drawing is a proportional representation of an object. The scale is the ratio of the drawing size to the actual size.",
    "A segment bisector is any segment, Line, or ray that passes through the midpoint of a segment, dividing it into two congruent halves.",
    "A similarity transformation maps a figure to a similar figure. It combines:",
    "A sphere is the set of all points in space that are equidistant from a central point.",
    "A square is a parallelogram that is both a rectangle and a rhombus. It has all the properties of both:",
    "A square is a parallelogram that is both a rectangle and a rhombus: it has four right angles and four congruent sides.",
    "A statement (or proposition) is a sentence that is either true (T) or false (F), but not both.",
    "A theorem is a statement that has been proven to be true using definitions, postulates, and previously proven theorems.",
    "A theorem is a statement that has been proven true using postulates, definitions, and previously proven theorems.",
    "A transformation that preserves distance and Angle measure is called a rigid motion or isometry. Rigid motions produce congruent figures.",
    "A transversal is a Line that intersects two or more coplanar Lines at different points. When a transversal crosses two lines, it creates 8 angles.",
    "A trapezoid has exactly one pair of parallel sides (called bases). The non-parallel sides are called legs.",
    "A trapezoid is a quadrilateral with exactly one pair of parallel sides (called bases). The non-parallel sides are called legs.",
    "A truth table shows all possible combinations of truth values for a compound statement. For two statements p and q, there are 4 possible combinations (TT, TF, FT, FF).",
    "A two-column proof lists statements in the left column and the corresponding reasons in the right column.",
    "A vector has both magnitude (size) and direction. It is represented by a directed arrow from its tail (initial point) to its head (terminal point).",
    "A vector is a quantity that has both magnitude (size) and direction. Represented as an arrow or in component form <a, b>.",
    "AA (Angle-Angle) Similarity",
    "AA (Angle-Angle) Similarity: If two angles of one Triangle are congruent to two angles of another, the triangles are similar.",
    "AAS (Angle-Angle-Side): Two angles and a non-included side of one Triangle are congruent to two angles and a non-included side of another.",
    "ASA (Angle-Side-Angle): Two angles and the included side of one Triangle are congruent to two angles and the included side of another.",
    "Acute Angle: An Angle measuring between 0° and 90°.",
    "Acute Triangle: All angles are less than 90°.",
    "Addition Property: If a = b, then a + c = b + c",
    "Addition Property: If a = b, then a + c = b + c.",
    "Addition: <a₁, b₁> + <a₂, b₂> = <a₁+a₂, b₁+b₂>",
    "Addition: ⟨a₁, b₁⟩ + ⟨a₂, b₂⟩ = ⟨a₁+a₂, b₁+b₂⟩.",
    "Adjacent = 10 × cos 35° ≈ 8.19",
    "Adjacent angles are two angles that share a common vertex and a common side but have no interior points in common.",
    "Align one side along the x-axis or y-axis.",
    "All corresponding angles are congruent.",
    "All corresponding sides are proportional.",
    "All four angles are 90°.",
    "All sides are congruent.",
    "All these linear ratios equal the scale factor k. Areas are in the ratio k².",
    "Alternate Exterior Angles Theorem: If two parallel lines are cut by a transversal, then alternate exterior angles are congruent.",
    "Alternate Exterior Angles: On opposite sides of the transversal, outside the Lines. If the Lines are parallel, they are congruent.",
    "Alternate Interior Angles Theorem: If two parallel lines are cut by a transversal, then alternate interior angles are congruent.",
    "Alternate Interior Angles: On opposite sides of the transversal, between the Lines. If the Lines are parallel, they are congruent.",
    "Alternate exterior angles: On opposite sides of the transversal, outside the lines. ∠1 and ∠8.",
    "Alternate interior angles: On opposite sides of the transversal, between the lines. ∠3 and ∠6.",
    "Alternation: If a/b = c/d, then a/c = b/d.",
    "Altitude rule: CD = √(AD × DB) — the altitude is the geometric mean of the two segments of the hypotenuse.",
    "Altitudes",
    "An Angle bisector is a ray that divides an Angle into two congruent angles.",
    "An Angle bisector of a Triangle divides the opposite side in the ratio of the two adjacent sides:",
    "An Angle is formed by two rays with a common endpoint called the vertex. The rays are called the sides of the Angle. Angles are measured in degrees (°).",
    "An Isosceles Triangle has a vertex Angle (between the congruent sides) and two base angles (which are congruent).",
    "An altitude of a Triangle is the perpendicular segment from a vertex to the Line containing the opposite side.",
    "An exterior Angle of a Triangle is equal to the sum of the two non-adjacent interior angles.",
    "An indirect proof (also called proof by contradiction) is a method where you assume the opposite of what you want to prove, then show that this assumption leads to a contradiction.",
    "An isosceles right Triangle. If each leg = a, then:",
    "An isosceles trapezoid has congruent legs, congruent base angles, and congruent diagonals.",
    "Angle Bisector / Side Proportion",
    "Angle Bisector Theorem: Any Point on the Angle bisector is equidistant from the two sides of the Angle.",
    "Angle Sum",
    "Angle bisectors",
    "Angle of depression: The Angle formed by a horizontal Line and the Line of sight downward to an object.",
    "Angle of elevation: The Angle formed by a horizontal Line and the Line of sight upward to an object.",
    "Angles of Elevation and Depression",
    "Applications in geometry.",
    "Area: The number of square units enclosed by a figure.",
    "Argument: θ = tan⁻¹(b/a) (Angle from positive real axis)",
    "Assume the opposite: Assume that the conclusion you want to prove is false (negate the conclusion).",
    "Balance Point (2:1 ratio)",
    "Base angles: The angles opposite the legs (always congruent).",
    "Base: The non-congruent side.",
    "Bisectors of Triangles",
    "Both pairs of opposite angles are congruent.",
    "Both pairs of opposite sides are congruent.",
    "CPCTC: Corresponding Parts of Congruent Triangles are Congruent — used after proving two triangles congruent.",
    "Check: 3 + 4 = 7 < 8. No, these cannot form a Triangle.",
    "Check: 5 + 7 = 12 > 10. ✓ Also 5 + 10 > 7 ✓ and 7 + 10 > 5 ✓. Yes.",
    "Choose the trig ratio (sin, cos, or tan) that connects the known and unknown.",
    "Classify shapes: Use distance to verify side lengths, slope to check parallel/perpendicular sides.",
    "Classifying Polygons by Sides",
    "Co-Interior (Same-Side Interior) Angles: Same side of the transversal, between the Lines. If the Lines are parallel, they are supplementary (add to 180°).",
    "Coastlines, fern leaves, snowflakes, blood vessels, and mountain ranges all exhibit fractal-like self-similarity.",
    "Complement Theorem: If the non-common sides of two adjacent angles form a right Angle, the angles are complementary.",
    "Complementary Angles: Two angles whose measures add up to 90°.",
    "Complex Numbers and the Complex Plane",
    "Complex numbers provide an algebraic framework for transformations (rotation = multiplication by e^(iθ), dilation = multiplication by a scalar).",
    "Component form: <a, b> where a is the horizontal and b is the vertical component.",
    "Component form: ⟨a, b⟩ where a = horizontal change and b = vertical change.",
    "Compound Statements",
    "Concave Polygon: At least one interior Angle is greater than 180°.",
    "Concave polygon: At least one interior Angle is greater than 180°.",
    "Conclude with what you set out to prove.",
    "Conclude: Since the assumption leads to a contradiction, the original statement must be true.",
    "Conditional Statement",
    "Cone: One circular base tapering to a Point (apex).",
    "Congruent Complements Theorem: If two angles are complementary to the same Angle (or congruent angles), they are congruent.",
    "Congruent Supplements Theorem: If two angles are supplementary to the same Angle (or congruent angles), they are congruent.",
    "Congruent Triangles",
    "Congruent angles have the same measure. The symbol ≅ means 'is congruent to.'",
    "Conjunction (AND): p ∧ q → true only when both p and q are true.",
    "Conjunction (p ∧ q): \"p AND q\" — true only when BOTH p and q are true.",
    "Consecutive Interior Angles Theorem: If two parallel lines are cut by a transversal, then consecutive interior angles are supplementary (sum to 180°).",
    "Consecutive angles are supplementary (add to 180°).",
    "Contrapositive: If not q, then not p (~q → ~p) — swap AND negate.",
    "Contrapositive: ~q → ~p (Swap AND negate both parts — always has the same truth value as the original)",
    "Converse of Alternate Exterior Angles Theorem: If alternate exterior angles are congruent, then the lines are parallel.",
    "Converse of Alternate Interior Angles Theorem: If alternate interior angles are congruent, then the lines are parallel.",
    "Converse of Consecutive Interior Angles Theorem: If consecutive interior angles are supplementary, then the lines are parallel.",
    "Converse of Corresponding Angles Postulate: If corresponding angles are congruent, then the lines are parallel.",
    "Converse of the Pythagorean Theorem",
    "Converse: If a Point is equidistant from the endpoints of a segment, then it lies on the perpendicular bisector.",
    "Converse: If q, then p (q → p) — swap hypothesis and conclusion.",
    "Converse: If two angles of a Triangle are congruent, then the sides opposite those angles are congruent.",
    "Converse: q → p (Swap hypothesis and conclusion)",
    "Converting Between Systems",
    "Converting polar to rectangular: x = r cos(θ), y = r sin(θ).",
    "Converting rectangular to polar: r = √(x² + y²), θ = tan⁻¹(y/x).",
    "Convex Polygon: All interior angles are less than 180°. Any Line segment connecting two interior points lies entirely inside.",
    "Convex polygon: All interior angles are less than 180°.",
    "Coordinate Rule for Dilation",
    "Corollary: Three Parallel Lines",
    "Corresponding Angle bisectors are proportional.",
    "Corresponding Angles Postulate: If two parallel lines are cut by a transversal, then corresponding angles are congruent.",
    "Corresponding Angles: Same position relative to the transversal (e.g., both upper-left). If the Lines are parallel, they are congruent.",
    "Corresponding altitudes are proportional.",
    "Corresponding angles: Same position at each intersection (e.g., both upper-left). ∠1 and ∠5.",
    "Corresponding medians are proportional.",
    "Corresponding perimeters are proportional.",
    "Cross-multiplication: If a/b = c/d, then ad = bc.",
    "Cross-multiply: ad = bc.",
    "Cylinder: Two congruent, parallel circular bases connected by a curved surface.",
    "Deductive reasoning uses facts, definitions, postulates, and theorems to reach a logical conclusion. Unlike inductive reasoning, deductive reasoning can actually prove that something is true.",
    "Deductive reasoning uses facts, rules, definitions, or properties to reach a logical conclusion. Unlike inductive reasoning, valid deductive reasoning guarantees a true conclusion if the premises are true.",
    "Diagonals are congruent.",
    "Diagonals are perpendicular.",
    "Diagonals bisect each other.",
    "Dilation centered at the origin with scale factor k: (x, y) → (kx, ky)",
    "Dilations multiply all lengths by k.",
    "Dilations preserve Angle measures.",
    "Dilations preserve angle measures and produce similar figures.",
    "Dilations preserve parallelism.",
    "Direction Angle: θ = tan⁻¹(b/a)",
    "Direction: θ = tan⁻¹(b/a).",
    "Disjunction (OR): p ∨ q → true when at least one of p or q is true.",
    "Disjunction (p ∨ q): \"p OR q\" — true when AT LEAST ONE of p or q is true.",
    "Distance Formula: d = √[(x₂−x₁)² + (y₂−y₁)²]",
    "Distributive Property: a(b + c) = ab + ac",
    "Distributive Property: a(b + c) = ab + ac.",
    "Division Property: If a = b and c ≠ 0, then a ÷ c = b ÷ c.",
    "Division Property: If a = b and c ≠ 0, then a/c = b/c",
    "Draw a diagram with a right Triangle.",
    "Each Angle of an Equilateral Triangle measures 60°.",
    "Each diagonal bisects a pair of opposite angles.",
    "Each diagonal of a rhombus bisects a pair of opposite angles.",
    "Each exterior Angle of a regular Polygon = 360° / n.",
    "Each exterior Angle of a regular n-gon = 360° / n.",
    "Each interior Angle of a regular n-gon = (n − 2) × 180° / n.",
    "Each side intersects exactly two other sides at their endpoints.",
    "Equiangular Triangle: All angles are congruent (each = 60°).",
    "Equiangular Triangle: All angles are equal (each is 60°).",
    "Equidistant from sides",
    "Equidistant from vertices",
    "Equilateral Triangle: 3 lines of symmetry",
    "Equilateral Triangle: All three sides are congruent.",
    "Every Equilateral Triangle is also equiangular (and vice versa).",
    "Exactly one pair of opposite angles are congruent (the angles between the non-congruent sides).",
    "Example 1: Can sides 3, 4, 8 form a Triangle?",
    "Example 2: Can sides 5, 7, 10 form a Triangle?",
    "Example: 2, 4, 6, 8, ... → Conjecture: the next number is 10.",
    "Example: A blueprint has scale 1 in : 4 ft. A room measures 3.5 in on the blueprint. Actual length = 3.5 × 4 = 14 ft.",
    "Example: A person standing 50 m from a building looks up at the top with an Angle of elevation of 60°. Height = 50 × tan 60° = 50√3 ≈ 86.6 m.",
    "Example: If a figure is a square, then it is a rectangle. Figure ABCD is a square. Therefore, ABCD is a rectangle.",
    "Example: If two sides are 5 and 11, then the third side must be between 11 − 5 = 6 and 5 + 11 = 16: 6 < c < 16.",
    "Example: If two similar rectangles have a scale factor of 3:5, and the smaller has perimeter 24, the larger has perimeter 24 × (5/3) = 40.",
    "Example: In a right Triangle with Angle 35° and hypotenuse 10:",
    "Example: In △ABC with AB = 5, BC = 8, AC = 6, the angles from smallest to largest are: ∠C < ∠B < ∠A (Angle opposite the shortest side is smallest).",
    "Find areas: Use coordinates to calculate areas of triangles and polygons.",
    "Find hypotenuse: c = √(a² + b²)",
    "Find the centroid: Average the coordinates: ((x₁+x₂+x₃)/3, (y₁+y₂+y₃)/3).",
    "Finding an Angle",
    "For a right Triangle with an acute Angle θ:",
    "For any Triangle with sides a, b, c opposite angles A, B, C:",
    "For any Triangle:",
    "For any convex polyhedron: V − E + F = 2, where V = vertices, E = edges, F = faces.",
    "Formed By",
    "Fractals and Self-Similarity",
    "Fractals often have a non-integer dimension. The Sierpinski Triangle has dimension ≈ 1.585, meaning it is more than a Line (1D) but less than a filled region (2D).",
    "Geometric Mean in Right Triangles",
    "Given slope and a Point → use Point-slope form.",
    "Given two points → find slope first, then use Point-slope form.",
    "Given two triangles with angles 40°, 60°, 80° and 40°, 60°, 80°: the triangles are similar by AA (two pairs of angles match).",
    "HL (Hypotenuse-Leg): In right triangles, the hypotenuse and one leg of one Triangle are congruent to those of another.",
    "Half of an Equilateral Triangle. If the short leg (opposite 30°) = a, then:",
    "Half the length of the third side.",
    "Heptagon: 7 sides",
    "Hexagon: 6 sides",
    "Hypotenuse (opposite 90°) = 2a",
    "Hypotenuse = a√2",
    "Identify the Angle (elevation or depression).",
    "If 0 < k < 1: the image is a reduction.",
    "If BD bisects ∠B in △ABC, then AD/DC = AB/BC.",
    "If DE ∥ BC in △ABC, where D is on AB and E is on AC, then: AD/DB = AE/EC.",
    "If Point D is in the interior of ∠ABC, then m∠ABD + m∠DBC = m∠ABC.",
    "If a Line divides two sides of a Triangle proportionally, then it is parallel to the third side.",
    "If a Line is parallel to one side of a Triangle and intersects the other two sides, it divides those sides proportionally (Triangle Proportionality Theorem).",
    "If a Line is parallel to one side of a Triangle and intersects the other two sides, then it divides those sides proportionally.",
    "If a map has a scale of 1 cm : 50 km, then 1 cm on the map represents 50 km in reality. The scale factor is 1/5,000,000.",
    "If a ray bisects an Angle of a Triangle, it divides the opposite side into segments proportional to the adjacent sides.",
    "If a/b = c/d, then ad = bc. This is the fundamental tool for solving proportions.",
    "If all three pairs of corresponding sides are proportional, the triangles are similar.",
    "If alternate interior angles are congruent, then the Lines are parallel.",
    "If a² + b² < c²: the Triangle is obtuse.",
    "If a² + b² = c², then the Triangle is a right Triangle.",
    "If a² + b² = c²: the Triangle is right.",
    "If a² + b² > c²: the Triangle is acute.",
    "If corresponding angles are congruent, then the Lines are parallel.",
    "If c² < a² + b², the Triangle is acute. If c² > a² + b², the Triangle is obtuse.",
    "If k = 1: the image is congruent to the original.",
    "If k > 1: enlargement. If 0 < k < 1: reduction.",
    "If k > 1: the image is an enlargement.",
    "If one Angle of a Triangle is larger than another Angle, then the side opposite the larger Angle is longer than the side opposite the smaller Angle.",
    "If one Angle of a Triangle is larger than another, the side opposite the larger Angle is longer.",
    "If one side of a Triangle is longer than another, the Angle opposite the longer side is larger.",
    "If p → q is true and p is true, then q must be true.",
    "If p → q is true and q → r is true, then p → r is true.",
    "If same-side interior angles are supplementary, then the Lines are parallel.",
    "If three or more parallel Lines are cut by two transversals, the transversals are divided proportionally.",
    "If three or more parallel lines cut two transversals, they divide the transversals proportionally.",
    "If three sides of one Triangle are congruent to three sides of another Triangle, the triangles are congruent.",
    "If two Lines are parallel, then all points on one Line are equidistant from the other Line.",
    "If two angles and a non-included side of one Triangle are congruent to the corresponding parts of another Triangle, the triangles are congruent.",
    "If two angles and the included side of one Triangle are congruent to two angles and the included side of another Triangle, the triangles are congruent.",
    "If two angles are congruent, the third must also be congruent (since angles sum to 180°). Once all angles match, the sides are automatically proportional.",
    "If two angles of one Triangle are congruent to two angles of another Triangle, the triangles are similar.",
    "If two angles of one Triangle are congruent to two angles of another Triangle, then the third angles are also congruent.",
    "If two lines are perpendicular to the same Line, they are parallel.",
    "If two pairs of corresponding sides are proportional and the included angles are congruent, the triangles are similar.",
    "If two parallel Lines are cut by a transversal, then alternate interior angles are congruent.",
    "If two parallel Lines are cut by a transversal, then corresponding angles are congruent.",
    "If two parallel Lines are cut by a transversal, then same-side interior angles are supplementary.",
    "If two planes intersect, then their intersection is a Line.",
    "If two points lie in a Plane, then the entire Line containing those points lies in that Plane.",
    "If two sides and the included Angle of one Triangle are congruent to two sides and the included Angle of another Triangle, the triangles are congruent.",
    "If two sides of one Triangle are congruent to two sides of another Triangle and the included Angle of the first is larger than the included Angle of the second, then the third side of the first Triangle is longer than the third side of the second Triangle.",
    "If you know an Angle and one side, use the appropriate trig ratio to find unknown sides.",
    "In a 30°-60°-90° Triangle: Short leg (opposite 30°), Long leg = short leg × √3, Hypotenuse = short leg × 2.",
    "In a 45°-45°-90° Triangle: Legs are congruent. Hypotenuse = leg × √2.",
    "In a right Triangle with legs a and b and hypotenuse c:",
    "In a right Triangle, the circumcenter is on the hypotenuse (its midpoint).",
    "In a right Triangle, the circumcenter is on the hypotenuse.",
    "In a right Triangle, the orthocenter is at the right-Angle vertex.",
    "In a right Triangle, the orthocenter is at the vertex of the right Angle.",
    "In a right Triangle, the square of the hypotenuse equals the sum of the squares of the two legs: a² + b² = c².",
    "In an acute Triangle, the circumcenter is inside the Triangle.",
    "In an acute Triangle, the orthocenter is inside the Triangle.",
    "In an acute Triangle, the orthocenter is inside.",
    "In an indirect proof (proof by contradiction), you assume the opposite of what you want to prove, then show that assumption leads to a contradiction.",
    "In an obtuse Triangle, the circumcenter is outside the Triangle.",
    "In an obtuse Triangle, the orthocenter is outside the Triangle.",
    "In an obtuse Triangle, the orthocenter is outside.",
    "In any Triangle, you can order the sides from shortest to longest and the angles from smallest to largest — these orderings match:",
    "In right △ABC with altitude CD to hypotenuse AB (where D is the foot):",
    "Inductive reasoning does NOT prove something is true — it only suggests it might be.",
    "Inductive reasoning uses patterns and observations to form a general conclusion called a conjecture. You look at specific cases and make an educated guess about what is always true.",
    "Inverse: If not p, then not q (~p → ~q) — negate both.",
    "Inverse: ~p → ~q (Negate both parts)",
    "Isosceles Triangle Theorem: If two sides of a Triangle are congruent, then the angles opposite those sides are congruent (base angles are equal).",
    "Isosceles Triangle: At least two sides are congruent.",
    "Isosceles trapezoid: Legs are congruent. Base angles are congruent. Diagonals are congruent.",
    "Iteration: Repeatedly applying a process to its own result.",
    "Key Concepts: Analytic Geometry Applications ⭐",
    "Key Concepts: Deductive Reasoning ⭐",
    "Key Concepts: Logic ⭐",
    "Key Concepts: Proofs in Coordinate Geometry ⭐",
    "Key Concepts: Triangles and Coordinate Proof ⭐",
    "Kite",
    "Koch Snowflake: Start with an Equilateral Triangle. Add a smaller Equilateral Triangle to the middle third of each side. Repeat.",
    "Law of Cosines: When you have SAS or SSS.",
    "Law of Detachment: If p → q is true, and p is true, then q must be true.",
    "Law of Sines: When you have Angle-side pairs (AAS, ASA, SSA).",
    "Law of Syllogism: If p → q and q → r, then p → r.",
    "Left column: Statements (what is true)",
    "Leg = hypotenuse / √2 = hypotenuse × √2 / 2",
    "Leg rule: AC = √(AB × AD) — each leg is the geometric mean of the hypotenuse and the adjacent segment.",
    "Leg rule: BC = √(AB × DB)",
    "Legs: The two congruent sides.",
    "Line",
    "Long leg (opposite 60°) = a√3",
    "Look for shared sides (Reflexive Property) or Vertical Angles.",
    "Magnitude: |v| = √(a² + b²)",
    "Magnitude: |v| = √(a² + b²).",
    "Mandelbrot Set: A complex fractal defined by iterating z → z² + c in the complex Plane.",
    "Medians",
    "Midpoint Formula: M = ((x₁+x₂)/2, (y₁+y₂)/2)",
    "Midpoint Theorem: If M is the midpoint of AB, then AM ≅ MB.",
    "Midsegment Theorem",
    "Midsegment of a trapezoid: The segment connecting the midpoints of the legs. Its length = (b₁ + b₂) / 2.",
    "Modulus: |z| = √(a² + b²) (distance from origin)",
    "Multiples of Pythagorean triples are also Pythagorean triples (e.g., (6, 8, 10)).",
    "Multiplication Property: If a = b, then a × c = b × c.",
    "Multiplication Property: If a = b, then ac = bc",
    "Negation: \"not p\" → changes the truth value. Written as ~p.",
    "Negative slope: Line falls from left to right.",
    "No two sides with a common endpoint are collinear.",
    "Nonagon: 9 sides | Decagon: 10 sides | Dodecagon: 12 sides",
    "Note: The Pythagorean Theorem is a special case of the Law of Cosines when C = 90°.",
    "Obtuse Angle: An Angle measuring between 90° and 180°.",
    "Obtuse Triangle: One Angle is greater than 90°.",
    "Octagon: 8 sides",
    "One pair of opposite sides is both parallel and congruent.",
    "Opposite = 10 × sin 35° ≈ 5.74",
    "Opposite angles are congruent.",
    "Opposite sides are congruent.",
    "Optionally: rigid motions (reflections, rotations, translations)",
    "Paragraph Proof",
    "Parallel Lines and Proportional Parts",
    "Parallel Lines → same slope (m₁ = m₂).",
    "Parallel lines: Same slope (m₁ = m₂).",
    "Parts of Similar Triangles",
    "Pentagon: 5 sides",
    "Perimeter: The sum of the lengths of all sides of a polygon.",
    "Perpendicular Bisector Theorem: Any Point on the perpendicular bisector of a segment is equidistant from the endpoints of the segment.",
    "Perpendicular Lines → slopes are negative reciprocals (m₁ × m₂ = −1).",
    "Perpendicular bisectors",
    "Perpendicular from vertex to opposite side",
    "Perpendicular lines: Slopes are negative reciprocals (m₁ × m₂ = −1).",
    "Place one vertex at the origin (0, 0).",
    "Place one vertex at the origin and one side along an axis to simplify calculations.",
    "Point B is between points A and C if A, B, and C are collinear and AB + BC = AC. This is called the Segment Addition Postulate.",
    "Point-Slope Form: y − y₁ = m(x − x₁)",
    "Polar Coordinates",
    "Polar Coordinates and Complex Numbers",
    "Polar form: z = r(cos θ + i sin θ)",
    "Polygons",
    "Positive slope: Line rises from left to right.",
    "Postulates (Axioms)",
    "Prism: Two congruent, parallel polygonal bases connected by rectangular faces. Named by the shape of the base (triangular Prism, rectangular Prism, etc.).",
    "Property",
    "Proportional Parts",
    "Prove a Triangle is isosceles: Show two sides have equal length using the Distance Formula.",
    "Prove a Triangle is right: Show two sides have perpendicular slopes (product = −1).",
    "Prove properties: Show a Quadrilateral is a parallelogram by proving opposite sides have equal slopes.",
    "Prove: A Triangle cannot have two obtuse angles.",
    "Pyramid: One polygonal base with triangular faces meeting at a single Point (apex).",
    "Quadrilateral: 4 sides",
    "Ratio of sides: 1 : 1 : √2",
    "Ratio of sides: 1 : √3 : 2",
    "Reach a contradiction: Show that the assumption leads to a statement that contradicts a known fact, a given, or a theorem.",
    "Reciprocal: If a/b = c/d, then b/a = d/c.",
    "Reflection: Flips a figure over a Line (Line of reflection). Each Point is the same distance from the Line on the opposite side.",
    "Reflexive Property: a = a",
    "Reflexive Property: a = a.",
    "Reflexive: AB ≅ AB",
    "Reflexive: ∠A ≅ ∠A",
    "Regular polygon: All sides and all angles are congruent.",
    "Right Angle Theorems: All right angles are congruent. Perpendicular lines form congruent adjacent angles.",
    "Right Angle: An Angle measuring exactly 90°.",
    "Right Triangle: One Angle is exactly 90°.",
    "Right column: Reasons (why it is true — definitions, postulates, theorems, properties)",
    "Rotation: Turns a figure around a fixed Point (center of rotation) by a given Angle.",
    "SAS (Side-Angle-Side) Similarity",
    "SAS (Side-Angle-Side) Similarity: If two sides are proportional and the included Angle is congruent, the triangles are similar.",
    "SAS (Side-Angle-Side): Two sides and the included Angle of one Triangle are congruent to two sides and the included Angle of another.",
    "SSS (Side-Side-Side) Similarity",
    "SSS (Side-Side-Side) Similarity: If corresponding sides of two triangles are proportional, the triangles are similar.",
    "SSS (Side-Side-Side): All three sides of one Triangle are congruent to three sides of another.",
    "Scalar multiplication: k<a, b> = <ka, kb>",
    "Scalar multiplication: k⟨a, b⟩ = ⟨ka, kb⟩.",
    "Scalene Triangle: No sides are congruent.",
    "Self-Similarity",
    "Set up a proportion using the scale:",
    "Show it is a parallelogram with congruent diagonals.",
    "Sides",
    "Sierpinski Triangle: Start with a Triangle. Remove the middle Triangle formed by connecting midpoints. Repeat for each remaining Triangle.",
    "Similarity Transformations",
    "Since ∠B > ∠E and the two pairs of sides are equal, the Hinge Theorem tells us AC > DF.",
    "Slope Formula: m = (y₂−y₁)/(x₂−x₁)",
    "Slope-Intercept Form: y = mx + b",
    "Special Right Triangles",
    "Sphere: The set of all points equidistant from a center Point.",
    "State what is given and what you need to prove.",
    "Statements and Truth Values",
    "Straight Angle: An Angle measuring exactly 180°.",
    "Substitution Property: If a = b, then a can replace b in any expression.",
    "Substitution Property: If a = b, then a may replace b in any expression",
    "Subtraction Property: If a = b, then a − c = b − c",
    "Subtraction Property: If a = b, then a − c = b − c.",
    "Subtraction: <a₁, b₁> − <a₂, b₂> = <a₁−a₂, b₁−b₂>",
    "Supplement Theorem: If two angles form a Linear Pair, they are supplementary.",
    "Supplementary Angles: Two angles whose measures add up to 180°.",
    "Symmetric Property: If a = b, then b = a",
    "Symmetric Property: If a = b, then b = a.",
    "Symmetric: If AB ≅ CD, then CD ≅ AB",
    "Symmetric: If ∠A ≅ ∠B, then ∠B ≅ ∠A",
    "The Angle formed from the horizontal downward to a Line of sight. You look DOWN from your position to an object below.",
    "The Angle formed from the horizontal upward to a Line of sight. You look UP from your position to an object above.",
    "The Angle of elevation from Point A to Point B equals the Angle of depression from Point B to Point A (alternate interior angles).",
    "The Hinge Theorem (SAS Inequality): If two sides of one Triangle are congruent to two sides of another, then the Triangle with the larger included Angle has the longer third side.",
    "The Law of Cosines: c² = a² + b² − 2ab cos(C). Used when you know SAS or SSS.",
    "The Law of Sines: a/sin(A) = b/sin(B) = c/sin(C). Used when you know AAS, ASA, or an ambiguous SSA case.",
    "The Pythagorean Theorem and Its Converse",
    "The Sierpinski Triangle and Koch Snowflake are classic examples of fractals.",
    "The centroid divides each median in a 2:1 ratio from vertex to midpoint.",
    "The centroid is always inside the Triangle.",
    "The centroid is the center of gravity (balance Point) of the Triangle.",
    "The diagonals are perpendicular.",
    "The diagonals bisect each other.",
    "The diagonals of a kite are perpendicular.",
    "The distance from a Point to a Line is measured along the perpendicular segment from the Point to the Line. This is the shortest distance.",
    "The distance from a point to a Line is the length of the perpendicular segment from the point to the Line. This is the shortest distance.",
    "The geometric mean of two positive numbers a and b is x = √(ab). It is the positive number x such that a/x = x/b.",
    "The incenter is always inside the Triangle.",
    "The incenter is equidistant from all three sides of the Triangle.",
    "The midsegment (median) of a trapezoid is parallel to the bases and its length is the average of the two bases.",
    "The midsegment is parallel to the third side and half its length.",
    "The mnemonic SOH-CAH-TOA helps remember these definitions.",
    "The negation of a statement p (written ~p or ¬p) has the opposite truth value. If p is true, then ~p is false, and vice versa.",
    "The perimeter of a Polygon is the sum of the lengths of its sides.",
    "The pre-image and image are always congruent.",
    "The ratio of areas of two similar figures = k² (square of the scale factor).",
    "The ratio of perimeters of two similar figures = k (the scale factor).",
    "The segment connecting the midpoints of two sides of a Triangle is:",
    "The slope of a Line measures its steepness and direction: m = (y₂ − y₁) / (x₂ − x₁).",
    "The sum of the exterior angles of any convex Polygon (one at each vertex) is always 360°, regardless of the number of sides.",
    "The sum of the exterior angles of any convex polygon is always 360°.",
    "The sum of the interior angles of a polygon with n sides is (n − 2) × 180°.",
    "The sum of the lengths of any two sides of a Triangle must be greater than the length of the third side.",
    "The sum of the measures of the interior angles of a Triangle is 180°.",
    "The sum of two or more vectors is called the resultant. Geometrically, vectors are added tip-to-tail.",
    "The three Angle bisectors of a Triangle are concurrent. This Point is called the incenter.",
    "The three altitudes are concurrent at the orthocenter.",
    "The three altitudes of a Triangle are concurrent at the orthocenter.",
    "The three medians are concurrent at the centroid.",
    "The three medians of a Triangle are concurrent at the centroid.",
    "The three perpendicular bisectors of a Triangle are concurrent (meet at one Point). This Point is called the circumcenter.",
    "Theorems",
    "These algebraic properties are used to justify steps in proofs:",
    "This formula comes from the Pythagorean Theorem.",
    "This lesson covers the fundamental concepts of Arcs and Chords.",
    "This lesson covers the fundamental concepts of Areas of Circles and Sectors.",
    "This lesson covers the fundamental concepts of Areas of Parallelograms and Triangles.",
    "This lesson covers the fundamental concepts of Areas of Regular Polygons and Composite Figures.",
    "This lesson covers the fundamental concepts of Areas of Similar Figures.",
    "This lesson covers the fundamental concepts of Areas of Trapezoids, Rhombi, and Kites.",
    "This lesson covers the fundamental concepts of Cavalieri's Principle and Applications ⭐.",
    "This lesson covers the fundamental concepts of Circles and Circumference.",
    "This lesson covers the fundamental concepts of Compositions of Transformations.",
    "This lesson covers the fundamental concepts of Congruent and Similar Solids.",
    "This lesson covers the fundamental concepts of Conic Sections (intro) ⭐.",
    "This lesson covers the fundamental concepts of Coordinates in Three Dimensions.",
    "This lesson covers the fundamental concepts of Cross Sections.",
    "This lesson covers the fundamental concepts of Dilations.",
    "This lesson covers the fundamental concepts of Equations of Circles ⭐.",
    "This lesson covers the fundamental concepts of Equations of Circles.",
    "This lesson covers the fundamental concepts of Equations of Parabolas.",
    "This lesson covers the fundamental concepts of Geometric Probability.",
    "This lesson covers the fundamental concepts of Inscribed Angles.",
    "This lesson covers the fundamental concepts of Integration in Area Calculations ⭐.",
    "This lesson covers the fundamental concepts of Measuring Angles and Arcs.",
    "This lesson covers the fundamental concepts of Monte Carlo Methods in Geometry ⭐.",
    "This lesson covers the fundamental concepts of Permutations and Combinations.",
    "This lesson covers the fundamental concepts of Probabilities of Independent and Dependent Events.",
    "This lesson covers the fundamental concepts of Probabilities of Mutually Exclusive Events.",
    "This lesson covers the fundamental concepts of Probability and Counting.",
    "This lesson covers the fundamental concepts of Probability with Compound Events.",
    "This lesson covers the fundamental concepts of Probability with Permutations and Combinations.",
    "This lesson covers the fundamental concepts of Reflections.",
    "This lesson covers the fundamental concepts of Representations of Three-Dimensional Figures.",
    "This lesson covers the fundamental concepts of Representing Sample Spaces.",
    "This lesson covers the fundamental concepts of Rotations.",
    "This lesson covers the fundamental concepts of Secants, Tangents, and Angle Measures.",
    "This lesson covers the fundamental concepts of Similarity Transformations.",
    "This lesson covers the fundamental concepts of Simulations.",
    "This lesson covers the fundamental concepts of Special Segments in a Circle.",
    "This lesson covers the fundamental concepts of Spherical Geometry ⭐.",
    "This lesson covers the fundamental concepts of Surface Areas and Volumes of Spheres.",
    "This lesson covers the fundamental concepts of Surface Areas of Prisms and Cylinders.",
    "This lesson covers the fundamental concepts of Surface Areas of Pyramids and Cones.",
    "This lesson covers the fundamental concepts of Symmetry.",
    "This lesson covers the fundamental concepts of Tangent Lines.",
    "This lesson covers the fundamental concepts of Tangents.",
    "This lesson covers the fundamental concepts of Transformations in the Coordinate Plane ⭐.",
    "This lesson covers the fundamental concepts of Translations.",
    "This lesson covers the fundamental concepts of Volumes of Prisms and Cylinders.",
    "This lesson covers the fundamental concepts of Volumes of Pyramids and Cones.",
    "Three-dimensional versions of scale drawings. Same principles apply — all linear dimensions are scaled by the same factor.",
    "Through any three Non-Collinear points, there is exactly one Plane.",
    "Through any two points, there is exactly one Line.",
    "To check if three lengths can form a Triangle, verify all three inequalities. In practice, you only need to check that the sum of the two shortest sides is greater than the longest side.",
    "Transitive Property: If a = b and b = c, then a = c",
    "Transitive Property: If a = b and b = c, then a = c.",
    "Transitive: If AB ≅ CD and CD ≅ EF, then AB ≅ EF",
    "Transitive: If ∠A ≅ ∠B and ∠B ≅ ∠C, then ∠A ≅ ∠C",
    "Translation: Slides a figure in a given direction by a given distance. Every Point moves the same distance.",
    "Triangle Proportionality Theorem",
    "Triangle: 3 sides",
    "Trigonometric Ratios",
    "Two adjacent angles whose non-common sides form a straight Line (they add up to 180°).",
    "Two angles are complementary if the sum of their measures is 90°.",
    "Two angles are congruent if they have the same measure. Notation: ∠A ≅ ∠B.",
    "Two angles are supplementary if the sum of their measures is 180°.",
    "Two figures are similar if and only if one can be mapped to the other by a similarity transformation.",
    "Two lines are perpendicular (⊥) if they intersect to form right angles (90°).",
    "Two lines that are equidistant from a third line are parallel to each other.",
    "Two non-adjacent angles formed by two intersecting Lines. Vertical angles are always congruent.",
    "Undefined slope: Vertical Line (x values constant, division by zero).",
    "Use logical reasoning: Use definitions, theorems, and given information to reason from the assumption.",
    "Use when you know: AAS, ASA, or SSA (two angles and a side, or two sides and an Angle opposite one of them).",
    "Use when you know: SAS or SSS (two sides and included Angle, or all three sides).",
    "Vector Operations",
    "Verify geometric theorems: Place figures on a coordinate Plane and use algebra to confirm relationships.",
    "Vertex Angle: The Angle between the two legs.",
    "Vertical Angles Theorem: Vertical Angles are congruent.",
    "Vertical Angles are two non-adjacent angles formed by two intersecting lines. Vertical Angles are always congruent.",
    "What Is a Vector?",
    "When the altitude is drawn from the right Angle to the hypotenuse of a right Triangle, it creates two smaller triangles that are similar to each other and to the original Triangle.",
    "When the conclusion involves uniqueness (\"there is exactly one...\").",
    "When to Use Which",
    "When two triangles are similar, ALL corresponding linear measurements are in the same ratio (the scale factor).",
    "Write a series of statements, each justified by a reason.",
    "Zero slope: Horizontal Line (y values constant).",
    "cos θ = adjacent / hypotenuse",
    "cos(A) = adjacent / hypotenuse",
    "drawing measurement / actual measurement = scale",
    "missing_by_unit",
    "missing_strings",
    "n-gon",
    "sin θ = opposite / hypotenuse",
    "sin(A) = opposite / hypotenuse",
    "summary",
    "tan θ = opposite / adjacent",
    "tan(A) = opposite / adjacent",
    "where m is the slope and (x₁, y₁) is a known Point on the Line."
  ],
  "string_count_by_source": {
    "geometry_summary_batch2.json": 308,
    "geometry_summary_new_translations.json": 279,
    "missing_geometry_summary_strings.json": 3
  }
}