[
  "1/16",
  "1/2",
  "1/4",
  "2:1",
  "3.011 × 10²³",
  "4.2 × 10⁻³",
  "5%  (5/100 × 100)",
  "5.6 × 10³",
  "6.022 × 10²³",
  "A liquid that does not dissolve in another (e.g., oil and water)",
  "A machine that speeds up charged particles for nuclear collisions",
  "A measure of disorder or randomness",
  "A measure of how much solute is dissolved in a given amount of solution",
  "A measure of the average kinetic energy of particles",
  "A method of converting units using conversion factors",
  "A method where ion charges become subscripts in the chemical formula",
  "A mixture with large particles that settle out over time",
  "A mixture with non-uniform composition; parts can be distinguished",
  "A mixture with tiny dispersed particles that do not settle",
  "A mixture with uniform composition throughout (a solution)",
  "A modified gas law that accounts for real gas behavior",
  "A negatively charged ion (gained electrons)",
  "A negatively charged particle orbiting the nucleus",
  "A neutral particle in the nucleus",
  "A neutron becomes a proton; an electron is emitted",
  "A neutron converts to a proton, emitting an electron",
  "A number in front of a formula that balances atoms",
  "A one- or two-letter abbreviation for an element",
  "A pH change from 3 to 1 is how much more acidic?",
  "A particle of electromagnetic radiation",
  "A physical blend of two or more components",
  "A positively charged ion (lost electrons)",
  "A positively charged particle in the nucleus",
  "A process that absorbs energy from the surroundings",
  "A process that releases energy to the surroundings",
  "A property that depends only on initial and final states, not the path",
  "A proton (H⁺) acceptor",
  "A proton (H⁺) donor",
  "A radioisotope used to track chemical processes in the body or environment",
  "A rapid reaction with oxygen producing heat and light",
  "A ratio equal to 1 that relates two units",
  "A reaction between an acid and a base producing salt and water",
  "A reaction that can go in both directions (⇌)",
  "A reaction where oxidation and reduction occur simultaneously",
  "A region where the probability of finding an electron is zero",
  "A region where there is high probability of finding an electron",
  "A repeating 3D pattern of alternating positive and negative ions",
  "A representation using symbols and numbers to show a compound's composition",
  "A saturated solution",
  "A sheet of paper or skin",
  "A simple calorimeter using insulated cups at constant pressure",
  "A solid solution of metals (e.g., brass = copper + zinc)",
  "A solution containing 1 mole of solute per liter",
  "A solution containing more solute than normally possible; it is unstable",
  "A solution holding the maximum amount of dissolved solute at a given temperature",
  "A solution that can still dissolve more solute",
  "A solution that resists changes in pH when small amounts of acid or base are added",
  "A solution where alcohol is the solvent",
  "A solution with a large amount of solute relative to solvent",
  "A solution with a precisely known concentration",
  "A solution with a small amount of solute relative to solvent",
  "A subdivision within an energy level (s, p, d, or f)",
  "A substance reacts with oxygen, releasing heat and light",
  "A substance that changes color based on pH",
  "A substance that conducts electricity when dissolved in water",
  "A substance that produces H⁺ ions in water",
  "A substance that slows down a reaction",
  "A substance that speeds up a reaction without being consumed",
  "A supersaturated solution",
  "A system at equilibrium shifts to relieve applied stress",
  "A technique to find the concentration of an acid or base",
  "A unit of amount equal to 6.022 × 10²³ particles",
  "A way to express numbers as a × 10ⁿ where 1 ≤ a < 10",
  "A weak acid and its conjugate base",
  "A weak base and its conjugate acid",
  "Absorbs heat from surroundings",
  "Accuracy of a measurement",
  "Acetic acid/sodium acetate (CH₃COOH/CH₃COONa)",
  "Acid + Base →",
  "Acidic",
  "Actual gases that deviate from ideal gas behavior",
  "Actual yield equals theoretical yield",
  "Add 273",
  "Add 273 (K = °C + 273)",
  "Add acid to water, never water to acid",
  "Add atomic masses of each element times their subscripts",
  "Add more solute or evaporate some solvent",
  "Adding solute lowers the freezing point of the solvent",
  "Adding solute raises the boiling point of the solvent",
  "After 1 half-life, what fraction remains?",
  "After 2 half-lives, what fraction remains?",
  "After 4 half-lives, what fraction remains?",
  "Ag (from Latin argentum)",
  "Alpha particles (stopped by paper)",
  "Aluminum foil or thin metal",
  "Aluminum oxide",
  "Al₂O₃",
  "Ammonia",
  "Amount of substance",
  "An acid consisting of hydrogen and one other nonmetal",
  "An acid containing hydrogen, oxygen, and another element",
  "An acid that completely dissociates in water",
  "An acid that only partially dissociates in water",
  "An atom that has gained or lost electrons",
  "An atom's ability to attract electrons in a bond",
  "An electron pair acceptor",
  "An electron pair donor",
  "An equation showing radioactive decay or nuclear reaction with balanced mass and atomic numbers",
  "An insoluble solid formed during a reaction",
  "An instrument that measures atmospheric pressure",
  "An instrument that measures gas pressure in a container",
  "An ionic compound formed from a neutralization reaction",
  "An isotope of carbon with 6 protons and 8 neutrons",
  "An unbalanced equation showing reactants and products",
  "An unsaturated solution",
  "An unstable isotope that undergoes radioactive decay",
  "Anion ends in -ide (e.g., chloride from HCl)",
  "Anion keeps polyatomic ion name (e.g., sulfate from H₂SO₄)",
  "Another name for homogeneous mixture?",
  "Are captive zeros significant?",
  "Are compounds pure substances?",
  "Are covalent compounds typically solid, liquid, or gas at room temperature?",
  "Are elements pure substances?",
  "Are forces between gas particles significant in KMT?",
  "Are ionic compounds brittle or flexible?",
  "Are leading zeros significant?",
  "Are metals generally hard or soft?",
  "Are noble gases monatomic or diatomic?",
  "Are non-zero digits always significant?",
  "Are transuranium elements natural or synthetic?",
  "As you go down a group, does metal reactivity increase or decrease?",
  "At constant pressure, V and T are directly proportional",
  "At constant temperature, P and V are inversely proportional",
  "At constant volume, P and T are directly proportional",
  "At equilibrium, do reactions stop?",
  "At high pressure and low temperature",
  "At high temperature and low pressure",
  "At which energy level do d orbitals start?",
  "At which energy level do f orbitals start?",
  "At which energy level do p orbitals start?",
  "Atoms have a small, dense, positive nucleus",
  "Atoms must share or transfer valence electrons",
  "Atoms of the same element with different numbers of neutrons",
  "Atoms tend to gain, lose, or share electrons to have 8 valence electrons",
  "Atoms tend to have 8 valence electrons for stability",
  "Au (from Latin aurum)",
  "Average kinetic energy",
  "Balance → moles → mole ratio → desired unit",
  "Balance: H₂ + O₂ → H₂O",
  "Balance: N₂ + H₂ → NH₃",
  "Basic",
  "Because ionic compounds are electrically neutral",
  "Because of their delocalized (free-moving) electrons",
  "Below 7",
  "Binary acids (no oxygen) use hydro-; oxyacids do not",
  "Boiling point elevation, freezing point depression, osmotic pressure",
  "Both are polar molecules",
  "Boyle's Law (P₁V₁ = P₂V₂)",
  "Boyle's, Charles', and Gay-Lussac's",
  "Brittle",
  "Burning with limited O₂, producing CO or soot",
  "Burning with plenty of O₂, producing CO₂ and H₂O",
  "By increasing atomic number",
  "C = m × c",
  "CH₂",
  "CH₂O",
  "CH₃COOH (acetic acid / vinegar)",
  "CO₂ is named using which naming system?",
  "Ca(OH)₂",
  "CaBr₂ (calcium bromide)",
  "CaCl₂",
  "CaF₂",
  "Calcium bromide",
  "Calculating quantities in reactions using balanced-equation mole ratios",
  "Can a molecular formula be the same as its empirical formula?",
  "Can a strong acid/strong base make a buffer?",
  "Can chemical changes usually be reversed?",
  "Can compounds be separated physically?",
  "Can gases be solvents?",
  "Can half-life be used to determine age of rocks?",
  "Can heterogeneous mixtures be filtered?",
  "Can measurements be precise but not accurate?",
  "Can mixtures be separated physically?",
  "Can oxidation occur without reduction?",
  "Can percent yield exceed 100%?",
  "Can physical changes usually be reversed?",
  "Can the parts of a homogeneous mixture be seen with the naked eye?",
  "Can you change subscripts to balance an equation?",
  "Cannot know both exact position and momentum of an electron simultaneously",
  "Capitalized",
  "Carbon dioxide",
  "Carbon dioxide and water",
  "Carbon monoxide",
  "Carbon monoxide (CO)",
  "Carbonate",
  "Change in temperature (T_final − T_initial)",
  "Charles' Law (V₁/T₁ = V₂/T₂)",
  "Check if it contains a metal (ionic) or only nonmetals (covalent)",
  "Chemical bonds",
  "Chemical change",
  "Chemical property",
  "Clover-leaf (most d orbitals)",
  "Coefficients give the correct mole ratios",
  "Cold (it absorbs heat from surroundings)",
  "Collisions of gas particles with container walls",
  "Color and melting point",
  "Color change, Gas, Precipitate, or Heat change",
  "Color change, gas production, temperature change",
  "Colorless",
  "Combining two light nuclei into one heavier nucleus",
  "Combining two lighter nuclei to form a heavier one",
  "Common units include %, molarity (M), ppm, and ppb",
  "Constant, random, straight-line motion",
  "Convert 0.25 L to mL.",
  "Convert 2500 mL to liters.",
  "Convert 3.5 kg to grams.",
  "Convert 450 cm to meters.",
  "Convert 500 cal to joules.",
  "Convert 8368 J to calories.",
  "Convert both reactants to moles of product; smaller amount indicates the limiter",
  "Converting one element into another through nuclear reactions",
  "Copper(II) oxide",
  "Counting atoms, molecules, or ions in measurable amounts",
  "Covalent",
  "Covalent bond",
  "Covalent bonds",
  "Covalent bonds involve _____ of electrons.",
  "Covalent bonds occur between what types of elements?",
  "Covalent naming (with prefixes)",
  "Creating new elements by bombarding nuclei with particles",
  "Crystal lattice",
  "Cupric",
  "Cuprous",
  "CₙH₂ₙ₊₂",
  "Decrease — dilutes the solution",
  "Decreases by 2",
  "Decreases by 4",
  "Density, color, or boiling point",
  "Diatomic (Cl₂)",
  "Digits known with certainty plus one estimated digit",
  "Dinitrogen pentoxide",
  "Diphosphorus pentoxide",
  "Directly proportional",
  "Disorder increases",
  "Dissolve solute at high temperature, then slowly cool without disturbance",
  "Dissolved in water",
  "Divide by molar mass",
  "Divide coefficients, subtract exponents",
  "Divide grams by molar mass",
  "Divide particles by 6.022 × 10²³",
  "Do all reactions need activation energy?",
  "Do colligative properties depend on solute identity?",
  "Do covalent compounds dissolve well in water?",
  "Do covalent compounds use prefixes in their names?",
  "Do gas particles have significant volume in KMT?",
  "Do ideal gas particles attract each other?",
  "Do ideal gas particles have volume?",
  "Do inner electrons or valence electrons cause shielding?",
  "Do ionic compounds have high or low melting points?",
  "Do ionic compounds use prefixes in their names?",
  "Do isotopes have the same chemical properties?",
  "Do metallic bonds involve transfer, sharing, or pooling of electrons?",
  "Do orbitals get larger at higher energy levels?",
  "Do real gases perfectly follow PV = nRT?",
  "Do we use prefixes for ionic compound names?",
  "Do we use prefixes for ionic or covalent compound names?",
  "Does Boyle's Law apply if temperature changes?",
  "Does a catalyst affect equilibrium position?",
  "Does a catalyst change the overall energy released?",
  "Does a larger object have higher or lower heat capacity?",
  "Does adding more solvent increase or decrease concentration?",
  "Does an endothermic process feel warm or cold?",
  "Does an exothermic process feel warm or cold?",
  "Does color change with sample size?",
  "Does crushing a solute change solubility?",
  "Does dilution change the solute?",
  "Does food irradiation make food radioactive?",
  "Does gamma decay change atomic or mass number?",
  "Does heat flow from hot to cold or cold to hot?",
  "Does length change with sample size?",
  "Does pressure increase with more gas particles?",
  "Does stirring change solubility?",
  "Does strong/weak refer to concentration?",
  "Does temperature affect solubility of gases?",
  "Does temperature affect solubility of solids?",
  "Does temperature change during a phase change?",
  "Does temperature increase as particle motion increases?",
  "Does the limiting reagent always have fewer grams?",
  "Double replacement",
  "Downward — gases are less soluble at higher temperatures",
  "Dull, brittle, poor conductors",
  "Dumbbell (figure-eight)",
  "E = hν (energy = Planck's constant × frequency)",
  "E = mc² — mass is converted to energy",
  "Each orbital holds a maximum of 2 electrons with opposite spins",
  "Electrons (gained or lost)",
  "Electrons fill orbitals from lowest to highest energy",
  "Electrons fill orbitals singly before pairing in the same sublevel",
  "Electrons fill the lowest energy sublevel first",
  "Electrons orbit in fixed energy levels",
  "Elements with atomic numbers greater than 92",
  "Elements with properties of both metals and nonmetals",
  "Emission of a helium-4 nucleus (2 protons + 2 neutrons)",
  "Emission of a helium-4 nucleus (2 protons, 2 neutrons)",
  "Emission of high-energy electromagnetic radiation",
  "Empty space (electron cloud region)",
  "Endothermic reaction — heat is absorbed",
  "Endothermic reaction: Temp increases or decreases?",
  "Energy cannot be created or destroyed, only transformed",
  "Energy level 2",
  "Energy level 3",
  "Energy level 4",
  "Energy released when an atom gains an electron",
  "Energy transferred due to a temperature difference",
  "Enthalpy change (ΔH)",
  "Equal numbers of each atom type on both sides",
  "Equilibrium shifts toward products",
  "Equilibrium shifts toward products (to make more)",
  "Excess solute rapidly crystallizes out",
  "Exothermic (releases energy)",
  "Exothermic reaction — heat is released",
  "Exothermic reaction: Temp increases or decreases?",
  "Extensive (depends on amount/mass)",
  "Fe (from Latin ferrum)",
  "Ferric",
  "Ferrous",
  "Fission of U-235 heats water → steam → drives turbines",
  "Flammability and reactivity",
  "Float",
  "Follows KMT perfectly — no intermolecular forces, negligible volume",
  "For gases at STP, mole ratios equal what?",
  "Force per unit area from gas particles hitting container walls",
  "Formula for molarity?",
  "Formula for pOH?",
  "Formula for percent concentration by mass?",
  "Formula used in calorimetry?",
  "Formula using heat capacity?",
  "Francium (bottom-left of periodic table)",
  "Free electrons transfer kinetic energy quickly",
  "Friction (heat)",
  "Fuel, oxygen, and an ignition source (fire triangle)",
  "Full outer shells — no need to bond",
  "Gamma radiation",
  "Gamma rays",
  "Gas solubility is directly proportional to pressure above the liquid",
  "Gases dissolve less at higher temperatures",
  "Gay-Lussac's Law (P₁/T₁ = P₂/T₂)",
  "Give a real-life example of Boyle's Law.",
  "Give a real-life example of Charles' Law.",
  "Give a real-life example.",
  "Give an example of a binary acid.",
  "Give an example of a buffer system in the body.",
  "Give an example of a heterogeneous mixture.",
  "Give an example of a homogeneous mixture.",
  "Give an example of a metalloid.",
  "Give an example of a monatomic gas.",
  "Give an example of a weak acid.",
  "Give an example of a weak base.",
  "Give an example of an extensive property.",
  "Give an example of an intensive property.",
  "Give an example of an oxyacid.",
  "Give two examples of chemical properties.",
  "Give two examples of physical properties.",
  "Glenn Seaborg and team",
  "Graduated glass tube used to precisely add titrant",
  "Gram (g)",
  "Grams → moles → mole ratio → moles → grams",
  "Greater surface area → faster rate",
  "Group 1 (alkali metals)",
  "HCl (hydrochloric acid), HBr (hydrobromic acid)",
  "HCl + NaOH → ?",
  "HCl, HNO₃, H₂SO₄",
  "HClO₂ — chlorous acid",
  "HONClBrIF",
  "Half-life formula?",
  "He has weaker intermolecular forces and smaller size",
  "Heat capacity depends on total mass; specific heat is per gram",
  "Heat energy (in joules)",
  "Helium (He), Neon (Ne), or Argon (Ar)",
  "Helium (small, nonpolar, very weak forces)",
  "Hexa-",
  "High melting points",
  "High-energy EM radiation from the nucleus with no mass change",
  "Higher concentration of H⁺ ions (more acidic)",
  "Higher concentration of OH⁻ ions (more basic)",
  "Higher concentration → faster rate",
  "Higher temperature → faster rate",
  "Higher — more mass means more energy needed",
  "Horizontal rows",
  "Hot air balloon — heating air makes it expand",
  "Hot to cold",
  "How are elements arranged on the periodic table?",
  "How are wavelength and frequency related?",
  "How can you identify a base by formula?",
  "How can you identify an acid by formula?",
  "How can you increase the concentration of a solution?",
  "How close a measurement is to the true value",
  "How close repeated measurements are to each other",
  "How do binary acids affect salt names?",
  "How do gas particles move according to KMT?",
  "How do gas solubility curves slope?",
  "How do isotopes differ?",
  "How do lone pairs affect bond angles?",
  "How do most solid solubility curves slope?",
  "How do nuclear power plants generate electricity?",
  "How do oxyacids affect salt names?",
  "How do we indicate multiple charges for transition metals?",
  "How do you calculate Zeff?",
  "How do you calculate atomic mass?",
  "How do you calculate heat capacity from specific heat?",
  "How do you calculate molar mass?",
  "How do you convert Celsius to Kelvin?",
  "How do you convert grams to moles?",
  "How do you convert moles to grams?",
  "How do you convert moles to liters at STP?",
  "How do you convert moles to particles?",
  "How do you convert particles to moles?",
  "How do you convert °C to K?",
  "How do you determine if a compound is ionic or covalent?",
  "How do you dilute an acid safely?",
  "How do you divide numbers in scientific notation?",
  "How do you find [H⁺] from pH?",
  "How do you find [OH⁻] from pOH?",
  "How do you find moles from molarity?",
  "How do you find the empirical formula from percent composition?",
  "How do you find the limiting reagent?",
  "How do you find the molecular formula from empirical?",
  "How do you find the number of neutrons?",
  "How do you find volume from molarity?",
  "How do you make a supersaturated solution?",
  "How do you multiply numbers in scientific notation?",
  "How do you name HCl as an acid?",
  "How do you name HNO₂?",
  "How do you name HNO₃?",
  "How do you name a binary acid?",
  "How do you solve for V₂?",
  "How do you use Hess\\'s Law with formation enthalpies?",
  "How does alpha decay change atomic number?",
  "How does beta decay change atomic number?",
  "How does concentration affect reaction rate?",
  "How does heat capacity differ from specific heat?",
  "How does increasing pressure affect equilibrium?",
  "How does increasing temperature affect an exothermic reaction at equilibrium?",
  "How does shielding affect atomic radius?",
  "How does shielding affect ionization energy?",
  "How does surface area affect reaction rate?",
  "How does temperature affect gas solubility?",
  "How does temperature affect reaction rate?",
  "How does temperature affect solid solubility?",
  "How is mass defect related to energy?",
  "How is radiation used in cancer treatment?",
  "How is the first letter of a symbol written?",
  "How is the second letter of a symbol written?",
  "How many atoms are in 1 mole of carbon?",
  "How many bonds can carbon form?",
  "How many calories in 1 kilocalorie?",
  "How many d orbitals are in a sublevel?",
  "How many electrons are shared in a double bond?",
  "How many electrons are shared in a single covalent bond?",
  "How many electrons are shared in a triple bond?",
  "How many electrons can one orbital hold?",
  "How many electrons can the 2p sublevel hold?",
  "How many electrons can the first energy level hold?",
  "How many electrons can the second energy level hold?",
  "How many grams in 1 kilogram?",
  "How many grams is 2 moles of NaCl (58.44 g/mol)?",
  "How many joules in 1 calorie?",
  "How many liters is 3 moles of gas at STP?",
  "How many meters in 1 kilometer?",
  "How many milligrams in 1 gram?",
  "How many millimeters in 1 meter?",
  "How many molecules are in 0.5 mol of H₂O?",
  "How many moles is 1.204 × 10²⁴ particles?",
  "How many moles is 44 g of CO₂ (44 g/mol)?",
  "How many orbitals does the d sublevel have?",
  "How many orbitals does the f sublevel have?",
  "How many orbitals does the p sublevel have?",
  "How many orbitals does the s sublevel have?",
  "How many orientations do d orbitals have?",
  "How many orientations do f orbitals have?",
  "How many orientations do p orbitals have?",
  "How many p orbitals are in a sublevel?",
  "How many sig figs in 0.0032?",
  "How many sig figs in 1.020?",
  "How many sig figs in 4500?",
  "How many strong acids should you memorize?",
  "How many valence electrons do alkali metals have?",
  "How many valence electrons do halogens have?",
  "How many valence electrons do noble gases have?",
  "How should you write oxygen in a chemical equation?",
  "How solubility changes with temperature",
  "How to find volume of irregular solid?",
  "Hydrochloric acid",
  "Hydrofluoric acid",
  "Hydrogen and helium are stable with 2 electrons",
  "Hydroiodic acid",
  "H⁺ (hydrogen ions)",
  "H₂ (needs 2 mol H₂ per 1 mol O₂)",
  "H₂, N₂, O₂, F₂, Cl₂, Br₂, I₂",
  "H₂, N₂, O₂, F₂, Cl₂, Br₂, I₂ (HONClBrIF)",
  "H₂CO₃/HCO₃⁻ (carbonic acid/bicarbonate) maintains blood pH at 7.4",
  "H₂SO₃ comes from sulfite — what is its acid name?",
  "H₂SO₄ (sulfuric acid), HNO₃ (nitric acid)",
  "H₂SO₄ + 2KOH → ?",
  "H₂SO₄ comes from sulfate — what is its acid name?",
  "H₃PO₄ — phosphoric acid",
  "If 2 mol H₂ and 2 mol O₂ react (2H₂ + O₂ → 2H₂O), which is limiting?",
  "If 5 g of salt is dissolved in 95 g of water, what is the percent concentration?",
  "If 58.5 g NaCl dissolves in 1 L, what is the molarity?",
  "If M₁ = 6 M and V₁ = 2 L, and V₂ = 12 L, what is M₂?",
  "If P increases, what happens to V?",
  "If P is constant, it simplifies to?",
  "If P₁ = 2 atm at T₁ = 300K, what is P₂ at T₂ = 600K?",
  "If T is constant, the Combined Law simplifies to?",
  "If V is constant, it simplifies to?",
  "If V₁ = 2L at T₁ = 300K, what is V₂ at T₂ = 600K?",
  "If V₁ = 4L at P₁ = 2 atm, what is V₂ at P₂ = 4 atm?",
  "If a polyatomic ion ends in -ate, how does the acid end?",
  "If a polyatomic ion ends in -ite, how does the acid end?",
  "If actual = 35g and theoretical = 50g, what is percent yield?",
  "If an atom has 11 protons and 10 electrons, what is its net charge?",
  "If hot metal is placed in cool water, what happens?",
  "If pH = 4, what is [H⁺]?",
  "If pH = 4, what is pOH?",
  "If q is negative, what does that mean?",
  "If temperature doubles, what happens to pressure?",
  "If temperature doubles, what happens to volume?",
  "If the accepted value is 10 and you measure 9.5, what is percent error?",
  "If the anion is chlorite (ClO₂⁻), what is the acid?",
  "If the anion is phosphate (PO₄³⁻), what is the acid?",
  "If you multiply a reaction by 2, what happens to ΔH?",
  "If you reverse a reaction, what happens to ΔH?",
  "Impurities or incomplete drying of the product",
  "In 2H₂ + O₂ → 2H₂O, how many moles of water from 3 mol H₂?",
  "In 2H₂ + O₂ → 2H₂O, what is the mole ratio of H₂ to O₂?",
  "In a neutral atom, what equals the number of protons?",
  "In an endothermic reaction, do products have more or less energy than reactants?",
  "In an exothermic reaction, do products have more or less energy than reactants?",
  "In energy levels (electron cloud) around the nucleus",
  "In probability clouds called orbitals",
  "In rusting, is iron oxidized or reduced?",
  "In stars through nuclear fusion",
  "In sugar water, what is the solute?",
  "In sugar water, what is the solvent?",
  "In the crisscross method, what becomes the subscript?",
  "In the modern model, where are electrons found?",
  "In the nucleus",
  "In traditional naming, '-ic' indicates what?",
  "In traditional naming, '-ous' indicates what?",
  "Increased shielding lets outer electrons spread farther",
  "Increases by 1",
  "Inner electrons",
  "Inner electrons block outer electrons from the full nuclear charge",
  "Intensive (does not depend on amount)",
  "Inversely — as one increases, the other decreases",
  "Ionic and covalent",
  "Ionic bond",
  "Ionic bonds involve _____ of electrons.",
  "Ionic bonds occur between what types of elements?",
  "Ionic naming (no prefixes)",
  "Iron(III) chloride",
  "Is ability to rust a physical or chemical property?",
  "Is air a pure substance or mixture?",
  "Is air homogeneous or heterogeneous?",
  "Is boiling water physical or chemical?",
  "Is burning a candle endo or exo?",
  "Is cellular respiration endo or exo?",
  "Is chlorine monatomic or diatomic?",
  "Is conducitivity intensive or extensive?",
  "Is cooking an egg endo or exo?",
  "Is density physical or chemical property?",
  "Is digesting food physical or chemical?",
  "Is dissolving sugar a physical or chemical change?",
  "Is energy absorbed or released during freezing?",
  "Is energy absorbed or released during melting?",
  "Is energy released or absorbed to break bonds?",
  "Is energy released or absorbed when bonds break?",
  "Is energy released or absorbed when bonds form?",
  "Is enthalpy a state function?",
  "Is freezing water endo or exo?",
  "Is gold (Au) a pure substance or mixture?",
  "Is half-life affected by temperature or pressure?",
  "Is heat capacity an intensive or extensive property?",
  "Is heat content (total energy) intensive or extensive?",
  "Is luster (shine) a physical or chemical property?",
  "Is melting ice endo or exo?",
  "Is milk a colloid or a solution?",
  "Is pH 12 acidic or basic?",
  "Is pH 2 acidic or basic?",
  "Is photosynthesis endo or exo?",
  "Is reactivity a physical or chemical property?",
  "Is rusting iron a physical or chemical change?",
  "Is salt water a pure substance or mixture?",
  "Is sea water saturated or unsaturated with NaCl?",
  "Is specific heat an intensive or extensive property?",
  "Is tarnishing silver physical or chemical?",
  "Is the pH at equivalence always 7?",
  "Is the pH scale linear or logarithmic?",
  "Is toxicity a physical or chemical property?",
  "Is water (H2O) a pure substance or mixture?",
  "It becomes negative (anion)",
  "It becomes positive (cation)",
  "It cancels out",
  "It decreases",
  "It decreases (more protons pull electrons closer)",
  "It determines how much product can be made",
  "It emits a photon of light",
  "It ends with OH (e.g., NaOH, KOH)",
  "It increases (more energy levels)",
  "It increases (more inner electron shells)",
  "It increases (more protons, same shielding)",
  "It increases surface area for more collisions",
  "It lets us calculate ΔH for reactions that are hard to measure directly",
  "It lowers the freezing point of water, melting the ice",
  "It measures the efficiency of a reaction",
  "It produces toxic carbon monoxide gas",
  "It provides a universal way to identify substances",
  "It requires extremely high temperatures and pressure",
  "It starts with H (e.g., HCl, H₂SO₄)",
  "Its high specific heat absorbs lots of energy without large temperature change",
  "Its specific heat is well-known (4.184 J/g°C)",
  "Its valence electrons",
  "J/(g·°C)",
  "J/°C",
  "Jacques Charles",
  "K (from Latin kalium)",
  "K (potassium has more inner electron shells)",
  "KNO₃ — its solubility increases dramatically with temperature",
  "Kelvin (K)",
  "Kg or g",
  "K₂S",
  "K₂SO₄ + 2H₂O",
  "Law of Conservation of Mass — atoms can't be created or destroyed",
  "Left side of the periodic table",
  "Less energy",
  "Liter (L)",
  "Logarithmic — each unit is a 10× change",
  "Lowercase",
  "Lowers activation energy without being consumed",
  "M = moles of solute ÷ volume of solution in liters",
  "Magnesium chloride",
  "Magnesium oxide",
  "Mass (in grams)",
  "Mass number minus atomic number",
  "Mass numbers and atomic numbers on both sides",
  "Mass, volume, or length",
  "Matter with fixed composition (Element or Compound)",
  "Metal and nonmetal",
  "Metal loses heat; water gains heat until thermal equilibrium",
  "Metals with other metals",
  "Meter (m)",
  "Methane (CH₄)",
  "Methane + Oxygen → Carbon Dioxide + Water",
  "MgCl₂",
  "Mixture that is not uniform throughout",
  "Mixture that is uniform throughout",
  "Molarity uses volume of solution; molality uses mass of solvent",
  "Moles of solute per liter of solution (mol/L)",
  "Monatomic",
  "More energy",
  "More shielding = larger radius",
  "More shielding = lower ionization energy",
  "Most are hard, but some (like sodium) are soft",
  "Most of an atom is made of what?",
  "Most solids dissolve more at higher temperatures",
  "Multiply by molar mass",
  "Multiply coefficients, add exponents",
  "Multiply empirical by n (molar mass ÷ empirical mass)",
  "Multiply moles × 22.4 L/mol",
  "Multiply moles × 6.022 × 10²³",
  "Multiply moles × molar mass",
  "M₁V₁ = M₂V₂",
  "NH₃ (ammonia)",
  "Na (from Latin natrium)",
  "NaCl",
  "NaCl + H₂O",
  "NaCl is named using which naming system?",
  "NaCl — it dissociates into 2 ions, doubling the particle count",
  "NaCl — its solubility changes very little with temperature",
  "NaNO₃ (sodium nitrate)",
  "NaOH (sodium hydroxide), KOH (potassium hydroxide)",
  "Name HI as an acid.",
  "Name H₂C₂O₄ (from oxalate).",
  "Name a common lab buffer.",
  "Name the seven diatomic elements.",
  "Name three colligative properties.",
  "Name three signs of a chemical change.",
  "Name three strong acids.",
  "Name two strong bases.",
  "Na₂O",
  "Na₃PO₄ (sodium phosphate)",
  "Negative ΔH (exothermic)",
  "Neptunium",
  "Neutrons released from fission trigger additional fission events",
  "Nitric acid (from nitrate → -ic acid)",
  "Nitrogen (N₂) at ~78%",
  "Nitrous acid (from nitrite → -ous acid)",
  "No (assumed negligible, but real particles do)",
  "No (but real gas particles do)",
  "No heat is lost to the surroundings",
  "No — buffers require a weak acid or weak base",
  "No — it depends on whether the acid/base is strong or weak",
  "No — it increases surface area and dissolving rate",
  "No — it is constant for each isotope",
  "No — it only adds solvent",
  "No — it only increases the rate of dissolving",
  "No — it refers to degree of dissociation",
  "No — only on the number of dissolved particles",
  "No, both forward and reverse reactions continue at equal rates",
  "No, color is an intensive property",
  "No, it depends on mole ratios, not mass",
  "No, it only changes the path (lower Ea)",
  "No, it only speeds up reaching equilibrium",
  "No, it remains constant",
  "No, most are irreversible",
  "No, never change subscripts",
  "No, only chemically",
  "No, temperature must be constant",
  "No, they always occur together",
  "No, they are assumed negligible",
  "No, they deviate at high P and low T",
  "No, volume is negligible compared to container",
  "Noble gases (Group 18)",
  "Non-bonding electron pairs on the central atom",
  "Nonmetal and nonmetal",
  "Not ideally; it suggests experimental error",
  "Nuclear fission (usually uranium-235)",
  "Nuclear fusion (hydrogen → helium)",
  "Number of half-lives elapsed (total time ÷ half-life)",
  "Numbers from counting or definitions with unlimited sig figs",
  "N₂ + 3H₂ → 2NH₃",
  "OH⁻ (hydroxide ions)",
  "OIL RIG — Oxidation Is Loss, Reduction Is Gain",
  "Objects less dense than fluid will...",
  "Oganesson (element 118)",
  "Oil is nonpolar and water is polar",
  "On the periodic table",
  "One compound breaks into simpler substances (AB → A + B)",
  "One element replaces another in a compound (A + BC → AC + B)",
  "One millionth (10⁻⁶) of the base unit",
  "Only the amount of gas (moles)",
  "Only when there is a decimal point",
  "Oxalic acid",
  "Oxidized (iron loses electrons)",
  "O₂ (diatomic), not O",
  "P=pressure, V=volume, n=moles, R=gas constant, T=temperature",
  "Particles are close; volume and forces become significant",
  "Particles must collide with enough energy and proper orientation to react",
  "Particles ↔ Moles ↔ Grams; Moles ↔ Liters (gas)",
  "Parts per million — mg of solute per liter of solution",
  "Penta-",
  "Perfectly elastic (no energy lost)",
  "Physical change",
  "Physical property",
  "Pink/magenta",
  "Polar solvents dissolve polar solutes; nonpolar solvents dissolve nonpolar solutes",
  "Pooling (delocalized sea of electrons)",
  "Positron Emission Tomography — uses radioactive tracers to image body processes",
  "Preparing solutions of exact molarity",
  "Pressure decreases, reducing CO₂ solubility, so gas escapes",
  "Pressure doubles",
  "Pressure increases with temperature in a fixed volume",
  "Pressure needed to prevent osmosis through a semipermeable membrane",
  "Prop-",
  "Properties that depend on the number of solute particles, not their identity",
  "Property that depends on amount of matter",
  "Property that does not depend on amount of matter",
  "Pure Substance",
  "P₁/T₁ = P₂/T₂",
  "P₁V₁ = P₂V₂",
  "P₁V₁/T₁ = P₂V₂/T₂",
  "Random errors in measurement",
  "Rate of dissolving equals rate of crystallization",
  "Ratio of moles between substances from balanced equation coefficients",
  "Reducing concentration by adding more solvent",
  "Regions around the nucleus where electrons orbit",
  "Releases heat to surroundings",
  "Remaining = Original × (1/2)^n",
  "Repeated dilution steps to achieve very low concentrations",
  "Right side of the periodic table",
  "Rigid (constant volume) containers",
  "Robert Boyle",
  "Roman numerals in parentheses",
  "Salt + Water",
  "Saltwater",
  "Sea of electrons — metal cations surrounded by delocalized electrons",
  "Shifts toward reactants",
  "Shifts toward the side with fewer gas moles",
  "Shiny, malleable, ductile, good conductors",
  "Side reactions, incomplete reactions, or transfer losses",
  "Sign of chemical change?",
  "Silicon or germanium",
  "Similar properties and same number of valence electrons",
  "Simplify them to the lowest whole-number ratio",
  "Single replacement",
  "Six: HCl, HBr, HI, HNO₃, H₂SO₄, HClO₄",
  "Slow particles; attractive forces have greater effect",
  "Sodium chloride",
  "Solubility (g solute per 100 g water)",
  "Solute particles reduce the number of solvent molecules that can evaporate",
  "Solve for n: PV = nRT → n = ?",
  "Some do, some don't — depends on polarity",
  "Some is left unreacted",
  "Specific heat capacity",
  "Spent fuel and contaminated materials from reactors; remains radioactive for thousands of years",
  "Splitting a heavy nucleus into two lighter nuclei",
  "Spontaneous emission of radiation from an unstable nucleus",
  "Squeezing a syringe — smaller volume, higher pressure",
  "Standard Temperature and Pressure (0°C, 1 atm)",
  "Standard unit for mass?",
  "Standard unit for volume (liquid)?",
  "Starting at which energy level do d orbitals appear?",
  "Starting at which energy level do p orbitals appear?",
  "State Boyle's Law.",
  "State Charles' Law.",
  "State Gay-Lussac's Law.",
  "Stock system (IUPAC)",
  "Stored energy based on position or composition",
  "Sugar",
  "Sulfuric acid",
  "Sulfurous acid",
  "Sum of (mass × percent abundance) for each isotope",
  "Sum of atomic masses for an ionic compound",
  "Sum of atomic masses of all atoms in a molecular formula",
  "Symbols and subscripts showing a compound's composition",
  "Synthesis (combination)",
  "Synthetic (made in labs)",
  "Systematic error (e.g., miscalibrated instrument)",
  "Targeted radiation kills cancer cells (radiation therapy)",
  "Temperature (°C)",
  "That the final answer has the correct units",
  "The ability of a substance to undergo a specific chemical change",
  "The ability to be hammered into thin sheets",
  "The ability to conduct heat or electricity",
  "The ability to do work or cause change",
  "The acid",
  "The actual number of each atom in a molecule",
  "The amount of acid or base a buffer can neutralize before pH changes",
  "The amount of product actually obtained from an experiment",
  "The arrangement of electrons in an atom's orbitals",
  "The base",
  "The charge number of the other ion",
  "The dense central core containing protons and neutrons",
  "The difference between expected and actual nuclear mass",
  "The distance between two consecutive wave peaks",
  "The distance from the nucleus to the outer electron cloud",
  "The electron",
  "The energy needed to raise 1 gram of a substance by 1°C",
  "The energy of motion",
  "The energy required to remove an electron",
  "The enthalpy change when 1 mole of a compound forms from its elements in standard states",
  "The filling order: 1s, 2s, 2p, 3s, 3p, 4s, 3d, 4p...",
  "The final volume after dilution",
  "The full range of EM radiation from radio waves to gamma rays",
  "The gold foil experiment",
  "The heat needed to raise the temperature of an entire object by 1°C",
  "The higher charge of a metal",
  "The initial molarity (concentration)",
  "The ion product of water: [H⁺][OH⁻] = 1.0 × 10⁻¹⁴",
  "The larger pool (higher heat capacity)",
  "The limiting reagent and stoichiometry",
  "The lower charge of a metal",
  "The mass of one mole of a substance in g/mol",
  "The maximum grams of solute that dissolve in 100 g of solvent at a given temperature",
  "The maximum product based on the limiting reagent",
  "The maximum product calculated from stoichiometry",
  "The measurement of heat changes in chemical or physical processes",
  "The metal",
  "The metal (cation)",
  "The minimum amount of fissile material needed to sustain a chain reaction",
  "The minimum energy needed for a successful collision",
  "The minimum energy required to start a chemical reaction",
  "The modern atomic model treating electrons as waves with probability regions",
  "The net positive charge felt by valence electrons",
  "The neutron-to-proton ratio",
  "The nonmetal",
  "The nucleus produced after decay",
  "The number in front (must be between 1 and 10)",
  "The number is large; decimal moves right",
  "The number is small; decimal moves left",
  "The number of electrons",
  "The number of energy levels (electron shells)",
  "The number of moles of solute",
  "The number of particles a solute produces when dissolved",
  "The number of protons in an atom",
  "The number of wave cycles per second (Hz)",
  "The original nucleus before decay",
  "The overall charge of an atom or ion (protons minus electrons)",
  "The percentage by mass of each element",
  "The percentage of each isotope found in nature",
  "The plum pudding model",
  "The quantum mechanical model",
  "The reactant consumed first, determining max product",
  "The reactant left over after the reaction",
  "The region around the nucleus where electrons are likely found",
  "The salt product",
  "The same number of protons (atomic number)",
  "The shiny appearance of metals due to electron interaction with light",
  "The sign flips (positive ↔ negative)",
  "The simplest whole-number ratio of atoms in a compound",
  "The smallest unit of an element retaining its chemical properties",
  "The solution of known concentration added from the burette",
  "The speed at which reactants become products",
  "The strong nuclear force",
  "The substance doing the dissolving, usually in larger amount",
  "The substance released heat (exothermic)",
  "The substance that gets oxidized (loses electrons)",
  "The substance that gets reduced (gains electrons)",
  "The substance that is dissolved in smaller amount",
  "The system of naming chemical compounds",
  "The time for half of a radioactive sample to decay",
  "The total heat content of a system",
  "The total kinetic energy of all particles in a substance",
  "The total number of protons plus neutrons",
  "The type of bond (ionic vs covalent)",
  "The unique pattern of light frequencies emitted by an element",
  "The unstable transition state at the peak of the energy barrier",
  "The weak acid neutralizes added base; the conjugate base neutralizes added acid",
  "The weighted average mass of all naturally occurring isotopes",
  "The zone where stable nuclei exist on a neutrons vs. protons graph",
  "They are identical in mass and properties",
  "They can be any state, but many are liquids or gases",
  "They compress (reduce) bond angles",
  "They easily lose their 1 valence electron",
  "They have different numbers of neutrons",
  "They need only 1 more electron to fill their outer shell",
  "Tire pressure increases on a hot day",
  "To achieve a stable electron configuration",
  "To show the subscript applies to the entire polyatomic ion",
  "To signal the endpoint by changing color",
  "Too many protons create strong repulsive forces",
  "Total positive = total negative (net charge is zero)",
  "Total protons + neutrons in an isotope",
  "Total ΔH is the same regardless of the pathway — it depends only on initial and final states",
  "Traditional (or classical) naming",
  "Trail mix or salad",
  "Trigonal planar",
  "Turns blue",
  "Two compounds swap ions (AB + CD → AD + CB)",
  "Two or more reactants combine to form one product (A + B → AB)",
  "Two pools of different sizes have the same water temperature. Which needs more energy to heat?",
  "Units for P and V",
  "Units of heat capacity?",
  "Units of specific heat?",
  "Universal indicator paper showing different colors for different pH values",
  "Unpredictable fluctuations in measurements",
  "Unsaturated — more salt can dissolve",
  "Upward — solubility increases with temperature",
  "Uranium-235",
  "Using C-14 decay to find the age of organic materials",
  "Using a noble gas symbol in brackets to abbreviate configuration",
  "Using crisscross, what is the formula for aluminum oxide (Al³⁺ and O²⁻)?",
  "Using crisscross, what is the formula for calcium chloride (Ca²⁺ and Cl⁻)?",
  "Using gamma rays to kill bacteria and extend shelf life",
  "Using ion charges as subscripts for the other ion",
  "Using mole ratios from balanced equations for calculations",
  "Using the half-life of C-14 (5730 years) to date organic materials",
  "V = moles ÷ M",
  "V decreases",
  "Vertical columns",
  "Volume doubles",
  "Volume ratios",
  "V₁/T₁ = V₂/T₂",
  "V₂ = P₁V₁T₂ / (T₁P₂)",
  "Warm (it releases heat to surroundings)",
  "What are energy levels?",
  "What are exact numbers?",
  "What are groups on the periodic table?",
  "What are lone pairs?",
  "What are metalloids?",
  "What are periods on the periodic table?",
  "What are properties of metals?",
  "What are properties of nonmetals?",
  "What are real gases?",
  "What are significant figures?",
  "What are the components of a basic buffer?",
  "What are the components of an acidic buffer?",
  "What are the diatomic elements?",
  "What are the four types of sublevels?",
  "What are the products of complete combustion?",
  "What are the steps in a stoichiometric calculation?",
  "What are the steps to balance an equation?",
  "What are the units of concentration?",
  "What are transuranium elements?",
  "What assumption is made in simple calorimetry?",
  "What axes do the three p orbitals align with?",
  "What causes low accuracy but high precision?",
  "What causes low precision?",
  "What color does litmus paper turn in acid?",
  "What color is phenolphthalein in acid?",
  "What color is phenolphthalein in base?",
  "What could cause a yield greater than 100%?",
  "What dangerous gas forms in incomplete combustion?",
  "What determines an element's chemical behavior?",
  "What determines how a compound is named?",
  "What determines if an acid name uses hydro-?",
  "What determines nuclear stability?",
  "What determines the size of an atom?",
  "What determines theoretical yield?",
  "What did Bohr propose?",
  "What did Dalton say about atoms of the same element?",
  "What did Rutherford's gold foil experiment prove?",
  "What did Thomson discover?",
  "What do elements in the same group share?",
  "What do isotopes of the same element share?",
  "What do you do if the subscripts can be reduced?",
  "What does 'ideal' mean in ideal gas?",
  "What does 'like dissolves like' mean?",
  "What does 100% yield mean?",
  "What does Hund's Rule state?",
  "What does KMT stand for?",
  "What does M₁ represent?",
  "What does V₂ represent?",
  "What does \\\"like dissolves like\\\" mean?",
  "What does a P vs V graph look like?",
  "What does a base feel like?",
  "What does a catalyst do?",
  "What does a higher pH mean?",
  "What does a lower pH mean?",
  "What does a negative exponent mean?",
  "What does a point above the curve represent?",
  "What does a point below the curve represent?",
  "What does a point on the line of a solubility curve represent?",
  "What does a positive exponent mean?",
  "What does a solubility curve show?",
  "What does an acid taste like?",
  "What does aqueous (aq) mean?",
  "What does blue litmus paper do in acid?",
  "What does c represent?",
  "What does each variable stand for in PV = nRT?",
  "What does m represent?",
  "What does percent composition add up to?",
  "What does percent error measure?",
  "What does q represent?",
  "What does red litmus paper do in base?",
  "What does the Aufbau Principle state?",
  "What does the Pauli Exclusion Principle state?",
  "What does the atomic number represent?",
  "What does the prefix centi- mean?",
  "What does the prefix kilo- mean?",
  "What does the prefix micro- mean?",
  "What does the prefix milli- mean?",
  "What does theoretical yield assume?",
  "What does ΔH < 0 mean?",
  "What does ΔH > 0 mean?",
  "What does ΔS > 0 mean?",
  "What does ΔT represent?",
  "What does → mean in a chemical equation?",
  "What electrons are involved in bond formation?",
  "What element has atomic number 93?",
  "What element has the largest atomic radius?",
  "What element is the basis of organic chemistry?",
  "What ending do anions get in ionic naming?",
  "What ending do most polyatomic ions have?",
  "What experiment led to the discovery of the nucleus?",
  "What fuel is used in most nuclear reactors?",
  "What happens if you add a seed crystal to a supersaturated solution?",
  "What happens if you add more reactant?",
  "What happens if you remove product?",
  "What happens to Zeff across a period?",
  "What happens to atomic number in alpha decay?",
  "What happens to atomic number in beta decay?",
  "What happens to atomic radius going across a period?",
  "What happens to atomic radius going down a group?",
  "What happens to density if mass increases (volume constant)?",
  "What happens to density if volume increases (mass constant)?",
  "What happens to gas particle speed as temperature increases?",
  "What happens to ionization energy across a period?",
  "What happens to mass number in alpha decay?",
  "What happens to metallic character across a period?",
  "What happens to metallic character down a group?",
  "What happens to oxidation number during oxidation?",
  "What happens to oxidation number during reduction?",
  "What happens to particle motion as a substance melts?",
  "What happens to shielding going down a group?",
  "What happens to the charge when an atom gains an electron?",
  "What happens to the charge when an atom loses an electron?",
  "What happens to the excess reagent?",
  "What happens when an electron drops to a lower energy level?",
  "What happens when buffer capacity is exceeded?",
  "What happens when the same unit appears in numerator and denominator?",
  "What holds atoms together in a compound?",
  "What holds the nucleus together?",
  "What ion do acids produce?",
  "What ion do bases produce?",
  "What is 1 atm in kPa?",
  "What is 1 atm in mmHg?",
  "What is 1 atm in torr?",
  "What is 2.0 × 10⁴ in standard form?",
  "What is 7.1 × 10⁻² in standard form?",
  "What is Avogadro's number?",
  "What is Boyle's Law formula?",
  "What is CO₃²⁻?",
  "What is Carbon-14?",
  "What is Charles' Law formula?",
  "What is Cu²⁺ called in traditional naming?",
  "What is Cu⁺ called in traditional naming?",
  "What is Fe²⁺ called in traditional naming?",
  "What is Fe³⁺ called in traditional naming?",
  "What is Gay-Lussac's Law formula?",
  "What is Gibbs Free Energy?",
  "What is Henry\\'s Law?",
  "What is Hess\\'s Law?",
  "What is Kw?",
  "What is Le Chatelier's Principle?",
  "What is NH₄⁺?",
  "What is NO₃⁻?",
  "What is NaCl in HCl + NaOH → NaCl + H₂O?",
  "What is OH⁻?",
  "What is PO₄³⁻?",
  "What is Planck's equation for photon energy?",
  "What is R in J/(mol·K)?",
  "What is R in L·atm/(mol·K)?",
  "What is SO₄²⁻?",
  "What is STP?",
  "What is a 1 M solution?",
  "What is a Brønsted-Lowry acid?",
  "What is a Brønsted-Lowry base?",
  "What is a Lewis acid?",
  "What is a Lewis base?",
  "What is a PET scan?",
  "What is a balanced equation?",
  "What is a barometer?",
  "What is a binary acid?",
  "What is a bomb calorimeter?",
  "What is a burette?",
  "What is a calorimeter?",
  "What is a catalyst?",
  "What is a chain reaction?",
  "What is a chemical formula?",
  "What is a chemical symbol?",
  "What is a coefficient?",
  "What is a coffee-cup calorimeter?",
  "What is a colloid?",
  "What is a combustion reaction?",
  "What is a concentrated solution?",
  "What is a conversion factor?",
  "What is a crystal lattice?",
  "What is a daughter nucleus?",
  "What is a decomposition reaction?",
  "What is a diatomic gas?",
  "What is a dilute solution?",
  "What is a double replacement reaction?",
  "What is a food Calorie?",
  "What is a hydrocarbon?",
  "What is a kilojoule (kJ)?",
  "What is a limiting reagent?",
  "What is a manometer?",
  "What is a mass-to-mass calculation?",
  "What is a mixture?",
  "What is a mole ratio?",
  "What is a mole?",
  "What is a molecular formula?",
  "What is a molecule?",
  "What is a monatomic gas?",
  "What is a neutralization reaction?",
  "What is a neutron?",
  "What is a node?",
  "What is a nuclear equation?",
  "What is a parent nucleus?",
  "What is a particle accelerator?",
  "What is a polyatomic ion?",
  "What is a precipitate?",
  "What is a proton?",
  "What is a pure substance?",
  "What is a radioactive tracer?",
  "What is a radioisotope?",
  "What is a random error?",
  "What is a redox reaction?",
  "What is a reducing agent?",
  "What is a reversible reaction?",
  "What is a salt?",
  "What is a saturated solution?",
  "What is a single replacement reaction?",
  "What is a skeleton equation?",
  "What is a solution?",
  "What is a stable electron configuration?",
  "What is a standard solution?",
  "What is a state function?",
  "What is a stock solution?",
  "What is a strong acid?",
  "What is a strong base?",
  "What is a sublevel?",
  "What is a supersaturated solution?",
  "What is a suspension?",
  "What is a synthesis reaction?",
  "What is a systematic error?",
  "What is a tincture?",
  "What is a titrant?",
  "What is a volumetric flask used for?",
  "What is a weak acid?",
  "What is a weak base?",
  "What is absolute zero?",
  "What is actual yield?",
  "What is an alloy?",
  "What is an atom?",
  "What is an atomic emission spectrum?",
  "What is an electrolyte?",
  "What is an electron?",
  "What is an empirical formula?",
  "What is an endothermic process?",
  "What is an energy diagram?",
  "What is an enthalpy diagram?",
  "What is an enzyme?",
  "What is an excess reagent?",
  "What is an exothermic process?",
  "What is an ideal gas?",
  "What is an immiscible liquid?",
  "What is an indicator used for in titration?",
  "What is an indicator?",
  "What is an inhibitor?",
  "What is an ion?",
  "What is an isotope?",
  "What is an orbital?",
  "What is an organic compound?",
  "What is an oxidizing agent?",
  "What is an oxyacid?",
  "What is an unsaturated solution?",
  "What is atomic mass?",
  "What is boiling point elevation?",
  "What is buffer capacity?",
  "What is carbon-14 dating?",
  "What is collision theory?",
  "What is combustion?",
  "What is complete combustion?",
  "What is concentration?",
  "What is conductivity?",
  "What is critical mass?",
  "What is dilution?",
  "What is dimensional analysis?",
  "What is directly proportional to temperature in KMT?",
  "What is dynamic equilibrium in a saturated solution?",
  "What is effective nuclear charge (Zeff)?",
  "What is electron affinity?",
  "What is electron configuration?",
  "What is electronegativity?",
  "What is element synthesis?",
  "What is energy?",
  "What is enthalpy (H)?",
  "What is entropy (S)?",
  "What is food irradiation?",
  "What is formula mass?",
  "What is freezing point depression?",
  "What is frequency?",
  "What is gamma decay?",
  "What is half-life?",
  "What is heat capacity?",
  "What is heat?",
  "What is held constant in the Combined Gas Law?",
  "What is incomplete combustion?",
  "What is ionization energy?",
  "What is kinetic energy?",
  "What is malleability?",
  "What is mass defect?",
  "What is mass number?",
  "What is mass/volume percent?",
  "What is metallic luster?",
  "What is molarity?",
  "What is molecular mass?",
  "What is most of the atom made of?",
  "What is n if molar mass is 180 and empirical mass is 30?",
  "What is n in the half-life formula?",
  "What is needed for combustion to occur?",
  "What is net charge?",
  "What is noble gas shorthand?",
  "What is nomenclature?",
  "What is nuclear fission?",
  "What is nuclear waste?",
  "What is osmotic pressure?",
  "What is oxidation?",
  "What is pH paper?",
  "What is percent abundance?",
  "What is percent composition?",
  "What is potential energy?",
  "What is ppm?",
  "What is pressure?",
  "What is radioactivity?",
  "What is reaction rate?",
  "What is reduction?",
  "What is scientific notation?",
  "What is serial dilution?",
  "What is solubility?",
  "What is specific heat?",
  "What is standard enthalpy of formation (ΔH°f)?",
  "What is stoichiometry?",
  "What is temperature?",
  "What is the Arrhenius definition of an acid?",
  "What is the Aufbau Principle?",
  "What is the Combined Gas Law?",
  "What is the Heisenberg Uncertainty Principle?",
  "What is the Henderson-Hasselbalch equation?",
  "What is the Ideal Gas Law?",
  "What is the Law of Conservation of Energy?",
  "What is the SI unit of energy?",
  "What is the SI unit of pressure?",
  "What is the activated complex?",
  "What is the atomic radius?",
  "What is the band of stability?",
  "What is the base unit for length?",
  "What is the base unit for mass?",
  "What is the base unit for volume?",
  "What is the change from Gas directly to Solid called?",
  "What is the change from Gas to Liquid called?",
  "What is the change from Liquid to Gas called?",
  "What is the change from Liquid to Solid called?",
  "What is the change from Solid directly to Gas called?",
  "What is the change from Solid to Liquid called?",
  "What is the charge of a proton?",
  "What is the charge of an electron?",
  "What is the coefficient in scientific notation?",
  "What is the common name for H₂O?",
  "What is the common name for NH₃?",
  "What is the configuration of sodium using shorthand?",
  "What is the conversion map for moles?",
  "What is the criss-cross method?",
  "What is the crisscross method?",
  "What is the diagonal rule?",
  "What is the difference between molarity and molality?",
  "What is the difference in energy between reactants and products called?",
  "What is the dilution equation?",
  "What is the duet rule?",
  "What is the electromagnetic spectrum?",
  "What is the electron cloud?",
  "What is the empirical formula of C₄H₈?",
  "What is the empirical formula of glucose (C₆H₁₂O₆)?",
  "What is the endpoint of a titration?",
  "What is the equivalence point?",
  "What is the formula for ammonium sulfate?",
  "What is the formula for calcium hydroxide?",
  "What is the formula for heat?",
  "What is the formula for magnesium chloride?",
  "What is the formula for percent yield?",
  "What is the formula for potassium sulfide (K⁺ and S²⁻)?",
  "What is the formula for sodium oxide (Na⁺ and O²⁻)?",
  "What is the general formula for alkanes?",
  "What is the half-life of carbon-14?",
  "What is the heaviest known element?",
  "What is the key calorimetry principle?",
  "What is the mass number?",
  "What is the metric system?",
  "What is the mnemonic for diatomic elements?",
  "What is the modern atomic model called?",
  "What is the molar mass of CO₂?",
  "What is the molar mass of NaCl?",
  "What is the molar mass of O₂?",
  "What is the molar volume of a gas at STP?",
  "What is the mole used for in chemistry?",
  "What is the most abundant gas in the atmosphere?",
  "What is the name for Al₂O₃?",
  "What is the name for CO?",
  "What is the name for CO₂?",
  "What is the name for CaBr₂?",
  "What is the name for CuO if copper has a +2 charge?",
  "What is the name for FeCl₃?",
  "What is the name for MgCl₂?",
  "What is the name for MgO?",
  "What is the name for NaCl?",
  "What is the name for N₂O₅?",
  "What is the name for P₂O₅?",
  "What is the name of HF as an acid?",
  "What is the octet rule?",
  "What is the pH if [H⁺] = 0.01 M?",
  "What is the pH of a neutral solution?",
  "What is the pH of pure water?",
  "What is the pH range of acids?",
  "What is the pH scale range?",
  "What is the pOH if [OH⁻] = 1 × 10⁻⁴ M?",
  "What is the percent error formula?",
  "What is the quantum mechanical model?",
  "What is the relationship between pH and pOH?",
  "What is the relationship type between P and T?",
  "What is the simplest hydrocarbon?",
  "What is the solute?",
  "What is the solvent?",
  "What is the specific heat of water?",
  "What is the speed of light equation?",
  "What is the symbol for a beta particle?",
  "What is the symbol for a neutron?",
  "What is the symbol for a proton?",
  "What is the symbol for an alpha particle?",
  "What is the symbol for carbon?",
  "What is the symbol for gold?",
  "What is the symbol for iron?",
  "What is the symbol for molarity?",
  "What is the symbol for oxygen?",
  "What is the symbol for potassium?",
  "What is the symbol for silver?",
  "What is the symbol for sodium?",
  "What is the van der Waals equation?",
  "What is the van\\'t Hoff factor (i)?",
  "What is the volume of 1 mol of gas at STP?",
  "What is the x-axis on a solubility curve?",
  "What is the y-axis on a solubility curve?",
  "What is the ΔH°f of an element in its standard state?",
  "What is theoretical yield?",
  "What is thermal energy?",
  "What is thermal equilibrium?",
  "What is titration?",
  "What is used in nuclear power plants?",
  "What is vapor pressure lowering?",
  "What is wavelength?",
  "What law states matter cannot be created or destroyed?",
  "What laws does it combine?",
  "What mnemonic helps remember redox?",
  "What molecular shape has a 109.5° bond angle?",
  "What molecular shape has a 120° bond angle?",
  "What molecular shape has a 180° bond angle?",
  "What must be balanced in nuclear equations?",
  "What must be consistent on both sides?",
  "What must be true about charges in a compound?",
  "What must happen for a chemical bond to form?",
  "What naming system uses Roman numerals instead of -ous/-ic?",
  "What pH is neutral?",
  "What particle determines the charge of an ion?",
  "What powers the Sun?",
  "What prefix indicates 2 carbons?",
  "What prefix indicates 3 carbons?",
  "What prefix is used for binary acid names?",
  "What prefix means 1?",
  "What prefix means 2?",
  "What prefix means 3?",
  "What prefix means 4?",
  "What prefix means 5?",
  "What prefix means 6?",
  "What provides activation energy for a match striking?",
  "What salt forms from HBr + Ca(OH)₂?",
  "What salt forms from HNO₃ + NaOH?",
  "What salt forms from H₃PO₄ + 3NaOH?",
  "What shape does BF₃ have?",
  "What shape does CO₂ have?",
  "What shape does methane (CH₄) have?",
  "What shape does water (H₂O) have?",
  "What shape is a d orbital?",
  "What shape is a p orbital?",
  "What shape is an s orbital?",
  "What should you always check at the end of a conversion?",
  "What stays constant during dilution?",
  "What stops beta particles?",
  "What structure do ionic compounds form?",
  "What suffix indicates a single bond (alkane)?",
  "What suffix is used for binary acid names?",
  "What symbol represents a reversible reaction?",
  "What temperature scale is used in gas law calculations?",
  "What temperature scale must be used?",
  "What temperature scale must you use?",
  "What two main types of bonds are there?",
  "What type of bond do organic compounds primarily contain?",
  "What type of bond forms between N and O?",
  "What type of bond forms between Na and Cl?",
  "What type of collisions do ideal gas particles have?",
  "What type of container does this law apply to?",
  "What type of electrons are involved in bond formation?",
  "What type of elements form metallic bonds?",
  "What type of mixture is a solution?",
  "What type of naming uses '-ous' and '-ic' suffixes?",
  "What type of reaction is 2H₂ + O₂ → 2H₂O?",
  "What type of reaction is 2H₂O → 2H₂ + O₂?",
  "What type of reaction is NaCl + AgNO₃ → AgCl + NaNO₃?",
  "What type of reaction is Zn + CuSO₄ → ZnSO₄ + Cu?",
  "What type of relationship is P and V?",
  "What unit is molar mass expressed in?",
  "What unit is molecular mass expressed in?",
  "What unit is the mole an SI unit for?",
  "What units must match when R = 0.0821?",
  "What variable is held constant in Boyle's Law?",
  "What variable is held constant?",
  "What was Thomson's model called?",
  "When P, V, and T all change",
  "When a polyatomic ion needs a subscript greater than 1",
  "When are Roman numerals needed in ionic naming?",
  "When are trailing zeros significant?",
  "When do gases behave most ideally?",
  "When do real gases deviate most?",
  "When do you use parentheses in a chemical formula?",
  "When do you use the Combined Gas Law?",
  "When do you use the Ideal Gas Law?",
  "When forward and reverse reaction rates are equal",
  "When is a reaction at equilibrium?",
  "When is a reaction non-spontaneous?",
  "When is a reaction spontaneous?",
  "When moles of acid exactly equal moles of base",
  "When the indicator changes color (near equivalence point)",
  "When the metal can have more than one charge (transition metals)",
  "When two objects reach the same temperature",
  "When you know 3 of 4 variables (P, V, n, T) and solve for the 4th",
  "When ΔG < 0",
  "When ΔG = 0",
  "When ΔG > 0",
  "Where are metals found?",
  "Where are nonmetals found?",
  "Where are protons and neutrons located?",
  "Where do you find atomic masses?",
  "Where does element synthesis occur in nature?",
  "Where does the anion in a salt come from?",
  "Where does the cation in a salt come from?",
  "Which compound has a nearly flat solubility curve?",
  "Which compound has a steep solubility curve?",
  "Which electrons determine bonding behavior?",
  "Which element is named first in an ionic compound?",
  "Which element is the most electronegative?",
  "Which element receives electrons in an ionic bond?",
  "Which element transfers electrons in an ionic bond?",
  "Which favors spontaneity: negative ΔH or positive ΔH?",
  "Which gas behaves most ideally?",
  "Which group is the most reactive family of metals?",
  "Which group of elements rarely forms bonds?",
  "Which has a greater effect: NaCl or sugar at the same molality?",
  "Which has higher specific heat: water or metal?",
  "Which has more energy: radio waves or gamma rays?",
  "Which has more shielding: Na or K?",
  "Which orbital shape is the simplest?",
  "Which releases more energy: fission or fusion?",
  "Which type of radiation is least penetrating?",
  "Which type of radiation is most penetrating?",
  "Who discovered the first transuranium element?",
  "Who discovered this gas law?",
  "Who first achieved artificial transmutation?",
  "Who first proposed the idea of the atom?",
  "Who is Avogadro's number named after?",
  "Why are alkali metals highly reactive?",
  "Why are halogens highly reactive?",
  "Why are metals good conductors of electricity?",
  "Why are metals good conductors of heat?",
  "Why are noble gases monatomic?",
  "Why are super-heavy elements unstable?",
  "Why do atoms form bonds?",
  "Why do atoms get larger going down a group?",
  "Why do buffers work?",
  "Why do real gases deviate at high pressure?",
  "Why do real gases deviate at low temperature?",
  "Why do we use parentheses around polyatomic ions?",
  "Why does He behave more ideally than NH₃?",
  "Why does a sealed can explode if heated?",
  "Why does a soda fizz when opened?",
  "Why does crushing a solid speed up a reaction?",
  "Why does sugar dissolve in water?",
  "Why doesn\\'t oil dissolve in water?",
  "Why is Hess\\'s Law useful?",
  "Why is fusion hard to achieve on Earth?",
  "Why is incomplete combustion dangerous?",
  "Why is naming compounds important in chemistry?",
  "Why is percent yield important?",
  "Why is percent yield usually less than 100%?",
  "Why is salt put on icy roads?",
  "Why is the limiting reagent important?",
  "Why is water used as a coolant?",
  "Why is water used in calorimeters?",
  "Why must chemical equations be balanced?",
  "Why must formulas have a net charge of zero?",
  "Why must the equation be balanced first?",
  "Write 0.0042 in scientific notation.",
  "Write 5,600 in scientific notation.",
  "Write equation, count atoms, add coefficients, verify",
  "Write the electron configuration for neon (10 electrons).",
  "Write the electron configuration for oxygen (8 electrons).",
  "Write the formula for aluminum oxide.",
  "Write the formula for calcium fluoride.",
  "Write the formula for sodium chloride.",
  "Write the word equation for combustion of methane.",
  "Yes (e.g., 3s is larger than 2s)",
  "Yes (zeros between non-zero digits)",
  "Yes — air is a solution of gases with nitrogen as solvent",
  "Yes — gases are more soluble at lower temperatures",
  "Yes — most solids dissolve more at higher temperatures",
  "Yes — using isotopes like uranium-238 or potassium-40",
  "Yes, because they have the same electrons",
  "Yes, even exothermic reactions need a small push",
  "Yes, length is an extensive property",
  "Yes, more collisions = higher pressure",
  "Yes, when n = 1 (e.g., H₂O)",
  "Yields (produces)",
  "Zeff = Z (atomic number) − S (shielding electrons)",
  "Zero",
  "[H⁺] = 10⁻ᵖᴴ",
  "[Ne] 3s¹",
  "[OH⁻] = 10⁻ᵖᴼᴴ",
  "amu (atomic mass units)",
  "atm, L, mol, K",
  "c = λ × ν (3.0 × 10⁸ m/s)",
  "hydro-",
  "hydro- + root of element + -ic acid",
  "mL or L",
  "moles = M × V (in liters)",
  "n = 6",
  "n = PV / RT",
  "pH + pOH = 14",
  "pH = pKa + log([A⁻]/[HA])",
  "pH = −log[H⁺]",
  "pH changes dramatically",
  "pOH = −log[OH⁻]",
  "q = CΔT",
  "q = mcΔT",
  "q = mcΔT for each substance; then set q_lost = −q_gained",
  "q_lost = −q_gained (energy is conserved)",
  "s orbital (spherical)",
  "s, p, d, f",
  "x, y, and z axes",
  "|experimental − accepted| / accepted × 100%",
  "¹₀n",
  "¹₁p",
  "ΔG = ΔH − TΔS; predicts spontaneity",
  "ΔH is also multiplied by 2",
  "ΔH°rxn = ΣΔH°f(products) − ΣΔH°f(reactants)",
  "⁰₋₁e",
  "⁴₂He",
  "⇌ (double arrow)"
]