{
    "version": "1.4.0",
    "updates": [
        {
            "version": "1.4.0",
            "date": "2026-02-26",
            "title": "Teacher Assistant Tools",
            "features": [
                "Real-Time Analytics: Teachers can now see live student counts.",
                "Class Management: Create classes and generate unique access codes.",
                "Secure Role Persistence: Improved stability for teacher accounts.",
                "Data Isolation: Automatic cleanup on logout to protect student privacy."
            ],
            "bugFixes": [
                "Fixed login role resetting issues.",
                "Resolved taskbar dropdown visibility bugs."
            ]
        },
        {
            "version": "1.3.1",
            "date": "2026-02-26",
            "title": "Community & Forums Update",
            "features": [
                "New Forum Delete Button: You can now delete your own suggestions.",
                "Soft Delete: Posts are hidden instead of permanently removed.",
                "Legacy Post Support: You can also clean up your old ownerless posts.",
                "Mobile Compatibility: Improved responsiveness for phones and tablets."
            ],
            "bugFixes": [
                "Fixed permissions for deleting forum posts.",
                "Fixed dashboard progress tracking sync."
            ]
        },
        {
            "version": "1.3.0",
            "date": "2026-02-25",
            "title": "Immersive Sounds Update",
            "features": [
                "New Ambience System: Added Rain, Forest, Coffee Shop, and Ocean sounds",
                "New Sound Controls: Toggle and control volume from the floating widget",
                "Forum Fixes: Suggestions now save reliably"
            ],
            "improvements": [
                "Cleaned up UI: Moved sound toggles to dedicated widget",
                "Performance optimizations for audio loading"
            ],
            "bugFixes": [
                "Fixed issue where forum posts would disappear",
                "Fixed dark mode text visibility"
            ]
        },
        {
            "version": "1.2.0",
            "date": "2026-02-25",
            "title": "Multilingual & Arcade Expansion",
            "features": [
                "Spanish Mode (Beta): Added initial Spanish translation support across core lessons.",
                "Algebra 2 Expansion: New lesson content and translations for advanced math.",
                "Arcade Refinements: Improved game scaling and responsiveness.",
                "Translation Debugger: New tools to help identify missing translation keys."
            ],
            "improvements": [
                "Reduced visual flash when switching languages.",
                "Standardized navigation buttons across all quiz pages."
            ]
        },
        {
            "version": "1.1.0",
            "date": "2026-02-24",
            "title": "Core Logic Optimization",
            "features": [
                "Unified Game Engine: Deduplicated game logic scripts for faster loading.",
                "Standardized Lesson Structure: Physics and Chemistry lessons now use a consistent template.",
                "Unit Test Improvements: Fixed duplicate buttons and scoring glitches."
            ],
            "bugFixes": [
                "Fixed scoring bug in multi-choice quizzes.",
                "Resolved navigation loop in Physics Unit 3."
            ]
        },
         {
            "version": "1.0.5",
            "date": "2026-02-23",
            "title": "Algebra & Content Update",
            "features": [
                "Algebra 1 Content Pack: Added 10+ new interactive lessons.",
                "Geometry Flashcards: New study tools for vocabulary retention.",
                "Language Shortcuts: Quickly toggle languages with keyboard shortcuts."
            ],
            "improvements": [
                "Enhanced mobile layout for course selection cards.",
                "Updated tutorial overlays for first-time users."
            ]
        },
        {
            "version": "1.0.0",
            "date": "2024-05-20",
            "title": "Welcome to ArisEdu",
            "features": [
                "Initial Release: Launching the full ArisEdu learning platform.",
                "Core Subjects: Algebra 1, Geometry, Biology, Chemistry, and Physics courses are live.",
                "Dashboard 1.0: Track your progress, streak, and badges.",
                "Gamified Learning: Earn badges for streaks, quiz mastery, and exploration."
            ],
            "notes": [
                "Start learning Algebra, Physics, and more!",
                "Create an account to save your progress."
            ]
        }
    ]
}
