{
    "version": "2.1.0",
    "updates": [
        {
            "version": "2.1.0",
            "date": "2026-03-01",
            "title": "New Craft 2D Game & Arcade Updates",
            "features": [
                "Craft 2D Game: Added a new 2D crafting and building game to the Arcade — place blocks, mine resources, and build creations in a sandbox environment."
            ],
            "improvements": [
                "Arcade-wide polish and minor fixes across all game pages."
            ],
            "bugFixes": []
        },
        {
            "version": "2.0.0",
            "date": "2026-02-28",
            "title": "Middle School Course Experience Overhaul",
            "features": [
                "Complete Middle School Course System: 6 new dedicated MS courses (Pre-Algebra, Algebra Foundations, Geometry, Physical Science, Chemistry Foundations, Life Science) with 6-8 units each, removing 70+ advanced HS-only lessons.",
                "Dynamic Back-to-Course Navigation: Smart return tracking remembers whether students came from MS or HS course pages, ensuring they always return to the correct origin.",
                "Middle School Quiz System: Reduced to 5 questions max (vs unlimited for HS), 3 attempt limit (vs 2), wrong-answer elimination, and automatic removal of 200+ HS-only advanced questions.",
                "Curated Flashcards for Unit Tests: 41 unit test practice files now have `window.msFlashcards` with 15-25 MS-focused cards instead of 50-80 HS cards.",
                "Easier Practice Games: Climb game gets +50% fuel and -50% gravity, match games reduced to 5-10 pairs instead of 20+, simpler feedback for younger students.",
                "Auto-Select Easiest Video: MS students automatically see the introductory video first, reducing cognitive load.",
                "One-Way Progress Sync (HS→MS Only): HS completion marks MS lesson complete, but MS completion does NOT affect HS progress, keeping MS isolated."
            ],
            "improvements": [
                "Fixed critical MS mode detection bug: `sessionStorage.courseOrigin` key was never being set, breaking ALL MS features (flashcards, quizzes, videos, games).",
                "Added `data-hs-only='true'` attributes to 200+ advanced questions across 68 quiz and unit test files.",
                "Python script `curate_ms_test_flashcards.py` automatically extracts and filters flashcards: max 5 per lesson, max 25 per unit.",
                "MS course lesson filtering: Each of 6 MS courses includes only appropriate lessons (e.g., MS Algebra 1 Unit 3 includes 3.1, 3.2, 3.4, 3.5, 3.6 but skips 3.3).",
                "Session storage improvements for reliable MS mode detection across all lesson types.",
                "Geometry flashcard extraction now handles both single and double-quoted strings."
            ],
            "bugFixes": [
                "CRITICAL: Fixed `courseOrigin` key mismatch in taskbar.js — was storing `courseOrigin_ChemistryLessons` but all scripts read `courseOrigin` (null).",
                "Fixed MS mode detection broken in practice_games.js, quiz_ui.js, lesson_video.js, and unit_test.js due to missing sessionStorage key.",
                "Created 4 missing Chemistry Unit 5A/5B test files.",
                "Fixed Geometry Unit 1-8 flashcard extraction failing due to quote style mismatch.",
                "Fixed Biology Unit 5 gracefully handling missing Lesson 5.6 file."
            ],
            "statistics": {
                "ms_courses": 6,
                "ms_units": 44,
                "lessons_in_ms": 180,
                "hs_lessons_removed": 70,
                "test_files_updated": 68,
                "ms_flashcards_total": 720,
                "hs_only_questions_marked": 205,
                "unit_tests_with_flashcards": 41
            }
        },
        {
            "version": "1.6.0",
            "date": "2026-02-28",
            "title": "Middle School Courses & Login Revamp",
            "features": [
                "Middle School Courses: Added 6 new middle school course pages — Pre-Algebra, Algebra Foundations, Geometry, Physical Science, Chemistry Foundations, and Life Science.",
                "Courses Page Expansion: Middle School Mathematics and Middle School Science sections now appear on the Courses page.",
                "Separate Login & Signup: Split the combined Login/Signup page into dedicated Login and Signup pages for a cleaner auth flow.",
                "Translation Expansion: Added 1,000+ new Chinese, Hindi, and Spanish translations covering science lesson content."
            ],
            "improvements": [
                "Updated all navigation links across the app to point to the new Login page.",
                "Adjusted course page layouts (min-height) for Algebra 1, Algebra 2, Biology, Chemistry, Geometry, and Physics to prevent content overflow.",
                "Fixed several Geometry lesson summary pages with minor corrections."
            ],
            "bugFixes": [
                "Fixed broken login redirect links in Account Info, Preferences, Taskbar, and the landing page.",
                "Resolved layout clipping issues on course listing pages at various screen sizes."
            ]
        },
        {
            "version": "1.5.0",
            "date": "2026-02-27",
            "title": "Arcade & Session Overhaul",
            "features": [
                "Unified Arcade Layout: All games now use a consistent SESSION sidebar and game card sizing for a cleaner experience.",
                "Session Timer & Tokens: Play sessions now show a live countdown and can be extended using arcade tokens.",
                "Auto-Pause Protection: Games automatically pause (and pause the session timer) when you switch tabs or windows.",
                "Token Time Boost Buttons: New +50s / +100s / +200s blue buttons under the SESSION timer let you spend tokens to add time.",
                "Lesson Completion Rewards: Completing a lesson quiz for the first time now grants +100 arcade tokens.",
                "Quiz Completion Screen: New detailed completion screen shows time, accuracy, question breakdown, and any token rewards earned."
            ],
            "improvements": [
                "Removed legacy fullscreen/scale hacks that caused glitched game layouts.",
                "Standardized pause overlays so auto-pause uses the same UI as pressing P in games.",
                "Smoothed navigation between quizzes, practice, and the arcade for a more connected experience."
            ],
            "bugFixes": [
                "Fixed cases where the quiz completion screen would not appear for Unit-based lesson quiz files.",
                "Resolved inconsistencies in how session time extensions updated the visible countdown.",
                "Fixed rare layout overlaps between the arcade sidebar and game canvas on smaller screens."
            ]
        },
        {
            "version": "1.4.0",
            "date": "2026-02-26",
            "title": "Teacher Assistant Tools",
            "features": [
                "Real-Time Analytics: Teachers can now see live student counts.",
                "Class Management: Create classes and generate unique access codes.",
                "Secure Role Persistence: Improved stability for teacher accounts.",
                "Data Isolation: Automatic cleanup on logout to protect student privacy."
            ],
            "bugFixes": [
                "Fixed login role resetting issues.",
                "Resolved taskbar dropdown visibility bugs."
            ]
        },
        {
            "version": "1.3.1",
            "date": "2026-02-26",
            "title": "Community & Forums Update",
            "features": [
                "New Forum Delete Button: You can now delete your own suggestions.",
                "Soft Delete: Posts are hidden instead of permanently removed.",
                "Legacy Post Support: You can also clean up your old ownerless posts.",
                "Mobile Compatibility: Improved responsiveness for phones and tablets."
            ],
            "bugFixes": [
                "Fixed permissions for deleting forum posts.",
                "Fixed dashboard progress tracking sync."
            ]
        },
        {
            "version": "1.3.0",
            "date": "2026-02-25",
            "title": "Immersive Sounds Update",
            "features": [
                "New Ambience System: Added Rain, Forest, Coffee Shop, and Ocean sounds",
                "New Sound Controls: Toggle and control volume from the floating widget",
                "Forum Fixes: Suggestions now save reliably"
            ],
            "improvements": [
                "Cleaned up UI: Moved sound toggles to dedicated widget",
                "Performance optimizations for audio loading"
            ],
            "bugFixes": [
                "Fixed issue where forum posts would disappear",
                "Fixed dark mode text visibility"
            ]
        },
        {
            "version": "1.2.0",
            "date": "2026-02-25",
            "title": "Multilingual & Arcade Expansion",
            "features": [
                "Spanish Mode (Beta): Added initial Spanish translation support across core lessons.",
                "Algebra 2 Expansion: New lesson content and translations for advanced math.",
                "Arcade Refinements: Improved game scaling and responsiveness.",
                "Translation Debugger: New tools to help identify missing translation keys."
            ],
            "improvements": [
                "Reduced visual flash when switching languages.",
                "Standardized navigation buttons across all quiz pages."
            ]
        },
        {
            "version": "1.1.0",
            "date": "2026-02-24",
            "title": "Core Logic Optimization",
            "features": [
                "Unified Game Engine: Deduplicated game logic scripts for faster loading.",
                "Standardized Lesson Structure: Physics and Chemistry lessons now use a consistent template.",
                "Unit Test Improvements: Fixed duplicate buttons and scoring glitches."
            ],
            "bugFixes": [
                "Fixed scoring bug in multi-choice quizzes.",
                "Resolved navigation loop in Physics Unit 3."
            ]
        },
         {
            "version": "1.0.5",
            "date": "2026-02-23",
            "title": "Algebra & Content Update",
            "features": [
                "Algebra 1 Content Pack: Added 10+ new interactive lessons.",
                "Geometry Flashcards: New study tools for vocabulary retention.",
                "Language Shortcuts: Quickly toggle languages with keyboard shortcuts."
            ],
            "improvements": [
                "Enhanced mobile layout for course selection cards.",
                "Updated tutorial overlays for first-time users."
            ]
        },
        {
            "version": "1.0.0",
            "date": "2026-02-18",
            "title": "Welcome to ArisEdu",
            "features": [
                "Initial Release: Launching the full ArisEdu learning platform.",
                "Core Subjects: Algebra 1, Geometry, Biology, Chemistry, and Physics courses are live.",
                "Dashboard 1.0: Track your progress, streak, and badges.",
                "Gamified Learning: Earn badges for streaks, quiz mastery, and exploration."
            ],
            "notes": [
                "Start learning Algebra, Physics, and more!",
                "Create an account to save your progress."
            ]
        }
    ]
}
